
<!DOCTYPE HTML>
<html lang="zh-cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Functionally Solving Problems · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11-functors-applicative-functors-and-monoids.html" />
    
    
    <link rel="prev" href="9-input-and-output.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    HASKELL 趣学指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-ready-go.html">
            
                <a href="2-ready-go.html">
            
                    
                    Ready Go
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-type-and-typeclass.html">
            
                <a href="3-type-and-typeclass.html">
            
                    
                    Type And Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-syntax-in-function.html">
            
                <a href="4-syntax-in-function.html">
            
                    
                    Syntax in Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-recursion.html">
            
                <a href="5-recursion.html">
            
                    
                    Recursion
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-high-order-function.html">
            
                <a href="6-high-order-function.html">
            
                    
                    High Order Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-module.html">
            
                <a href="7-module.html">
            
                    
                    Module
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-build-our-own-type-and-typeclass.html">
            
                <a href="8-build-our-own-type-and-typeclass.html">
            
                    
                    Build Our Own Type and Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-input-and-output.html">
            
                <a href="9-input-and-output.html">
            
                    
                    Input and Output
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="10-functionally-solving-problems.html">
            
                <a href="10-functionally-solving-problems.html">
            
                    
                    Functionally Solving Problems
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-functors-applicative-functors-and-monoids.html">
            
                <a href="11-functors-applicative-functors-and-monoids.html">
            
                    
                    Functors, Applicative Functors 与 Monoids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-a-fistful-of-monads.html">
            
                <a href="12-a-fistful-of-monads.html">
            
                    
                    A Fistful of Monad
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-for-a-few-monads-more.html">
            
                <a href="13-for-a-few-monads-more.html">
            
                    
                    For a Few Monad More
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-zippers.html">
            
                <a href="14-zippers.html">
            
                    
                    Zippers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    Resource
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Functionally Solving Problems</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x51FD;&#x6570;&#x5F0F;&#x5730;&#x601D;&#x8003;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;">&#x51FD;&#x6570;&#x5F0F;&#x5730;&#x601D;&#x8003;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;</h1>
<p>&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x67E5;&#x770B;&#x51E0;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x7528;&#x51FD;&#x6570;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6F02;&#x4EAE;&#x5730;&#x89E3;&#x51B3;&#x4ED6;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x4F1A;&#x4ECB;&#x7ECD;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x7EC3;&#x4E60;&#x6211;&#x4EEC;&#x521A;&#x5B66;&#x5230;&#x7684;&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x6BCF;&#x4E00;&#x8282;&#x90FD;&#x4F1A;&#x63A2;&#x8BA8;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F1A;&#x5148;&#x63CF;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x4ED6;&#x3002;</p>
<h2 id="&#x8FD0;&#x7B97;&#x9006;&#x6CE2;&#x5170;&#x8868;&#x793A;&#x6CD5;reverse-polish-notation-form">&#x8FD0;&#x7B97;&#x9006;&#x6CE2;&#x5170;&#x8868;&#x793A;&#x6CD5;(Reverse Polish notation form)</h2>
<p>&#x6211;&#x4EEC;&#x5728;&#x5B66;&#x6821;&#x5B66;&#x4E60;&#x6570;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x591A;&#x534A;&#x90FD;&#x662F;&#x7528;&#x4E2D;&#x7F6E;(infix)&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5199;&#x6570;&#x5B66;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5199; <code>10 - (4 + 3) * 2</code>&#x3002;<code>+</code>, <code>*</code>, <code>-</code> &#x662F;&#x4E2D;&#x7F6E;&#x8FD0;&#x7B97;&#x5B50;(infix operators)&#x3002;&#x5728; Haskell &#x4E2D;&#x5C31;&#x50CF;&#x662F; <code>+</code> &#x6216; <code>elem</code> &#x4E00;&#x6837;&#x3002;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x5BF9;&#x4E8E;&#x4EBA;&#x7C7B;&#x6765;&#x8BF4;&#x5F88;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#x4E0E;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x7F3A;&#x70B9;&#x662F;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x7528;&#x62EC;&#x53F7;&#x6765;&#x63CF;&#x8FF0;&#x8FD0;&#x7B97;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p>&#x9006;&#x6CE2;&#x5170;&#x8868;&#x793A;&#x6CD5;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x6570;&#x5B66;&#x5F0F;&#x7684;&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x3002;&#x4E4D;&#x770B;&#x4E4B;&#x4E0B;&#x663E;&#x5F97;&#x602A;&#x5F02;&#xFF0C;&#x4F46;&#x4ED6;&#x5176;&#x5B9E;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x5E76;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x62EC;&#x5F27;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x653E;&#x8FDB;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#x9762;&#x8FD0;&#x7B97;&#x3002;&#x5C3D;&#x7BA1;&#x73B0;&#x5728;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x662F;&#x7528;&#x4E2D;&#x7F6E;&#x7684;&#x65B9;&#x5F0F;&#x8BA9;&#x4F60;&#x8F93;&#x5165;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4ECD;&#x575A;&#x6301;&#x7528; RPN &#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x524D;&#x8FF0;&#x7684;&#x7B97;&#x5F0F;&#x5982;&#x679C;&#x8868;&#x8FBE;&#x6210; RPN &#x7684;&#x8BDD;&#x4F1A;&#x662F; <code>10 4 3 + 2 * -</code>&#x3002;&#x6211;&#x4EEC;&#x8981;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x4ED6;&#x7684;&#x7ED3;&#x679C;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;&#x5806;&#x53E0;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x662F;&#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#x9605;&#x8BFB;&#x7B97;&#x5F0F;&#x3002;&#x6BCF;&#x5F53;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#xFF0C;&#x5C31;&#x628A;&#x4ED6;&#x5806;&#x4E0A;&#x5806;&#x53E0;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#x3002;&#x5C31;&#x628A;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x4ECE;&#x5806;&#x53E0;&#x4E0A;&#x62FF;&#x4E0B;&#x6765;&#xFF0C;&#x7528;&#x8FD0;&#x7B97;&#x5B50;&#x8FD0;&#x7B97;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x7136;&#x540E;&#x628A;&#x7ED3;&#x679C;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x4E2D;&#x3002;&#x5F53;&#x4F60;&#x6D88;&#x8017;&#x5B8C;&#x6574;&#x4E2A;&#x7B97;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x800C;&#x4E14;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x7B97;&#x5F0F;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x5728;&#x5806;&#x53E0;&#x4E2D;&#xFF0C;</p>
<p><img src="img/rpn.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x518D;&#x63A5;&#x7740;&#x770B; <code>10 4 3 + 2 * -</code>&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x628A; <code>10</code> &#x63A8;&#x5230;&#x5806;&#x53E0;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x53E0;&#x73B0;&#x5728;&#x662F; <code>10</code>&#x3002;&#x4E0B;&#x4E00;&#x4E2A;&#x63A5;&#x7740;&#x7684;&#x8F93;&#x5165;&#x662F; <code>4</code>&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x628A;&#x4ED6;&#x63A8;&#x4E0A;&#x5806;&#x53E0;&#x3002;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x4FBF;&#x53D8;&#x6210; <code>10, 4</code>&#x3002;&#x63A5;&#x7740;&#x4E5F;&#x5BF9;&#x4E0B;&#x4E00;&#x4E2A;&#x8F93;&#x5165; <code>3</code> &#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x53E0;&#x53D8;&#x6210; <code>10, 4, 3</code>&#x3002;&#x7136;&#x540E;&#x4FBF;&#x78B0;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50; <code>+</code>&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5806;&#x53E0;&#x6700;&#x4E0A;&#x5C42;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x53D6;&#x4E0B;&#x6765;&#xFF08;&#x6240;&#x4EE5;&#x5806;&#x53E0;&#x53D8;&#x6210; <code>10</code>&#xFF09;&#x628A;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x52A0;&#x8D77;&#x6765;&#x7136;&#x540E;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x4E0A;&#x3002;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x4FBF;&#x53D8;&#x6210; <code>10, 7</code>&#x3002;&#x6211;&#x4EEC;&#x518D;&#x628A;&#x8F93;&#x5165; <code>2</code> &#x63A8;&#x4E0A;&#x5806;&#x53E0;&#xFF0C;&#x5806;&#x53E0;&#x53D8;&#x6210; <code>10, 7, 2</code>&#x3002;&#x6211;&#x4EEC;&#x53C8;&#x78B0;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x628A; <code>7</code> &#x8DDF; <code>2</code> &#x53D6;&#x4E0B;&#xFF0C;&#x628A;&#x4ED6;&#x4EEC;&#x76F8;&#x4E58;&#x8D77;&#x6765;&#x7136;&#x540E;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x4E0A;&#x3002;<code>7</code> &#x8DDF; <code>2</code> &#x76F8;&#x4E58;&#x7684;&#x7ED3;&#x679C;&#x662F; <code>14</code>&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x662F; <code>10, 14</code>&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x78B0;&#x5230;&#x4E86; <code>-</code>&#x3002;&#x6211;&#x4EEC;&#x628A; <code>10</code> &#x8DDF; <code>14</code> &#x53D6;&#x4E0B;&#xFF0C;&#x5C06;&#x4ED6;&#x4EEC;&#x76F8;&#x51CF;&#x7136;&#x540E;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x4E0A;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x6210; <code>-4</code>&#x3002;&#x800C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x628A;&#x6240;&#x6709;&#x6570;&#x503C;&#x8DDF;&#x8FD0;&#x7B97;&#x5B50;&#x7684;&#x6D88;&#x8017;&#x5B8C;&#x4E86;&#xFF0C;&#x6240;&#x4EE5; <code>-4</code> &#x4FBF;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x624B;&#x7B97; RPN &#x8FD0;&#x7B97;&#x5F0F;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x5199;&#x4E00;&#x4E2A; Haskell &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5F53;&#x4ED6;&#x63A5;&#x5230;&#x4E00;&#x4E2A; RPN &#x8FD0;&#x7B97;&#x5F0F;&#xFF0C;&#x50CF;&#x662F; <code>&quot;10 4 3 + 2 * -&quot;</code> &#x65F6;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x578B;&#x522B;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5B57;&#x4E32;&#x5F53;&#x4F5C;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4EA7;&#x51FA;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x4F5C;&#x4E3A;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x4F1A;&#x662F; <code>solveRPN :: (Num a) =&gt; String -&gt; a</code>&#x3002;</p>
<pre><code class="lang-text">&#x5C0F;&#x5EFA;&#x8BAE;&#xFF1A;&#x5728;&#x4F60;&#x53BB;&#x5B9E;&#x4F5C;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x60F3;&#x4E00;&#x4E0B;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x5BA3;&#x544A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x578B;&#x522B;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x5398;&#x6E05;&#x95EE;&#x9898;&#x3002;&#x5728; Haskell &#x4E2D;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x6709;&#x591F;&#x5F3A;&#x7684;&#x578B;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5149;&#x4ECE;&#x51FD;&#x6570;&#x7684;&#x5BA3;&#x544A;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8BB8;&#x591A;&#x4FE1;&#x606F;&#x3002;
</code></pre>
<p><img src="img/calculator.png" alt=""></p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x8981;&#x5B9E;&#x4F5C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x6CD5;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x52A8;&#x624B;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x89E3;&#x770B;&#x770B;&#xFF0C;&#x5C1D;&#x8BD5;&#x4ECE;&#x91CC;&#x9762;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x7075;&#x611F;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x7A7A;&#x767D;&#x9694;&#x5F00;&#x7684;&#x6570;&#x503C;&#x6216;&#x8FD0;&#x7B97;&#x5B50;&#x90FD;&#x5F53;&#x4F5C;&#x72EC;&#x7ACB;&#x7684;&#x4E00;&#x9879;&#x3002;&#x6240;&#x4EE5;&#x628A; <code>&quot;10 4 3 + 2 * -&quot;</code> &#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5B57;&#x4E32;&#x65AD;&#x6210;&#x4E00;&#x4E32; list <code>[&quot;10&quot;,&quot;4&quot;,&quot;3&quot;,&quot;+&quot;,&quot;2&quot;,&quot;*&quot;,&quot;-&quot;]</code> &#x5E94;&#x8BE5;&#x4F1A;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8981;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x8FD9;&#x4E2A;&#x65AD;&#x597D;&#x7684; list &#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x6765;&#x8D70;&#x4E00;&#x904D;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x7528;&#x7684;&#x5806;&#x53E0;&#x3002;&#x8FD9;&#x6837;&#x6709;&#x8BA9;&#x4F60;&#x60F3;&#x5230;&#x4E9B;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x5417;&#xFF1F;&#x6CA1;&#x9519;&#xFF0C;&#x5728; <code>folds</code> &#x7684;&#x90A3;&#x4E00;&#x7AE0;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x57FA;&#x672C;&#x4E0A;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x6216;&#x7531;&#x53F3;&#x81F3;&#x5DE6;&#x8D70;&#x8FC7;&#x4E00;&#x904D; list &#x7684;&#x65F6;&#x5019;&#x5E76;&#x4EA7;&#x751F;&#x4E9B;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x80FD;&#x7528; fold &#x6765;&#x5B9E;&#x4F5C;&#x4ED6;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A; case &#x4E2D;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x662F;&#x4ECE;&#x5DE6;&#x8FB9;&#x8D70;&#x5230;&#x53F3;&#x8FB9;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x91C7;&#x53D6; left fold&#x3002;accumulator &#x5219;&#x662F;&#x9009;&#x7528;&#x5806;&#x53E0;&#xFF0C;&#x800C; fold &#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5806;&#x53E0;&#xFF0C;&#x53EA;&#x662F;&#x91CC;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x8981;&#x591A;&#x8003;&#x8651;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x6211;&#x4EEC;&#x7528;&#x4EC0;&#x4E48;&#x6765;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x7684;&#x5806;&#x53E0;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528; list &#x6765;&#x4EE3;&#x66FF;&#xFF0C;list &#x7684; head &#x5C31;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x662F;&#x5806;&#x53E0;&#x7684;&#x9876;&#x7AEF;&#x3002;&#x6BD5;&#x7ADF;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x52A0;&#x5230; list &#x7684; head &#x8981;&#x6BD4;&#x52A0;&#x5230;&#x6700;&#x540E;&#x8981;&#x6709;&#x6548;&#x7387;&#x591A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5806;&#x53E0;&#xFF0C;&#x91CC;&#x9762;&#x6709; <code>10, 4, 3</code>&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528; <code>[3,4,10]</code> &#x6765;&#x4EE3;&#x8868;&#x4ED6;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x5199;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x3002;&#x4ED6;&#x4F1A;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5B57;&#x4E32; <code>&quot;10 4 3 + 2 * -&quot;</code>&#xFF0C;&#x968F;&#x5373;&#x7528; <code>words</code> &#x6765;&#x65AD;&#x6210; list <code>[&quot;10&quot;,&quot;4&quot;,&quot;3&quot;,&quot;+&quot;,&quot;2&quot;,&quot;*&quot;,&quot;-&quot;]</code>&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E2A; left fold &#x6765;&#x4EA7;&#x751F;&#x51FA;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; <code>[-4]</code>&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x4ECE; list &#x53D6;&#x51FA;&#x4FBF;&#x662F;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6765;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> expression = head (foldl foldingFunction [] (words expression))  
    <span class="hljs-keyword">where</span>   foldingFunction stack item = ...
</code></pre>
<p>&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5F0F;&#x5E76;&#x628A;&#x4ED6;&#x65AD;&#x6210;&#x4E00;&#x4E32; List&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A; folding &#x51FD;&#x6570;&#x6765; fold &#x8FD9;&#x4E32; list&#x3002;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x7528; <code>[]</code> &#x6765;&#x5F53;&#x4F5C;&#x8D77;&#x59CB;&#x7684; accumulator&#x3002;&#x8FD9;&#x4E2A; accumulator &#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x6240;&#x4EE5; <code>[]</code> &#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x5806;&#x53E0;&#x3002;&#x5728;&#x8FD0;&#x7B97;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x6211;&#x4EEC;&#x8C03;&#x7528; <code>head</code> &#x6765;&#x53D6;&#x51FA;&#x4ED6;&#x5E76;&#x7528; <code>read</code> &#x6765;&#x8F6C;&#x6362;&#x4ED6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EA;&#x7F3A;&#x4E00;&#x4E2A;&#x63A5;&#x53D7;&#x5806;&#x53E0;&#x7684; folding &#x51FD;&#x6570;&#xFF0C;&#x50CF;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7; <code>[4,10]</code> &#x8DDF; <code>&quot;3&quot;</code>&#xFF0C;&#x7136;&#x540E;&#x5F97;&#x5230; <code>[3,4,10]</code>&#x3002;&#x5982;&#x679C;&#x662F; <code>[4,10]</code> &#x8DDF; <code>&quot;*&quot;</code>&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x5F97;&#x5230; <code>[40]</code>&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x6539;&#x5199;&#x6210; point-free style&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7701;&#x4E0B;&#x8BB8;&#x591A;&#x62EC;&#x53F7;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
      <span class="hljs-keyword">where</span>   foldingFunction stack item = ...
</code></pre>
<p>&#x770B;&#x8D77;&#x6765;&#x597D;&#x591A;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7684; folding &#x51FD;&#x6570;&#x4F1A;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5806;&#x53E0;&#x3001;&#x65B0;&#x7684;&#x9879;&#xFF0C;&#x5E76;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5806;&#x53E0;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x53D6;&#x51FA;&#x5806;&#x53E0;&#x6700;&#x4E0A;&#x5C42;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x5BF9; <code>&quot;*&quot;</code> &#x8DDF; <code>&quot;-&quot;</code> &#x505A;&#x5339;&#x914D;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a, <span class="hljs-type">Read</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
    <span class="hljs-keyword">where</span>   foldingFunction (x:y:ys) <span class="hljs-string">&quot;*&quot;</span> = (x * y):ys  
            foldingFunction (x:y:ys) <span class="hljs-string">&quot;+&quot;</span> = (x + y):ys  
            foldingFunction (x:y:ys) <span class="hljs-string">&quot;-&quot;</span> = (y - x):ys  
            foldingFunction xs numberString = read numberString:xs
</code></pre>
<p>&#x6211;&#x4EEC;&#x7528;&#x5C55;&#x5F00;&#x6210;&#x56DB;&#x4E2A;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x6A21;&#x5F0F;&#x4F1A;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x5339;&#x914D;&#x3002;&#x6240;&#x4EE5; folding &#x51FD;&#x6570;&#x4F1A;&#x770B;&#x770B;&#x76EE;&#x524D;&#x7684;&#x9879;&#x662F;&#x5426;&#x662F; <code>&quot;*&quot;</code>&#x3002;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x5C06; <code>[3,4,9,3]</code> &#x7684;&#x5934;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7ED1;&#x5B9A;&#x5230; <code>x</code>&#xFF0C;<code>y</code> &#x4E24;&#x4E2A;&#x540D;&#x79F0;&#x3002;&#x6240;&#x4EE5; <code>x</code> &#x4F1A;&#x662F; <code>3</code> &#x800C; <code>y</code> &#x7B49;&#x4E8E; <code>4</code>&#x3002;<code>ys</code> &#x4FBF;&#x4F1A;&#x662F; <code>[9,3]</code>&#x3002;&#x4ED6;&#x4F1A;&#x56DE;&#x4F20;&#x4E00;&#x4E2A; list&#xFF0C;&#x53EA;&#x5DEE;&#x5728; <code>x</code> &#x8DDF; <code>y</code> &#x76F8;&#x4E58;&#x7684;&#x7ED3;&#x679C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F1A;&#x628A;&#x6700;&#x4E0A;&#x5C42;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x53D6;&#x51FA;&#xFF0C;&#x76F8;&#x4E58;&#x540E;&#x518D;&#x653E;&#x56DE;&#x53BB;&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E0D;&#x662F; <code>&quot;*&quot;</code>&#xFF0C;&#x90A3;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x5C31;&#x4F1A;&#x6BD4;&#x5BF9;&#x5230; <code>&quot;+&quot;</code>&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9879;&#x5E76;&#x672A;&#x5339;&#x914D;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x5B57;&#x4E32;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7528; <code>read</code> &#x6765;&#x628A;&#x5B57;&#x4E32;&#x8F6C;&#x6362;&#x6210;&#x6570;&#x503C;&#x3002;&#x5E76;&#x628A;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x63A8;&#x5230;&#x5806;&#x53E0;&#x4E0A;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x52A0;&#x4E86; <code>Read a</code> &#x8FD9;&#x50CF; class constraint&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x8981;&#x4F7F;&#x7528;&#x5230; <code>read</code> &#x6765;&#x8F6C;&#x6362;&#x6210;&#x6570;&#x503C;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8981;&#x5BA3;&#x544A;&#x6210;&#x4ED6;&#x8981;&#x5C5E;&#x4E8E; <code>Num</code> &#x8DDF; <code>Read</code> &#x4E24;&#x79CD; typeclass&#x3002;&#xFF08;&#x8B6C;&#x5982;&#x8BF4; <code>Int</code>,<code>Float</code> &#x7B49;&#xFF09;</p>
<p>&#x6211;&#x4EEC;&#x662F;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x8D70;&#x8FC7; <code>[&quot;2&quot;,&quot;3&quot;,&quot;+&quot;]</code>&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x662F; <code>[]</code>&#x3002;&#x9996;&#x5148;&#x4ED6;&#x4F1A;&#x7528; <code>[]</code> &#x8DDF; <code>&quot;2&quot;</code> &#x6765;&#x5582;&#x7ED9; folding &#x51FD;&#x6570;&#x3002;&#x7531;&#x4E8E;&#x6B64;&#x9879;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#x3002;&#x4ED6;&#x4F1A;&#x7528; <code>read</code> &#x8BFB;&#x53D6;&#x540E;&#x52A0;&#x5230; <code>[]</code> &#x7684;&#x5F00;&#x5934;&#x3002;&#x6240;&#x4EE5;&#x5806;&#x53E0;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x6210; <code>[2]</code>&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x7528; <code>[2]</code> &#x8DDF; <code>[&quot;3&quot;]</code> &#x6765;&#x5582;&#x7ED9; folding &#x51FD;&#x6570;&#xFF0C;&#x800C;&#x5F97;&#x5230; <code>[3,2]</code>&#x3002;&#x6700;&#x540E;&#x518D;&#x7528; <code>[3,2]</code> &#x8DDF; <code>&quot;+&quot;</code> &#x6765;&#x8C03;&#x7528; folding &#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4F1A;&#x5806;&#x53E0;&#x9876;&#x7AEF;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#xFF0C;&#x52A0;&#x8D77;&#x6765;&#x540E;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x3002;&#x6700;&#x540E;&#x5806;&#x53E0;&#x53D8;&#x6210; <code>[5]</code>&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x56DE;&#x4F20;&#x7684;&#x6570;&#x503C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x8BD5;&#x8BD5;&#x770B;&#x6211;&#x4EEC;&#x65B0;&#x5199;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 4 3 + 2 * -&quot;</span>  
<span class="hljs-number">-4</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;2 3 +&quot;</span>  
<span class="hljs-number">5</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - +&quot;</span>  
<span class="hljs-number">-3947</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - + -&quot;</span>  
<span class="hljs-number">4037</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - + -&quot;</span>  
<span class="hljs-number">4037</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 3 -&quot;</span>  
<span class="hljs-number">87</span>
</code></pre>
<p>&#x770B;&#x8D77;&#x6765;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x8272;&#x5C31;&#x662F;&#x4ED6;&#x5F88;&#x5BB9;&#x6613;&#x6539;&#x5199;&#x6765;&#x652F;&#x6301;&#x989D;&#x5916;&#x7684;&#x8FD0;&#x7B97;&#x5B50;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x662F;&#x4E8C;&#x5143;&#x8FD0;&#x7B97;&#x5B50;&#x3002;&#x4F8B;&#x5982;&#x8BF4;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#x53EB;&#x505A; <code>&quot;log&quot;</code>&#xFF0C;&#x4ED6;&#x4F1A;&#x4ECE;&#x5806;&#x53E0;&#x53D6;&#x51FA;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x7B97;&#x51FA;&#x4ED6;&#x7684; log &#x540E;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E09;&#x5143;&#x8FD0;&#x7B97;&#x5B50;&#x6765;&#x4ECE;&#x5806;&#x53E0;&#x53D6;&#x51FA;&#x4E09;&#x4E2A;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x628A;&#x7ED3;&#x679C;&#x653E;&#x56DE;&#x5806;&#x53E0;&#x3002;&#x751A;&#x81F3;&#x662F;&#x50CF;&#x662F; <code>&quot;sum&quot;</code> &#x8FD9;&#x6837;&#x7684;&#x8FD0;&#x7B97;&#x5B50;&#xFF0C;&#x53D6;&#x51FA;&#x6240;&#x6709;&#x6570;&#x503C;&#x5E76;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x548C;&#x63A8;&#x56DE;&#x5806;&#x53E0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x6539;&#x5199;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x8BA9;&#x4ED6;&#x591A;&#x652F;&#x6301;&#x51E0;&#x4E2A;&#x8FD0;&#x7B97;&#x5B50;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x6539;&#x5199;&#x5BA3;&#x544A;&#x8BA9;&#x4ED6;&#x56DE;&#x4F20; <code>Float</code> &#x578B;&#x522B;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: <span class="hljs-type">String</span> -&gt; <span class="hljs-type">Float</span>  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
<span class="hljs-title">where</span>   foldingFunction (x:y:ys) <span class="hljs-string">&quot;*&quot;</span> = (x * y):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;+&quot;</span> = (x + y):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;-&quot;</span> = (y - x):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;/&quot;</span> = (y / x):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;^&quot;</span> = (y ** x):ys  
        foldingFunction (x:xs) <span class="hljs-string">&quot;ln&quot;</span> = log x:xs  
        foldingFunction xs <span class="hljs-string">&quot;sum&quot;</span> = [sum xs]  
        foldingFunction xs numberString = read numberString:xs
</code></pre>
<p>&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF0C;&#x6CA1;&#x6709;&#x7591;&#x95EE;&#x5730; <code>/</code> &#x662F;&#x9664;&#x6CD5;&#x800C; <code>**</code> &#x662F;&#x53D6; exponential&#x3002;&#x81F3;&#x4E8E; log &#x8FD0;&#x7B97;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x6BD5;&#x7ADF; log &#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x800C; sum &#x8FD0;&#x7B97;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7684;&#x548C;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;2.7 ln&quot;</span>  
<span class="hljs-number">0.9932518</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 10 10 10 sum 4 /&quot;</span>  
<span class="hljs-number">10.0</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 10 10 10 10 sum 4 /&quot;</span>  
<span class="hljs-number">12.5</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 2 ^&quot;</span>  
<span class="hljs-number">100.0</span>
</code></pre>
<p>&#x7531;&#x4E8E; <code>read</code> &#x77E5;&#x9053;&#x5982;&#x4F55;&#x8F6C;&#x6362;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x5728;&#x8FD0;&#x7B97;&#x9002;&#x4E2D;&#x4F7F;&#x7528;&#x4ED6;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;43.2425 0.5 ^&quot;</span>  
<span class="hljs-number">6.575903</span>
</code></pre>
<p>&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x62D3;&#x5C55;&#x5230;&#x6D6E;&#x70B9;&#x6570;&#x800C;&#x4E14;&#x52A8;&#x5230;&#x7684;&#x4EE3;&#x7801;&#x53C8;&#x5728;&#x5341;&#x884C;&#x4EE5;&#x5185;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x60F3;&#x662F;&#x975E;&#x5E38;&#x68D2;&#x7684;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4EF6;&#x4E8B;&#x8981;&#x7559;&#x610F;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x5E76;&#x4E0D;&#x597D;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x78B0;&#x5230;&#x975E;&#x6CD5;&#x8F93;&#x5165;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x76F4;&#x63A5;&#x5F53;&#x6389;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x78B0;&#x5230; Monad &#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x5199;&#x4E00;&#x4E2A;&#x5BB9;&#x9519;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4ED6;&#x7684;&#x578B;&#x522B;&#x4F1A;&#x662F; <code>solveRPN :: String -&gt; Maybe Float</code>&#x3002;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x4E0D;&#x8FC7;&#x90A3;&#x4F1A;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F1A;&#x6709;&#x4E00;&#x5927;&#x5806;&#x68C0;&#x67E5; <code>Nothing</code> &#x7684;&#x52A8;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x6311;&#x6218;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C3D;&#x7BA1;&#x5C1D;&#x8BD5;&#x3002;&#xFF08;&#x63D0;&#x793A;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x7528; <code>reads</code> &#x6765;&#x770B;&#x770B;&#x4E00;&#x6B21; read &#x662F;&#x5426;&#x4F1A;&#x6210;&#x529F;&#xFF09;</p>
<h2 id="&#x8DEF;&#x5F84;&#x89C4;&#x5212;">&#x8DEF;&#x5F84;&#x89C4;&#x5212;</h2>
<p>&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x4F60;&#x7684;&#x98DE;&#x673A;&#x521A;&#x521A;&#x964D;&#x843D;&#x5728;&#x82F1;&#x683C;&#x5170;&#x7684;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x3002;&#x4F60;&#x63A5;&#x4E0B;&#x6765;&#x6709;&#x4E00;&#x4E2A;&#x4F1A;&#x8BAE;&#xFF0C;&#x4F60;&#x79DF;&#x4E86;&#x4E00;&#x53F0;&#x8F66;&#x5E0C;&#x671B;&#x5C3D;&#x901F;&#x4ECE;&#x673A;&#x573A;&#x524D;&#x5F80;&#x4F26;&#x6566;&#x5E02;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>&#x4ECE;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x5230;&#x4F26;&#x6566;&#x6709;&#x4E24;&#x6761;&#x4E3B;&#x8981;&#x9053;&#x8DEF;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E2D;&#x95F4;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x8DEF;&#x8FDE;&#x63A5;&#x5F7C;&#x6B64;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8D70;&#x5C0F;&#x8DEF;&#x7684;&#x8BDD;&#x90FD;&#x4F1A;&#x82B1;&#x6389;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x4F60;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8981;&#x9009;&#x4E00;&#x6761;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x5C3D;&#x5FEB;&#x524D;&#x5F80;&#x4F26;&#x6566;&#x3002;&#x4F60;&#x4ECE;&#x56FE;&#x7684;&#x6700;&#x5DE6;&#x8FB9;&#x51FA;&#x53D1;&#xFF0C;&#x4E2D;&#x95F4;&#x53EF;&#x80FD;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x6765;&#x524D;&#x5F80;&#x53F3;&#x8FB9;&#x3002;</p>
<p><img src="img/roads.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x56FE;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x4ECE;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x5230;&#x4F26;&#x6566;&#x5728;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x914D;&#x7F6E;&#x4E0B;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x662F;&#x5148;&#x9009;&#x4E3B;&#x8981;&#x9053;&#x8DEF; B&#xFF0C;&#x7ECF;&#x7531;&#x5C0F;&#x8DEF;&#x5230; A &#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x8D70;&#x4E00;&#x5C0F;&#x6BB5;&#xFF0C;&#x8F6C;&#x5230; B &#x4E4B;&#x540E;&#x7EE7;&#x7EED;&#x5F80;&#x524D;&#x8D70;&#x3002;&#x5982;&#x679C;&#x91C7;&#x53D6;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x82B1;&#x53BB; 75 &#x5206;&#x949F;&#x3002;&#x5982;&#x679C;&#x9009;&#x5176;&#x4ED6;&#x9053;&#x8DEF;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4F1A;&#x82B1;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5370;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-number">50</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">30</span>  
<span class="hljs-number">5</span>  
<span class="hljs-number">90</span>  
<span class="hljs-number">20</span>  
<span class="hljs-number">40</span>  
<span class="hljs-number">2</span>  
<span class="hljs-number">25</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">8</span>  
<span class="hljs-number">0</span>
</code></pre>
<p>&#x6211;&#x4EEC;&#x5728;&#x5FC3;&#x4E2D;&#x53EF;&#x4EE5;&#x628A;&#x8F93;&#x5165;&#x7684;&#x6570;&#x503C;&#x4E09;&#x4E2A;&#x4E09;&#x4E2A;&#x770B;&#x4F5C;&#x4E00;&#x7EC4;&#x3002;&#x6BCF;&#x4E00;&#x7EC4;&#x7531;&#x9053;&#x8DEF; A,&#x9053;&#x8DEF; B,&#x8FD8;&#x6709;&#x4EA4;&#x53C9;&#x7684;&#x5C0F;&#x8DEF;&#x7EC4;&#x6210;&#x3002;&#x800C;&#x8981;&#x80FD;&#x591F;&#x8FD9;&#x6837;&#x7EC4;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BA9;&#x6700;&#x540E;&#x6709;&#x4E00;&#x6761;&#x865A;&#x62DF;&#x7684;&#x4EA4;&#x53C9;&#x5C0F;&#x8DEF;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8D70; 0 &#x5206;&#x949F;&#x5C31;&#x53EF;&#x4EE5;&#x7A7F;&#x8D8A;&#x4ED6;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x4F1A;&#x5728;&#x610F;&#x5728;&#x4F26;&#x6566;&#x91CC;&#x9762;&#x5F00;&#x8F66;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5230;&#x8FBE;&#x4F26;&#x6566;&#x4E86;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x89E3; RPN &#x8BA1;&#x7B97;&#x673A;&#x7684;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x7528;&#x4E09;&#x6B65;&#x9AA4;&#x6765;&#x89E3;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#x5FD8;&#x6389; Haskell&#xFF0C;&#x60F3;&#x60F3;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x662F;&#x600E;&#x4E48;&#x4E00;&#x6B65;&#x6B65;&#x89E3;&#x9898;&#x7684;&#x3002;</li>
<li>&#x60F3;&#x60F3;&#x5982;&#x4F55;&#x5728; Haskell &#x4E2D;&#x8868;&#x8FBE;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>&#x5728; Haskell &#x4E2D;&#x8981;&#x5982;&#x4F55;&#x5BF9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x505A;&#x8FD0;&#x7B97;&#x6765;&#x4EA7;&#x751F;&#x51FA;&#x89E3;&#x7B54;&#x3002;</li>
</ul>
<p>&#x5728;&#x4ECB;&#x7ECD; RPN &#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x81EA;&#x5DF1;&#x7528;&#x4EBA;&#x8111;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5728;&#x5FC3;&#x4E2D;&#x7EF4;&#x6301;&#x4E00;&#x4E2A;&#x5806;&#x53E0;&#x7136;&#x540E;&#x4E00;&#x9879;&#x4E00;&#x9879;&#x5904;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x4E32;&#x6765;&#x8868;&#x8FBE;&#x6211;&#x4EEC;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7528; left fold &#x6765;&#x8D70;&#x8FC7;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x4E32; list&#xFF0C;&#x5E76;&#x7B97;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x7A76;&#x7ADF;&#x6211;&#x4EEC;&#x8981;&#x600E;&#x4E48;&#x7528;&#x624B;&#x7B97;&#x51FA;&#x4ECE;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x5230;&#x4F26;&#x6566;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x6574;&#x7AE0;&#x56FE;&#x7247;&#xFF0C;&#x731C;&#x6D4B;&#x54EA;&#x4E00;&#x6761;&#x662F;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x7136;&#x540E;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x6709;&#x731C;&#x5BF9;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4F5C;&#x6CD5;&#x5BF9;&#x4E8E;&#x5F88;&#x5C0F;&#x7684;&#x8F93;&#x5165;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x8DEF;&#x5F84;&#x8D85;&#x8FC7; 10000 &#x7EC4;&#x5462;&#xFF1F;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x8BF4;&#x53EF;&#x80FD;&#x662F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x90A3;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4F5C;&#x6CD5;&#x3002;&#x8FD9;&#x8FB9;&#x6709;&#x4E00;&#x5F20;&#x7B80;&#x5316;&#x8FC7;&#x540E;&#x7684;&#x56FE;&#x3002;</p>
<p><img src="img/roads_simple.png" alt=""></p>
<p>&#x4F60;&#x80FD;&#x60F3;&#x51FA;&#x6765;&#x5230;&#x9053;&#x8DEF; A &#x4E0A;&#x7B2C;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x5417;&#xFF1F;&#xFF08;&#x6807;&#x8BB0;&#x6210; A1 &#x7684;&#x70B9;&#xFF09;&#x8FD9;&#x592A;&#x5BB9;&#x6613;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x770B;&#x770B;&#x4ECE;&#x9053;&#x8DEF; A &#x51FA;&#x53D1;&#x6216;&#x662F;&#x4ECE;&#x9053;&#x8DEF; B &#x51FA;&#x53D1;&#x7A7F;&#x8D8A;&#x81F3;&#x9053;&#x8DEF; A &#x4E24;&#x79CD;&#x4F5C;&#x6CD5;&#x54EA;&#x79CD;&#x6BD4;&#x8F83;&#x77ED;&#x5C31;&#x597D;&#x3002;&#x5F88;&#x660E;&#x663E;&#x7684;&#xFF0C;&#x4ECE;&#x9053;&#x8DEF; B &#x51FA;&#x53D1;&#x7684;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x53EA;&#x8981;&#x82B1;&#x8D39; 40 &#x5206;&#x949F;&#xFF0C;&#x7136;&#x800C;&#x4ECE;&#x9053;&#x8DEF; A &#x5219;&#x8981;&#x82B1;&#x8D39; 50 &#x5206;&#x949F;&#x3002;&#x90A3;&#x5230;&#x4EA4;&#x53C9;&#x70B9; B1 &#x5462;&#xFF1F;&#x540C;&#x6837;&#x7684;&#x4F5C;&#x6CD5;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4ECE;&#x9053;&#x8DEF; B &#x51FA;&#x53D1;&#x53EA;&#x8981;&#x82B1;&#x8D39; 10 &#x5206;&#x949F;&#xFF0C;&#x8FDC;&#x6BD4;&#x4ECE;&#x9053;&#x8DEF; A &#x51FA;&#x53D1;&#x7136;&#x540E;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x8981;&#x82B1;&#x8D39;&#x5C11;&#xFF0C;&#x540E;&#x8005;&#x8981;&#x82B1;&#x8D39; 80 &#x5206;&#x949F;&#xFF01;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8981;&#x5230;&#x8FBE; A1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x662F;&#x7ECF;&#x7531; B &#x7136;&#x540E;&#x90B9;&#x5C0F;&#x8DEF;&#x5230;&#x8FBE;&#xFF0C;&#x5171;&#x82B1;&#x8D39; 40&#x3002;&#x800C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8981;&#x8FBE;&#x5230; B1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x5219;&#x662F;&#x76F4;&#x63A5;&#x8D70; B&#xFF0C;&#x82B1;&#x8D39; 10&#x3002;&#x8FD9;&#x6837;&#x7684;&#x77E5;&#x8BC6;&#x6709;&#x529E;&#x6CD5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5F97;&#x77E5;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x5417;&#xFF1F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5230;&#x8FBE; A2 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8981;&#x5230;&#x8FBE; A2&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8981;&#x4ECE; A1 &#x8D70;&#x5230; A2 &#x6216;&#x662F;&#x4ECE; B1 &#x8D70;&#x5C0F;&#x8DEF;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5230;&#x8FBE; A1 &#x8DDF; B1 &#x7684;&#x6210;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x60F3;&#x51FA;&#x5230;&#x8FBE; A2 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x5230;&#x8FBE; A1 &#x8981;&#x82B1;&#x8D39; 40&#xFF0C;&#x800C;&#x4ECE; A1 &#x5230; A2 &#x9700;&#x8981; 5&#x3002;&#x6240;&#x4EE5; <code>B, C, A</code> &#x603B;&#x5171;&#x8981; 45&#x3002;&#x800C;&#x8981;&#x5230;&#x8FBE; B1 &#x53EA;&#x8981; 10&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x989D;&#x5916;&#x82B1;&#x8D39; 110 &#x5206;&#x949F;&#x6765;&#x5230;&#x8FBE; B2 &#x7136;&#x540E;&#x8D70;&#x5C0F;&#x8DEF;&#x5230;&#x8FBE; A2&#x3002;&#x6240;&#x4EE5;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x5C31;&#x662F; <code>B, C, A</code>&#x3002;&#x540C;&#x6837;&#x5730;&#x5230;&#x8FBE; B2 &#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x8D70; A1 &#x7136;&#x540E;&#x8D70;&#x5C0F;&#x8DEF;&#x3002;</p>
<pre><code class="lang-text">&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x95EE;&#x5982;&#x679C;&#x5148;&#x5728; B1 &#x8DE8;&#x5230;&#x9053;&#x8DEF; A &#x7136;&#x540E;&#x8D70;&#x5230; A2 &#x7684;&#x60C5;&#x51B5;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8003;&#x8651;&#x8FC7;&#x4E86;&#x4ECE; B1 &#x5230; A1 &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x628A;&#x4ED6;&#x8003;&#x8651;&#x8FDB;&#x53BB;&#x3002;
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x81F3; A2 &#x8DDF; B2 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x76F4;&#x5230;&#x6700;&#x53F3;&#x8FB9;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5230;&#x8FBE;&#x4E86; A4 &#x8DDF; B4&#xFF0C;&#x90A3;&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x77ED;&#x7684;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x4E86;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x7EC4;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x4E0D;&#x65AD;&#x5730;&#x91CD;&#x590D;&#x4E4B;&#x524D;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x8FDB;&#x5728;&#x524D;&#x9762;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x800C;&#x5DF2;&#x3002;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x8003;&#x8651;&#x8FDB;&#x4E86;&#x524D;&#x9762;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#xFF0C;&#x53EA;&#x662F;&#x4ED6;&#x4EEC;&#x90FD;&#x662F; 0 &#x800C;&#x5DF2;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;&#x8981;&#x5F97;&#x5230;&#x4ECE;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x5230;&#x4F26;&#x6566;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x770B;&#x770B;&#x5230;&#x8FBE;&#x4E0B;&#x4E00;&#x4E2A;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;&#x5171;&#x6709;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x4E00;&#x662F;&#x76F4;&#x63A5;&#x4ECE;&#x9053;&#x8DEF; A &#x51FA;&#x53D1;&#x7136;&#x540E;&#x8D70;&#x5230;&#x4EA4;&#x53C9;&#x70B9;&#xFF0C;&#x8981;&#x4E0D;&#x7136;&#x5C31;&#x662F;&#x4ECE;&#x9053;&#x8DEF; B &#x51FA;&#x53D1;&#xFF0C;&#x8D70;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7136;&#x540E;&#x8D70;&#x5C0F;&#x8DEF;&#x3002;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x540E;&#x8BB0;&#x4F4F;&#x7ED3;&#x679C;&#x3002;&#x63A5;&#x7740;&#x518D;&#x7528;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#x8D70;&#x5230;&#x9053;&#x8DEF; B &#x4E0A;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#xFF0C;&#x5E76;&#x4E5F;&#x8BB0;&#x4F4F;&#x7ED3;&#x679C;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8981;&#x8D70;&#x5230;&#x518D;&#x4E0B;&#x4E00;&#x4E2A;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#xFF0C;&#x7A76;&#x7ADF;&#x662F;&#x4ECE;&#x8FD9;&#x4E2A;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x6216;&#x662F;&#x4ECE;&#x5BF9;&#x5E94;&#x7684;&#x9053;&#x8DEF; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x5F80;&#x524D;&#x8D70;&#x518D;&#x8D70;&#x5230;&#x5BF9;&#x9762;&#xFF0C;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x54EA;&#x79CD;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x8BB0;&#x4E0B;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x5BF9;&#x5BF9;&#x5E94;&#x7684;&#x9053;&#x8DEF; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x505A;&#x4E00;&#x6B21;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x505A;&#x5B8C;&#x5168;&#x90E8;&#x7EC4;&#x4E4B;&#x540E;&#x5C31;&#x5230;&#x8FBE;&#x6700;&#x53F3;&#x8FB9;&#x3002;&#x4E00;&#x65E6;&#x5230;&#x8FBE;&#x6700;&#x53F3;&#x8FB9;&#xFF0C;&#x6700;&#x4F73;&#x7684;&#x9009;&#x62E9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x4E86;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x5F53;&#x6211;&#x4EEC;&#x5230;&#x8FBE;&#x6700;&#x53F3;&#x8FB9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BB0;&#x4E0B;&#x4E86;&#x6700;&#x540E;&#x505C;&#x5728;&#x9053;&#x8DEF; A &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x8DDF;&#x6700;&#x540E;&#x505C;&#x5728;&#x9053;&#x8DEF; B &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x77ED;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x7528;&#x624B;&#x7B97;&#x51FA;&#x7B54;&#x6848;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x95F2;&#x5DE5;&#x592B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x62FF;&#x7EB8;&#x7B14;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x7EC4;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x7B97;&#x51FA;&#x4ED6;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5982;&#x4F55;&#x7528; Haskell &#x7684;&#x578B;&#x522B;&#x6765;&#x4EE3;&#x8868;&#x8FD9;&#x91CC;&#x7684;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x5462;&#xFF1F;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x628A;&#x8D77;&#x59CB;&#x70B9;&#x8DDF;&#x4EA4;&#x53C9;&#x70B9;&#x90FD;&#x5F53;&#x4F5C;&#x56FE;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x8FDE;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x50CF;&#x5176;&#x5B9E;&#x8D77;&#x70B9;&#x4E5F;&#x6709;&#x4E00;&#x6761;&#x957F;&#x5EA6;&#x4E3A; 1 &#x7684;&#x865A;&#x62DF;&#x9053;&#x8DEF;&#x8FDE;&#x63A5;&#x5F7C;&#x6B64;&#xFF0C;&#x90A3;&#x6BCF;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x6216;&#x662F;&#x8282;&#x70B9;&#x5C31;&#x90FD;&#x8FDE;&#x63A5;&#x5BF9;&#x9762;&#x7684;&#x8282;&#x70B9;&#x4E86;&#x3002;&#x540C;&#x65F6;&#x4ED6;&#x4EEC;&#x4E5F;&#x8FDE;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x3002;&#x552F;&#x4E00;&#x7684;&#x4F8B;&#x5916;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x8FDE;&#x63A5;&#x5230;&#x5BF9;&#x9762;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Node</span> = <span class="hljs-type">Node</span> <span class="hljs-type">Road</span> <span class="hljs-type">Road</span> | <span class="hljs-type">EndNode</span> <span class="hljs-type">Road</span>  </span>
<span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Road</span> = <span class="hljs-type">Road</span> <span class="hljs-type">Int</span> <span class="hljs-type">Node</span></span>
</code></pre>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x8981;&#x7801;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4ED6;&#x5305;&#x542B;&#x6709;&#x901A;&#x5F80;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x6709;&#x5F80;&#x5BF9;&#x9762;&#x9053;&#x8DEF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6216;&#x662F;&#x4E00;&#x4E2A;&#x7EC8;&#x7AEF;&#x70B9;&#xFF0C;&#x53EA;&#x5305;&#x542B;&#x5F80;&#x5BF9;&#x9762;&#x8282;&#x70B9;&#x7684;&#x9053;&#x8DEF;&#x4FE1;&#x606F;&#x3002;&#x4E00;&#x6761;&#x9053;&#x8DEF;&#x5305;&#x542B;&#x4ED6;&#x591A;&#x957F;&#xFF0C;&#x8FD8;&#x6709;&#x4ED6;&#x6307;&#x5411;&#x54EA;&#x91CC;&#x3002;&#x4F8B;&#x5982;&#x8BF4;&#xFF0C;&#x9053;&#x8DEF; A &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x4EFD;&#x5C31;&#x53EF;&#x5199;&#x6210; <code>Road 50 a1</code>&#x3002;&#x5176;&#x4E2D; <code>a1</code> &#x662F; <code>Node x y</code> &#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x800C; <code>x</code> &#x8DDF; <code>y</code> &#x5219;&#x5206;&#x522B;&#x6307;&#x5411; B1 &#x8DDF; A2&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7528; <code>Maybe</code> &#x6765;&#x4EE3;&#x8868;&#x5F80;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x8D70;&#x7684;&#x8DEF;&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x6709;&#x6307;&#x5230;&#x5BF9;&#x9762;&#x8282;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#x90E8;&#x4EFD;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x4E0D;&#x662F;&#x7EC8;&#x7AEF;&#x8282;&#x70B9;&#x7684;&#x8282;&#x70B9;&#x624D;&#x6709;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x8DEF;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Node</span> = <span class="hljs-type">Node</span> <span class="hljs-type">Road</span> (<span class="hljs-type">Maybe</span> <span class="hljs-type">Road</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Road</span> = <span class="hljs-type">Road</span> <span class="hljs-type">Int</span> <span class="hljs-type">Node</span></span>
</code></pre>
<p>&#x8FD9;&#x4E9B;&#x662F;&#x7528; Haskell &#x6765;&#x4EE3;&#x8868;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x9760;&#x4ED6;&#x4EEC;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x51FA;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x60F3;&#x4E4B;&#x524D;&#x624B;&#x7B97;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x68C0;&#x67E5;&#x90FD;&#x53EA;&#x6709;&#x68C0;&#x67E5;&#x4E09;&#x6761;&#x8DEF;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#x800C;&#x5DF2;&#x3002;&#x5728;&#x9053;&#x8DEF; A &#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x8DDF;&#x5728;&#x9053;&#x8DEF; B &#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x8FD8;&#x6709;&#x63A5;&#x89E6;&#x4E24;&#x4E2A;&#x90E8;&#x4EFD;&#x5E76;&#x5C06;&#x4ED6;&#x4EEC;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x90E8;&#x4EFD;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230; A1 &#x8DDF; B1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8003;&#x8651;&#x7B2C;&#x4E00;&#x7EC4;&#x7684;&#x4E09;&#x4E2A;&#x90E8;&#x4EFD;&#xFF0C;&#x4ED6;&#x4EEC;&#x5206;&#x522B;&#x82B1;&#x8D39; 50, 10 &#x8DDF; 30&#x3002;&#x6240;&#x4EE5;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7528;&#x56DB;&#x7EC4;&#x6765;&#x8868;&#x793A;&#xFF1A;<code>50, 10, 30</code>&#xFF0C;<code>5, 90, 20</code>&#xFF0C;<code>40, 2, 25</code> &#x8DDF; <code>10, 8, 0</code>&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6570;&#x636E;&#x578B;&#x522B;&#x8D8A;&#x7B80;&#x5355;&#x8D8A;&#x597D;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x5DF2;&#x7ECF;&#x662F;&#x6781;&#x9650;&#x4E86;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Section</span> = <span class="hljs-type">Section</span> { <span class="hljs-title">getA</span> :: <span class="hljs-type">Int</span>, <span class="hljs-title">getB</span> :: <span class="hljs-type">Int</span>, <span class="hljs-title">getC</span> :: <span class="hljs-type">Int</span> } <span class="hljs-keyword">deriving</span> (<span class="hljs-type">Show</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">type</span> <span class="hljs-type">RoadSystem</span> = [<span class="hljs-type">Section</span>]</span>
</code></pre>
<p>&#x8FD9;&#x6837;&#x5F88;&#x5B8C;&#x7F8E;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x4F5C;&#x4E5F;&#x6709;&#x5E2E;&#x52A9;&#x3002;<code>Section</code> &#x662F;&#x4E00;&#x4E2A; algebraic data type&#xFF0C;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x90E8;&#x4EFD;&#x7684;&#x9053;&#x8DEF;&#x957F;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x5B9A;&#x4E49;&#x4E86;&#x578B;&#x522B;&#x540C;&#x4E49;&#x5B57;&#xFF0C;&#x8BF4; <code>RoadSystem</code> &#x4EE3;&#x8868;&#x5305;&#x542B; section &#x7684; list&#x3002;</p>
<pre><code class="lang-text">&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A; tuple ``(Int, Int, Int)`` &#x6765;&#x4EE3;&#x8868;&#x4E00;&#x4E2A; section&#x3002;&#x4F7F;&#x7528; tuple &#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x7684; algebraic data type &#x4F1A;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x4ED6;&#x8BA9;&#x578B;&#x522B;&#x7CFB;&#x7EDF;&#x83B7;&#x5F97;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;``(Int, Int, Int)`` &#x6BD5;&#x7ADF;&#x4E5F;&#x53EF;&#x80FD;&#x88AB;&#x4F7F;&#x7528;&#x5728;&#x5B9A;&#x4E49;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x77E2;&#x91CF;&#xFF0C;&#x53EA;&#x7528; tuple &#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x628A;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x5F62;&#x6DF7;&#x6742;&#x8D77;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528; ``Section`` &#x8DDF; ``Vector`` &#x7684;&#x8BDD;&#x5C31;&#x4E0D;&#x4F1A;&#x4E0D;&#x5C0F;&#x5FC3;&#x641E;&#x6DF7;&#x4E86;&#x3002;
</code></pre>
<p>&#x4ECE;&#x5E0C;&#x601D;&#x7F57;&#x673A;&#x573A;&#x5230;&#x4F26;&#x6566;&#x7684;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#x4FBF;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x8868;&#x793A;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-title">heathrowToLondon</span> :: <span class="hljs-type">RoadSystem</span>  
<span class="hljs-title">heathrowToLondon</span> = [<span class="hljs-type">Section</span> <span class="hljs-number">50</span> <span class="hljs-number">10</span> <span class="hljs-number">30</span>, <span class="hljs-type">Section</span> <span class="hljs-number">5</span> <span class="hljs-number">90</span> <span class="hljs-number">20</span>, <span class="hljs-type">Section</span> <span class="hljs-number">40</span> <span class="hljs-number">2</span> <span class="hljs-number">25</span>, <span class="hljs-type">Section</span> <span class="hljs-number">10</span> <span class="hljs-number">8</span> <span class="hljs-number">0</span>]
</code></pre>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528; Haskell &#x5B9E;&#x4F5C;&#x6211;&#x4EEC;&#x5148;&#x524D;&#x7684;&#x89E3;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#x5BA3;&#x544A;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x51FD;&#x6570;&#x7684;&#x578B;&#x522B;&#x5462;&#xFF1F;&#x4ED6;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x4E00;&#x4E2A; list &#x6765;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86; <code>Label</code> &#x6765;&#x8868;&#x793A; <code>A</code>, <code>B</code> &#x6216; <code>C</code>&#x3002;&#x5E76;&#x4E14;&#x4E5F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x540C;&#x4E49;&#x8BCD; <code>Path</code>&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Label</span> = <span class="hljs-type">A</span> | <span class="hljs-type">B</span> | <span class="hljs-type">C</span> <span class="hljs-keyword">deriving</span> (<span class="hljs-type">Show</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">type</span> <span class="hljs-type">Path</span> = [(<span class="hljs-type">Label</span>, <span class="hljs-type">Int</span>)]</span>
</code></pre>
<p>&#x800C;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570; <code>optimalPath</code> &#x5E94;&#x8BE5;&#x8981;&#x6709; <code>optimalPath :: RoadSystem -&gt; Path</code> &#x8FD9;&#x6837;&#x7684;&#x578B;&#x522B;&#x3002;&#x5982;&#x679C;&#x88AB;&#x5582;&#x7ED9; <code>heathrowToLondon</code> &#x8FD9;&#x6837;&#x7684;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ED6;&#x5E94;&#x8BE5;&#x8981;&#x56DE;&#x4F20;&#x4E0B;&#x5217;&#x7684;&#x8DEF;&#x5F84;&#xFF1A;</p>
<pre><code class="lang-haskell">[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">A</span>,<span class="hljs-number">5</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">20</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">2</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">8</span>)]
</code></pre>
<p>&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x6765;&#x8D70;&#x4E00;&#x904D; list&#xFF0C;&#x5E76;&#x6CBF;&#x8DEF;&#x4E0A;&#x8BB0;&#x4E0B; A &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x4F1A; accumulate &#x6211;&#x4EEC;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x6709;&#x6CA1;&#x6709;&#x5F88;&#x719F;&#x6089;&#xFF1F;&#x6CA1;&#x9519;&#xFF01;&#x5C31;&#x662F; left fold&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x624B;&#x52A8;&#x505A;&#x89E3;&#x7B54;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x7684;&#x3002;&#x5C31;&#x662F;&#x68C0;&#x67E5;&#x73B0;&#x6709; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x4EE5;&#x53CA;&#x76EE;&#x524D;&#x7684; section&#xFF0C;&#x4EA7;&#x751F;&#x51FA;&#x65B0;&#x7684; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x662F; <code>[]</code> &#x8DDF; <code>[]</code>&#x3002;&#x6211;&#x4EEC;&#x770B;&#x8FC7; <code>Section 50 10 30</code> &#x540E;&#x5C31;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x5230; A1 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x4E3A; <code>[(B,10),(C,30)]</code>&#xFF0C;&#x800C;&#x5230; B1 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x662F; <code>[(B,10)]</code>&#x3002;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x5BF9;&#x8DEF;&#x5F84;&#x8DDF;&#x4E00;&#x4E2A; section&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x51FA;&#x65B0;&#x7684;&#x4E00;&#x5BF9;&#x8DEF;&#x5F84;&#x3002;&#x6240;&#x4EE5;&#x578B;&#x522B;&#x662F; <code>(Path, Path) -&gt; Section -&gt; (Path, Path)</code>&#x3002;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x7EE7;&#x7EED;&#x5B9E;&#x4F5C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-text">&#x63D0;&#x793A;&#xFF1A;&#x628A; ``(Path, Path) -&gt; Section -&gt; (Path, Path)`` &#x5F53;&#x4F5C; left fold &#x7528;&#x7684;&#x4E8C;&#x5143;&#x51FD;&#x6570;&#xFF0C;fold &#x8981;&#x6C42;&#x7684;&#x578B;&#x6001;&#x662F; ``a -&gt; b -&gt; a``&#x3002;
</code></pre>
<pre><code class="lang-haskell"><span class="hljs-title">roadStep</span> :: (<span class="hljs-type">Path</span>, <span class="hljs-type">Path</span>) -&gt; <span class="hljs-type">Section</span> -&gt; (<span class="hljs-type">Path</span>, <span class="hljs-type">Path</span>)  
<span class="hljs-title">roadStep</span> (pathA, pathB) (<span class="hljs-type">Section</span> a b c) =   
    <span class="hljs-keyword">let</span> priceA = sum $ map snd pathA  
        priceB = sum $ map snd pathB  
        forwardPriceToA = priceA + a  
        crossPriceToA = priceB + b + c  
        forwardPriceToB = priceB + b  
        crossPriceToB = priceA + a + c  
        newPathToA = <span class="hljs-keyword">if</span> forwardPriceToA &lt;= crossPriceToA  
                        <span class="hljs-keyword">then</span> (<span class="hljs-type">A</span>,a):pathA  
                        <span class="hljs-keyword">else</span> (<span class="hljs-type">C</span>,c):(<span class="hljs-type">B</span>,b):pathB  
        newPathToB = <span class="hljs-keyword">if</span> forwardPriceToB &lt;= crossPriceToB  
                        <span class="hljs-keyword">then</span> (<span class="hljs-type">B</span>,b):pathB  
                        <span class="hljs-keyword">else</span> (<span class="hljs-type">C</span>,c):(<span class="hljs-type">A</span>,a):pathA  
    <span class="hljs-keyword">in</span>  (newPathToA, newPathToB)
</code></pre>
<p><img src="img/guycar.png" alt=""></p>
<p>&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x7A76;&#x7ADF;&#x5199;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#xFF1F;&#x9996;&#x5148;&#x4ED6;&#x6839;&#x636E;&#x5148;&#x524D; A &#x7684;&#x6700;&#x4F73;&#x89E3;&#x8BA1;&#x7B97;&#x51FA;&#x9053;&#x8DEF; A &#x7684;&#x6700;&#x4F73;&#x89E3;&#xFF0C;&#x4E4B;&#x540E;&#x4E5F;&#x5982;&#x6CD5;&#x70AE;&#x5236;&#x8BA1;&#x7B97; B &#x7684;&#x6700;&#x4F73;&#x89E3;&#x3002;&#x4F7F;&#x7528; <code>sum $ map snd pathA</code>&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C; <code>pathA</code> &#x662F; <code>[(A,100),(C,20)]</code>&#x3002;<code>priceA</code> &#x5C31;&#x662F; <code>120</code>&#x3002;<code>forwardPriceToA</code> &#x5C31;&#x4F1A;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x4ED8;&#x7684;&#x6210;&#x672C;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x662F;&#x4ECE;&#x5148;&#x524D;&#x5728; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x524D;&#x5F80;&#x3002;&#x90A3;&#x4ED6;&#x5C31;&#x4F1A;&#x7B49;&#x4E8E;&#x6211;&#x4EEC;&#x81F3;&#x5148;&#x524D;&#x4EA4;&#x53C9;&#x70B9;&#x7684;&#x6700;&#x4F73;&#x89E3;&#x52A0;&#x4E0A;&#x76EE;&#x524D; section &#x4E2D; A &#x7684;&#x90E8;&#x4EFD;&#x3002;<code>crossPriceToA</code> &#x5219;&#x662F;&#x6211;&#x4EEC;&#x4ECE;&#x5148;&#x524D;&#x5728; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x524D;&#x5F80; A &#x6240;&#x8981;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x4EF7;&#x3002;&#x4ED6;&#x662F;&#x5148;&#x524D; B &#x7684;&#x6700;&#x4F73;&#x89E3;&#x52A0;&#x4E0A; section &#x4E2D; B &#x7684;&#x90E8;&#x4EFD;&#x52A0;&#x4E0A; C &#x7684;&#x957F;&#x3002;&#x540C;&#x6837;&#x5730;&#x65B9;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A; <code>forwardPriceToB</code> &#x8DDF; <code>crossPriceToB</code>&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x5230; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6765;&#x6784;&#x9020;&#x5230; A &#x8DDF; B &#x7684;&#x6574;&#x4F53;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x8D70;&#x5230; A &#x8017;&#x8D39;&#x8F83;&#x5C11;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A; <code>newPathToA</code> &#x8BBE;&#x7F6E;&#x6210; <code>(A,a):pathA</code>&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x628A; <code>Label</code> <code>A</code> &#x8DDF; section &#x7684;&#x957F;&#x5EA6; <code>a</code> &#x63A5;&#x5230;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x7684;&#x524D;&#x9762;&#x3002;&#x8981;&#x8BB0;&#x5F97; <code>A</code> &#x662F;&#x4E00;&#x4E2A; label&#xFF0C;&#x800C; <code>a</code> &#x7684;&#x578B;&#x522B;&#x662F; <code>Int</code>&#x3002;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x63A5;&#x5728;&#x524D;&#x9762;&#x800C;&#x4E0D;&#x662F; <code>pathA ++ [(A,a)]</code> &#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x63A5;&#x5728; list &#x7684;&#x524D;&#x9762;&#x6BD4;&#x8D77;&#x63A5;&#x5728;&#x540E;&#x7AEF;&#x8981;&#x6709;&#x6548;&#x7387;&#x591A;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x4EA7;&#x751F;&#x51FA;&#x6765;&#x7684; list &#x5C31;&#x4F1A;&#x76F8;&#x53CD;&#x3002;&#x4F46;&#x8981;&#x628A; list &#x518D;&#x53CD;&#x8FC7;&#x6765;&#x5E76;&#x4E0D;&#x96BE;&#x3002;&#x5982;&#x679C;&#x5148;&#x8D70;&#x5230; B &#x518D;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x8D70;&#x5230; A &#x6BD4;&#x8F83;&#x77ED;&#x7684;&#x8BDD;&#xFF0C;&#x90A3; <code>newPathToA</code> &#x5C31;&#x4F1A;&#x5305;&#x542B;&#x8FD9;&#x6837;&#x8D70;&#x7684;&#x8DEF;&#x7EBF;&#x3002;&#x540C;&#x6837;&#x7684;&#x9053;&#x7406;&#x4E5F;&#x53EF;&#x4EE5;&#x5957;&#x7528;&#x5728; <code>newPathToB</code> &#x4E0A;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x56DE;&#x4F20; <code>newPathToA</code> &#x8DDF; <code>newPathToB</code> &#x8FD9;&#x4E00;&#x5BF9;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x628A; <code>heathrowToLondon</code> &#x7684;&#x7B2C;&#x4E00;&#x4E2A; section &#x5582;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x3002;&#x7531;&#x4E8E;&#x4ED6;&#x662F;&#x7B2C;&#x4E00;&#x4E2A; section&#xFF0C;&#x6240;&#x4EE5;&#x5230; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x7A7A;&#x7684; list&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; roadStep ([], []) (head heathrowToLondon)  
([(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>)],[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>)])
</code></pre>
<p>&#x8981;&#x8BB0;&#x4F4F;&#x5305;&#x542B;&#x7684;&#x8DEF;&#x5F84;&#x662F;&#x53CD;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x8981;&#x4ECE;&#x53F3;&#x8FB9;&#x5F80;&#x5DE6;&#x8FB9;&#x8BFB;&#x3002;&#x6240;&#x4EE5;&#x5230; A &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x53EF;&#x4EE5;&#x89E3;&#x8BFB;&#x6210;&#x4ECE; B &#x51FA;&#x53D1;&#xFF0C;&#x7136;&#x540E;&#x7A7F;&#x8D8A;&#x5230;&#x9053;&#x8DEF; A&#x3002;&#x800C; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x5219;&#x662F;&#x76F4;&#x63A5;&#x4ECE; B &#x51FA;&#x53D1;&#x8D70;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x70B9;&#x3002;</p>
<pre><code class="lang-text">&#x4F18;&#x5316;&#x5C0F;&#x6280;&#x5DE7;&#xFF1A;&#x5F53;&#x6211;&#x4EEC;&#x5199; ``priceA = sum $ map snd pathA`` &#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x6BCF;&#x6B65;&#x7684;&#x6210;&#x672C;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5B9E;&#x4F5C; ``roadStep`` &#x6210; ``(Path, Path, Int, Int) -&gt; Section -&gt; (Path, Path, Int, Int)`` &#x7684;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x90A3;&#x4E48;&#x505A;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x6574;&#x6570;&#x578B;&#x522B;&#x4EE3;&#x8868; A &#x8DDF; B &#x4E0A;&#x7684;&#x6700;&#x5C0F;&#x6210;&#x672C;&#x3002;
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x5BF9;&#x8DEF;&#x5F84;&#x8DDF;&#x4E00;&#x4E2A; section&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A; left fold &#x6765;&#x505A;&#x3002;&#x6211;&#x4EEC;&#x7528; <code>([],[])</code> &#x8DDF;&#x7B2C;&#x4E00;&#x4E2A; section &#x6765;&#x5582;&#x7ED9; <code>roadStep</code> &#x5E76;&#x5F97;&#x5230;&#x4E00;&#x5BF9;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x3002;&#x7136;&#x540E;&#x4ED6;&#x53C8;&#x88AB;&#x5582;&#x7ED9;&#x8FD9;&#x4E2A;&#x65B0;&#x5F97;&#x5230;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x8DDF;&#x4E0B;&#x4E00;&#x4E2A; section&#x3002;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8D70;&#x8FC7;&#x5168;&#x90E8;&#x7684; section &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x5BF9;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x77ED;&#x7684;&#x90A3;&#x4E2A;&#x5C31;&#x662F;&#x89E3;&#x7B54;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x53EF;&#x4EE5;&#x5B9E;&#x4F5C; <code>optimalPath</code>&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">optimalPath</span> :: <span class="hljs-type">RoadSystem</span> -&gt; <span class="hljs-type">Path</span>  
<span class="hljs-title">optimalPath</span> roadSystem = 
    <span class="hljs-keyword">let</span> (bestAPath, bestBPath) = foldl roadStep ([],[]) roadSystem  
    <span class="hljs-keyword">in</span>  <span class="hljs-keyword">if</span> sum (map snd bestAPath) &lt;= sum (map snd bestBPath)  
                <span class="hljs-keyword">then</span> reverse bestAPath  
                <span class="hljs-keyword">else</span> reverse bestBPath
</code></pre>
<p>&#x6211;&#x4EEC;&#x5BF9; <code>roadSystem</code> &#x505A; left fold&#x3002;&#x800C;&#x7528;&#x7684;&#x8D77;&#x59CB; accumulator &#x662F;&#x4E00;&#x5BF9;&#x7A7A;&#x7684;&#x8DEF;&#x5F84;&#x3002;fold &#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x662F;&#x4E00;&#x5BF9;&#x8DEF;&#x5F84;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x628A;&#x8DEF;&#x5F84;&#x4ECE;&#x7ED3;&#x679C;&#x53D6;&#x51FA;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x54EA;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x6BD4;&#x8F83;&#x77ED;&#x4FBF;&#x56DE;&#x4F20;&#x4ED6;&#x3002;&#x800C;&#x4E14;&#x5728;&#x56DE;&#x4F20;&#x4E4B;&#x524D;&#x4E5F;&#x987A;&#x4FBF;&#x628A;&#x6574;&#x4E2A;&#x7ED3;&#x679C;&#x53CD;&#x8FC7;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5148;&#x524D;&#x63D0;&#x5230;&#x7684;&#x6211;&#x4EEC;&#x662F;&#x7528;&#x63A5;&#x5728;&#x524D;&#x5934;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6784;&#x9020;&#x7ED3;&#x679C;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x5427;&#xFF01;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; optimalPath heathrowToLondon  
[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">A</span>,<span class="hljs-number">5</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">20</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">2</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">8</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">0</span>)]
</code></pre>
<p>&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#xFF01;&#x4E0D;&#x8FC7;&#x8DDF;&#x6211;&#x4EEC;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x4ECD;&#x6709;&#x70B9;&#x5DEE;&#x5F02;&#xFF0C;&#x5728;&#x6700;&#x540E;&#x6709;&#x4E00;&#x6B65; <code>(C,0)</code>&#xFF0C;&#x90A3;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x4F26;&#x6566;&#x4E86;&#x4ECD;&#x7136;&#x8DE8;&#x8D8A;&#x5C0F;&#x8DEF;&#x3002;&#x4E0D;&#x8FC7;&#x7531;&#x4E8E;&#x4ED6;&#x7684;&#x6210;&#x672C;&#x662F; 0&#xFF0C;&#x6240;&#x4EE5;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x7B97;&#x505A;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x8DEF;&#x5F84;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x505A;&#x7684;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x9053;&#x8DEF;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x628A;&#x4ED6;&#x8F6C;&#x6210; <code>RoadSystem</code>&#xFF0C;&#x7136;&#x540E;&#x7528; <code>optimalPath</code> &#x6765;&#x628A;&#x4ED6;&#x8DD1;&#x4E00;&#x904D;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x4E32; list &#x5E76;&#x628A;&#x4ED6;&#x5207;&#x6210;&#x540C;&#x6837;&#x5927;&#x5C0F;&#x7684; group&#x3002;&#x6211;&#x4EEC;&#x547D;&#x540D;&#x4ED6;&#x4E3A; <code>groupOf</code>&#x3002;&#x5F53;&#x53C2;&#x6570;&#x662F; <code>[1..10]</code> &#x65F6;&#xFF0C;<code>groupOf 3</code> &#x5E94;&#x8BE5;&#x56DE;&#x4F20; <code>[[1,2,3],[4,5,6],[7,8,9],[10]]</code>&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">groupsOf</span> :: <span class="hljs-type">Int</span> -&gt; [a] -&gt; [[a]]  
<span class="hljs-title">groupsOf</span> <span class="hljs-number">0</span> _ = undefined  
<span class="hljs-title">groupsOf</span> _ [] = []  
<span class="hljs-title">groupsOf</span> n xs = take n xs : groupsOf n (drop n xs)
</code></pre>
<p>&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x3002;&#x5BF9;&#x4E8E; <code>xs</code> &#x7B49;&#x4E8E; <code>[1..10]</code> &#x4E14; <code>n</code> &#x7B49;&#x4E8E; <code>3</code>&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5199;&#x6210; <code>[1,2,3] : groupsOf 3 [4,5,6,7,8,9,10]</code>&#x3002;&#x5F53;&#x8FD9;&#x4E2A;&#x9012;&#x5F52;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x7684; list &#x5C31;&#x4E09;&#x4E2A;&#x4E09;&#x4E2A;&#x5206;&#x597D;&#x7EC4;&#x3002;&#x800C;&#x4E0B;&#x5217;&#x662F;&#x6211;&#x4EEC;&#x7684; <code>main</code> &#x51FD;&#x6570;&#xFF0C;&#x4ED6;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x6784;&#x9020; <code>RoadSystem</code> &#x5E76;&#x5370;&#x51FA;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">main</span> = <span class="hljs-keyword">do</span>  
    contents &lt;- getContents  
    <span class="hljs-keyword">let</span> threes = groupsOf <span class="hljs-number">3</span> (map read $ lines contents)  
        roadSystem = map (\[a,b,c] -&gt; <span class="hljs-type">Section</span> a b c) threes  
        path = optimalPath roadSystem  
        pathString = concat $ map (show . fst) path  
        pathPrice = sum $ map snd path  
    putStrLn $ <span class="hljs-string">&quot;The best path to take is: &quot;</span> ++ pathString  
    putStrLn $ <span class="hljs-string">&quot;The price is: &quot;</span> ++ show pathPrice
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8C03;&#x7528; <code>lines</code> &#x6765;&#x628A; <code>&quot;50\n10\n30\n...</code> &#x8F6C;&#x6362;&#x6210; <code>[&quot;50&quot;,&quot;10&quot;,&quot;30&quot;..</code>&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC; map <code>read</code> &#x6765;&#x628A;&#x8FD9;&#x4E9B;&#x8F6C;&#x6210;&#x5305;&#x542B;&#x6570;&#x503C;&#x7684; list&#x3002;&#x6211;&#x4EEC;&#x8C03;&#x7528; <code>groupsOf 3</code> &#x6765;&#x628A; list &#x7684; list&#xFF0C;&#x5176;&#x4E2D;&#x5B50; list &#x957F;&#x5EA6;&#x4E3A; 3&#x3002;&#x6211;&#x4EEC;&#x63A5;&#x7740;&#x5BF9;&#x8FD9;&#x4E2A; list &#x6765; map &#x4E00;&#x4E2A; lambda <code>(\[a,b,c] -&gt; Section a b c)</code>&#x3002;&#x6B63;&#x5982;&#x4F60;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A; lambda &#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A; 3 &#x7684; list &#x7136;&#x540E;&#x628A;&#x4ED6;&#x53D8;&#x6210; Section&#x3002;&#x6240;&#x4EE5; <code>roadSystem</code> &#x73B0;&#x5728;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6B63;&#x786E;&#x7684;&#x578B;&#x522B; <code>RoadSystem</code>&#x3002;&#x6211;&#x4EEC;&#x8C03;&#x7528; <code>optimalPath</code> &#x800C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#x8DDF;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x5370;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4E0B;&#x5217;&#x6587;&#x672C;&#x5B58;&#x6210;&#x6587;&#x4EF6;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-number">50</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">30</span>  
<span class="hljs-number">5</span>  
<span class="hljs-number">90</span>  
<span class="hljs-number">20</span>  
<span class="hljs-number">40</span>  
<span class="hljs-number">2</span>  
<span class="hljs-number">25</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">8</span>  
<span class="hljs-number">0</span>
</code></pre>
<p>&#x5B58;&#x6210;&#x4E00;&#x4E2A;&#x53EB; <code>paths.txt</code> &#x7684;&#x6587;&#x4EF6;&#x7136;&#x540E;&#x5582;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<pre><code class="lang-haskell">$ cat paths.txt | runhaskell heathrow.hs  
<span class="hljs-type">The</span> best path to take is: <span class="hljs-type">BCACBBC</span>  
<span class="hljs-type">The</span> price is: <span class="hljs-number">75</span>
</code></pre>
<p>&#x6267;&#x884C;&#x6210;&#x529F;&#xFF01;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4F60;&#x5BF9; <code>Data.Random</code> &#x7684;&#x4E86;&#x89E3;&#x6765;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x8DEF;&#x5F84;&#x914D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4EA7;&#x751F;&#x7684;&#x4E71;&#x6570;&#x6570;&#x636E;&#x5582;&#x7ED9;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x78B0;&#x5230;&#x5806;&#x53E0;&#x6EA2;&#x51FA;&#xFF0C;&#x8BD5;&#x8BD5;&#x770B;&#x7528; <code>foldl&apos;</code> &#x800C;&#x4E0D;&#x8981;&#x7528; <code>foldl</code>&#x3002;<code>foldl&apos;</code> &#x662F; strict &#x7684;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9-input-and-output.html" class="navigation navigation-prev " aria-label="Previous page: Input and Output">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11-functors-applicative-functors-and-monoids.html" class="navigation navigation-next " aria-label="Next page: Functors, Applicative Functors 与 Monoids">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Functionally Solving Problems","level":"1.11","depth":1,"next":{"title":"Functors, Applicative Functors 与 Monoids","level":"1.12","depth":1,"path":"11-functors-applicative-functors-and-monoids.md","ref":"11-functors-applicative-functors-and-monoids.md","articles":[]},"previous":{"title":"Input and Output","level":"1.10","depth":1,"path":"9-input-and-output.md","ref":"9-input-and-output.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-cn","gitbook":"*"},"file":{"path":"10-functionally-solving-problems.md","mtime":"2020-12-03T17:01:40.715Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-03T17:01:59.781Z"},"basePath":".","book":{"language":"zh-cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

