
<!DOCTYPE HTML>
<html lang="zh-cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Recursion · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="6-high-order-function.html" />
    
    
    <link rel="prev" href="4-syntax-in-function.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    HASKELL 趣学指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-ready-go.html">
            
                <a href="2-ready-go.html">
            
                    
                    Ready Go
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-type-and-typeclass.html">
            
                <a href="3-type-and-typeclass.html">
            
                    
                    Type And Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-syntax-in-function.html">
            
                <a href="4-syntax-in-function.html">
            
                    
                    Syntax in Function
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="5-recursion.html">
            
                <a href="5-recursion.html">
            
                    
                    Recursion
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-high-order-function.html">
            
                <a href="6-high-order-function.html">
            
                    
                    High Order Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-module.html">
            
                <a href="7-module.html">
            
                    
                    Module
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-build-our-own-type-and-typeclass.html">
            
                <a href="8-build-our-own-type-and-typeclass.html">
            
                    
                    Build Our Own Type and Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-input-and-output.html">
            
                <a href="9-input-and-output.html">
            
                    
                    Input and Output
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-functionally-solving-problems.html">
            
                <a href="10-functionally-solving-problems.html">
            
                    
                    Functionally Solving Problems
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-functors-applicative-functors-and-monoids.html">
            
                <a href="11-functors-applicative-functors-and-monoids.html">
            
                    
                    Functors, Applicative Functors 与 Monoids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-a-fistful-of-monads.html">
            
                <a href="12-a-fistful-of-monads.html">
            
                    
                    A Fistful of Monad
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-for-a-few-monads-more.html">
            
                <a href="13-for-a-few-monads-more.html">
            
                    
                    For a Few Monad More
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-zippers.html">
            
                <a href="14-zippers.html">
            
                    
                    Zippers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    Resource
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Recursion</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9012;&#x5F52;">&#x9012;&#x5F52;</h1>
<h2 id="&#x4F60;&#x597D;&#xFF0C;&#x9012;&#x5F52;&#xFF01;">&#x4F60;&#x597D;&#xFF0C;&#x9012;&#x5F52;&#xFF01;</h2>
<p><img src="img/recursion.png" alt=""></p>
<p>&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x7B80;&#x8981;&#x8C08;&#x4E86;&#x4E00;&#x4E0B;&#x9012;&#x5F52;&#x3002;&#x800C;&#x5728;&#x672C;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x5730;&#x4E86;&#x89E3;&#x5230;&#x5B83;&#x4E3A;&#x4F55;&#x5728; Haskell &#x4E2D;&#x662F;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF0C;&#x80FD;&#x591F;&#x4EE5;&#x9012;&#x5F52;&#x601D;&#x60F3;&#x5199;&#x51FA;&#x7B80;&#x6D01;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x9012;&#x5F52;&#xFF0C;&#x5C31;&#x8BFB;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x3002;&#x54C8;&#x54C8;&#xFF01;&#x5F00;&#x4E2A;&#x73A9;&#x7B11;&#x800C;&#x5DF2;&#xFF01;&#x9012;&#x5F52;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x4EE5;&#x8C03;&#x7528;&#x81EA;&#x8EAB;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x6570;&#x5B66;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x9012;&#x5F52;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x5982;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217; &#xFF08;fibonacci&#xFF09;&#x3002;&#x5B83;&#x5148;&#x662F;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x975E;&#x9012;&#x5F52;&#x7684;&#x6570;&#xFF1A;<code>F(0)=0,F(1)=1</code>&#xFF0C;&#x8868;&#x793A;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x6570;&#x4E3A; 0 &#x548C; 1&#x3002;&#x7136;&#x540E;&#x5C31;&#x662F;&#x5BF9;&#x5176;&#x4ED6;&#x81EA;&#x7136;&#x6570;&#xFF0C;&#x5176;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5C31;&#x662F;&#x5B83;&#x524D;&#x9762;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x548C;&#xFF0C;&#x5373; <code>F(N)=F(N-1)+F(N-2)</code>&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;<code>F(3)</code> &#x5C31;&#x662F; <code>F(2)+F(1)</code>&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x4FBF;&#x662F; <code>(F(1)+F(0))+F(1)</code>&#x3002;&#x5DF2;&#x7ECF;&#x4E0B;&#x63A2;&#x5230;&#x4E86;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x975E;&#x9012;&#x5F52;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x5730;&#x8BF4; <code>F(3)</code> &#x5C31;&#x662F; 2 &#x4E86;&#x3002;&#x5728;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x4E00;&#x4E24;&#x4E2A;&#x975E;&#x9012;&#x5F52;&#x7684;&#x503C;&#xFF08;&#x5982; <code>F(0)</code> &#x548C; <code>F(1)</code>&#xFF09; &#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4F5C;<em>&#x8FB9;&#x754C;&#x6761;&#x4EF6;</em>&#xFF0C;&#x8FD9;&#x5BF9;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x7684;&#x6B63;&#x786E;&#x6C42;&#x503C;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x8981;&#x662F;&#x524D;&#x9762;&#x6CA1;&#x6709;&#x5B9A;&#x4E49; <code>F(0)</code> &#x548C; <code>F(1)</code> &#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x4E0B;&#x63A2;&#x5230; 0 &#x4E4B;&#x540E;&#x5C31;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x5230;&#x8D1F;&#x6570;&#xFF0C;&#x4F60;&#x5C31;&#x6C38;&#x8FDC;&#x90FD;&#x5F97;&#x4E0D;&#x5230;&#x7ED3;&#x679C;&#x4E86;&#x3002;&#x4E00;&#x4E0D;&#x7559;&#x795E;&#x5B83;&#x5C31;&#x7B97;&#x5230;&#x4E86; <code>F(-2000)=F(-2001)+F(-2002)</code>&#xFF0C;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x90FD;&#x7B97;&#x4E0D;&#x5230;&#x5934;&#xFF01;</p>
<p>&#x9012;&#x5F52;&#x5728; Haskell &#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B;&#x6C42;&#x89E3;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;Haskell &#x5219;&#x503E;&#x5411;&#x4E8E;&#x8BA9;&#x4F60;&#x63D0;&#x4F9B;&#x95EE;&#x9898;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x8FD9;&#x4FBF;&#x662F; Haskell &#x6CA1;&#x6709; <code>while</code> &#x6216; <code>for</code> &#x5FAA;&#x73AF;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x9012;&#x5F52;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x5B9E;&#x4F5C;-maximum">&#x5B9E;&#x4F5C; Maximum</h2>
<p><code>maximum</code> &#x51FD;&#x6570;&#x53D6;&#x4E00;&#x7EC4;&#x53EF;&#x6392;&#x5E8F;&#x7684; List&#xFF08;&#x5C5E;&#x4E8E; Ord Typeclass&#xFF09; &#x505A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x56DE;&#x4F20;&#x5176;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x60F3;&#x60F3;&#xFF0C;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x98CE;&#x683C;&#x4E2D;&#x8FD9;&#x4E00;&#x51FD;&#x6570;&#x8BE5;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3002;&#x5F88;&#x53EF;&#x80FD;&#x4F60;&#x4F1A;&#x8BBE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x5F53;&#x524D;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x8BE5; List&#xFF0C;&#x82E5;&#x5B58;&#x5728;&#x6BD4;&#x8FD9;&#x4E2A;&#x503C;&#x66F4;&#x5927;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x4FEE;&#x6539;&#x53D8;&#x91CF;&#x4E3A;&#x8FD9;&#x4E00;&#x5143;&#x7D20;&#x7684;&#x503C;&#x3002;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5C31;&#x662F;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x3002;&#x5514;&#xFF01;&#x63CF;&#x8FF0;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x8FD8;&#x9887;&#x8D39;&#x4E86;&#x70B9;&#x53E3;&#x820C;&#x5462;&#xFF01;</p>
<p>&#x73B0;&#x5728;&#x770B;&#x770B;&#x9012;&#x5F52;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5982;&#x4F55;&#xFF1A;&#x6211;&#x4EEC;&#x5148;&#x5B9A;&#x4E0B;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#xFF0C;&#x5373;&#x5904;&#x7406;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x7684; List &#x65F6;&#xFF0C;&#x56DE;&#x4F20;&#x8BE5;&#x5143;&#x7D20;&#x3002;&#x5982;&#x679C;&#x8BE5; List &#x7684;&#x5934;&#x90E8;&#x5927;&#x4E8E;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5047;&#x5B9A;&#x8F83;&#x957F;&#x7684; List &#x7684;&#x6700;&#x5927;&#x503C;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5934;&#x90E8;&#x3002;&#x800C;&#x5C3E;&#x90E8;&#x82E5;&#x5B58;&#x5728;&#x6BD4;&#x5B83;&#x66F4;&#x5927;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF01;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5728; Haskell &#x4E2D;&#x5B9E;&#x73B0;&#x5B83;</p>
<pre><code class="lang-haskell"><span class="hljs-title">maximum&apos;</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; a  
<span class="hljs-title">maximum&apos;</span> [] = error <span class="hljs-string">&quot;maximum of empty list&quot;</span>  
<span class="hljs-title">maximum&apos;</span> [x] = x  
<span class="hljs-title">maximum&apos;</span> (x:xs)   
    | x &gt; maxTail = x  
    | otherwise = maxTail  
    <span class="hljs-keyword">where</span> maxTail = maximum&apos; xs
</code></pre>
<p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E0E;&#x9012;&#x5F52;&#x7B80;&#x76F4;&#x5C31;&#x662F;&#x5929;&#x9020;&#x5730;&#x8BBE;&#xFF01;&#x5927;&#x591A;&#x6570;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x6CA1;&#x6709;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x4E8E;&#x662F;&#x4F60;&#x5C31;&#x5F97;&#x9020;&#x4E00;&#x5806; if-else &#x6765;&#x6D4B;&#x8BD5;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x3002;&#x800C;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5C06;&#x5176;&#x8868;&#x793A;&#x51FA;&#x6765;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8BE5; List &#x4E3A;&#x7A7A;&#xFF0C;&#x5D29;&#x6E83;&#xFF01;&#x5C31;&#x8BE5;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x7A7A; List &#x7684;&#x6700;&#x5927;&#x503C;&#x80FD;&#x662F;&#x5565;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x6A21;&#x5F0F;&#x4E5F;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8FB9;&#x7F18;&#x6761;&#x4EF6;&#xFF0C;&#x5B83;&#x8BF4;&#xFF0C; &#x5982;&#x679C;&#x8FD9;&#x4E2A; List &#x4EC5;&#x5305;&#x542B;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5C31;&#x56DE;&#x4F20;&#x8BE5;&#x5143;&#x7D20;&#x7684;&#x503C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x662F;&#x7B2C;&#x4E09;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x6267;&#x884C;&#x52A8;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#x3002; &#x901A;&#x8FC7;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x4E00;&#x4E2A; List &#x7684;&#x5934;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#x3002;&#x8FD9;&#x5728;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x5904;&#x7406; List &#x65F6;&#x662F;&#x5341;&#x5206;&#x5E38;&#x89C1;&#x7684;&#x3002;&#x51FA;&#x4E8E;&#x4E60;&#x60EF;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E2A; <code>where</code> &#x8BED;&#x53E5;&#x6765;&#x8868;&#x793A; <code>maxTail</code> &#x4F5C;&#x4E3A;&#x8BE5; List &#x4E2D;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x68C0;&#x67E5;&#x5934;&#x90E8;&#x662F;&#x5426;&#x5927;&#x4E8E;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x82E5;&#x662F;&#xFF0C;&#x56DE;&#x4F20;&#x5934;&#x90E8;&#xFF1B;&#x82E5;&#x975E;&#xFF0C;&#x56DE;&#x4F20;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53D6;&#x4E2A; List <code>[2,5,1]</code> &#x505A;&#x4F8B;&#x5B50;&#x6765;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x5F53;&#x8C03;&#x7528; <code>maximum&apos;</code> &#x5904;&#x7406;&#x5B83;&#x65F6;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x6A21;&#x5F0F;&#x4E0D;&#x4F1A;&#x88AB;&#x5339;&#x914D;&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x4E2A;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E86;&#x5B83;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x4E3A; <code>2</code> &#x4E0E; <code>[5,1]</code>&#x3002; <code>where</code> &#x5B50;&#x53E5;&#x518D;&#x53D6; <code>[5,1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x4E8E;&#x662F;&#x518D;&#x6B21;&#x4E0E;&#x7B2C;&#x4E09;&#x4E2A;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x5E76;&#x5C06; <code>[5,1]</code> &#x5206;&#x5272;&#x4E3A; <code>5</code> &#x548C; <code>[1]</code>&#x3002;&#x7EE7;&#x7EED;&#xFF0C;<code>where</code> &#x5B50;&#x53E5;&#x53D6; <code>[1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x8FD9;&#x65F6;&#x7EC8;&#x4E8E;&#x5230;&#x4E86;&#x8FB9;&#x7F18;&#x6761;&#x4EF6;&#xFF01;&#x56DE;&#x4F20; <code>1</code>&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5C06; <code>5</code> &#x4E0E; <code>[1]</code> &#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x505A;&#x6BD4;&#x8F83;&#xFF0C;&#x6613;&#x5F97; <code>5</code>&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x5F97;&#x5230;&#x4E86; <code>[5,1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x518D;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5C06; <code>2</code> &#x4E0E; <code>[5,1]</code> &#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x53EF;&#x5F97; <code>5</code> &#x66F4;&#x5927;&#xFF0C;&#x6700;&#x7EC8;&#x5F97; <code>5</code>&#x3002;</p>
<p>&#x6539;&#x7528; <code>max</code> &#x51FD;&#x6570;&#x4F1A;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x8BB0;&#x5F97;&#xFF0C;<code>max</code> &#x51FD;&#x6570;&#x53D6;&#x4E24;&#x4E2A;&#x503C;&#x505A;&#x53C2;&#x6570;&#x5E76;&#x56DE;&#x4F20;&#x5176;&#x4E2D;&#x8F83;&#x5927;&#x7684;&#x503C;&#x3002;&#x5982;&#x4E0B;&#x4FBF;&#x662F;&#x7528; <code>max</code> &#x51FD;&#x6570;&#x91CD;&#x5199;&#x7684; <code>maximun&apos;</code></p>
<pre><code class="lang-haskell"><span class="hljs-title">maximum&apos;</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; a  
<span class="hljs-title">maximum&apos;</span> [] = error <span class="hljs-string">&quot;maximum of empty list&quot;</span>  
<span class="hljs-title">maximum&apos;</span> [x] = x  
<span class="hljs-title">maximum&apos;</span> (x:xs) = max x (maximum&apos; xs)
</code></pre>
<p>&#x592A;&#x6F02;&#x4EAE;&#x4E86;&#xFF01;&#x4E00;&#x4E2A; List &#x7684;&#x6700;&#x5927;&#x503C;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x9996;&#x4E2A;&#x5143;&#x7D20;&#x4E0E;&#x5B83;&#x5C3E;&#x90E8;&#x4E2D;&#x6700;&#x5927;&#x503C;&#x76F8;&#x6BD4;&#x8F83;&#x6240;&#x5F97;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x7B80;&#x660E;&#x627C;&#x8981;&#x3002;</p>
<p><img src="img/maxs.png" alt=""></p>
<h2 id="&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x9012;&#x5F52;&#x51FD;&#x6570;">&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x9012;&#x5F52;&#x51FD;&#x6570;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x9012;&#x5F52;&#x7684;&#x601D;&#x8DEF;,&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x6765;&#x5B9E;&#x73B0;&#x51E0;&#x4E2A;&#x51FD;&#x6570;. &#x5148;&#x5B9E;&#x73B0;&#x4E0B; <code>replicate</code> &#x51FD;&#x6570;, &#x5B83;&#x53D6;&#x4E00;&#x4E2A; <code>Int</code> &#x503C;&#x548C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x505A;&#x53C2;&#x6570;, &#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x91CD;&#x590D;&#x5143;&#x7D20;&#x7684; List, &#x5982; <code>replicate 3 5</code> &#x56DE;&#x4F20; <code>[5,5,5]</code>. &#x8003;&#x8651;&#x4E00;&#x4E0B;, &#x6211;&#x89C9;&#x5F97;&#x5B83;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x5E94;&#x8BE5;&#x662F;&#x8D1F;&#x6570;. &#x5982;&#x679C;&#x8981; <code>replicate</code> &#x91CD;&#x590D;&#x67D0;&#x5143;&#x7D20;&#x96F6;&#x6B21;, &#x90A3;&#x5C31;&#x662F;&#x7A7A; List. &#x8D1F;&#x6570;&#x4E5F;&#x662F;&#x540C;&#x6837;, &#x4E0D;&#x9760;&#x8C31;.</p>
<pre><code class="lang-haskell"><span class="hljs-title">replicate&apos;</span> :: (<span class="hljs-type">Num</span> i, <span class="hljs-type">Ord</span> i) =&gt; i -&gt; a -&gt; [a]  
<span class="hljs-title">replicate&apos;</span> n x  
    | n &lt;= <span class="hljs-number">0</span>    = []  
    | otherwise = x:replicate&apos; (n<span class="hljs-number">-1</span>) x
</code></pre>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86; guard &#x800C;&#x975E;&#x6A21;&#x5F0F;&#x5339;&#x914D;, &#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x505A;&#x7684;&#x662F;&#x5E03;&#x6797;&#x5224;&#x65AD;. &#x5982;&#x679C; <code>n</code> &#x5C0F;&#x4E8E; 0 &#x5C31;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x7A7A; List, &#x5426;&#x5219;, &#x56DE;&#x4F20;&#x4EE5; <code>x</code> &#x4F5C;&#x9996;&#x4E2A;&#x5143;&#x7D20;&#x5E76;&#x540E;&#x63A5;&#x91CD;&#x590D; <code>n-1</code> &#x6B21; <code>x</code> &#x7684; List. &#x6700;&#x540E;, <code>(n-1)</code> &#x7684;&#x90A3;&#x90E8;&#x5206;&#x5C31;&#x4F1A;&#x4EE4;&#x51FD;&#x6570;&#x62B5;&#x8FBE;&#x8FB9;&#x7F18;&#x6761;&#x4EF6;.</p>
<pre><code class="lang-text">*Note*: Num &#x4E0D;&#x662F; Ord &#x7684;&#x5B50;&#x96C6;, &#x8868;&#x793A;&#x6570;&#x5B57;&#x4E0D;&#x4E00;&#x5B9A;&#x5F97;&#x62D8;&#x6CE5;&#x4E8E;&#x6392;&#x5E8F;, &#x8FD9;&#x5C31;&#x662F;&#x5728;&#x505A;&#x52A0;&#x51CF;&#x6CD5;&#x6BD4;&#x8F83;&#x65F6;&#x8981;&#x5C06; Num &#x4E0E; Ord &#x578B;&#x522B;&#x7EA6;&#x675F;&#x533A;&#x522B;&#x5F00;&#x6765;&#x7684;&#x539F;&#x56E0;.
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5B9E;&#x73B0; <code>take</code> &#x51FD;&#x6570;, &#x5B83;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A; List &#x53D6;&#x51FA;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5143;&#x7D20;. &#x5982; <code>take 3 [5,4,3,2,1]</code>, &#x5F97; <code>[5,4,3]</code>. &#x82E5;&#x8981;&#x53D6;&#x96F6;&#x6216;&#x8D1F;&#x6570;&#x4E2A;&#x7684;&#x8BDD;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7A7A; List. &#x540C;&#x6837;, &#x82E5;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x7A7A; List&#x4E2D;&#x53D6;&#x503C;, &#x5B83;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7A7A; List. &#x6CE8;&#x610F;, &#x8FD9;&#x513F;&#x6709;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6761;&#x4EF6;, &#x5199;&#x51FA;&#x6765;:</p>
<pre><code class="lang-haskell"><span class="hljs-title">take&apos;</span> :: (<span class="hljs-type">Num</span> i, <span class="hljs-type">Ord</span> i) =&gt; i -&gt; [a] -&gt; [a]  
<span class="hljs-title">take&apos;</span> n _  
    | n &lt;= <span class="hljs-number">0</span>   = []  
<span class="hljs-title">take&apos;</span> _ []     = []  
<span class="hljs-title">take&apos;</span> n (x:xs) = x : take&apos; (n<span class="hljs-number">-1</span>) xs
</code></pre>
<p><img src="img/painter.png" alt=""></p>
<p>&#x9996;&#x4E2A;&#x6A21;&#x5F0F;&#x8FA8;&#x8BA4;&#x82E5;&#x4E3A; 0 &#x6216;&#x8D1F;&#x6570;, &#x56DE;&#x4F20;&#x7A7A; List. &#x540C;&#x65F6;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x7528;&#x4E86;&#x4E00;&#x4E2A; guard &#x5374;&#x6CA1;&#x6709;&#x6307;&#x5B9A; <code>otherwise</code> &#x90E8;&#x5206;, &#x8FD9;&#x5C31;&#x8868;&#x793A; <code>n</code> &#x82E5;&#x5927;&#x4E8E; 0, &#x4F1A;&#x8F6C;&#x5165;&#x4E0B;&#x4E00;&#x6A21;&#x5F0F;. &#x7B2C;&#x4E8C;&#x4E2A;&#x6A21;&#x5F0F;&#x6307;&#x660E;&#x4E86;&#x82E5;&#x8BD5;&#x56FE;&#x4ECE;&#x4E00;&#x4E2A;&#x7A7A; List &#x4E2D;&#x53D6;&#x503C;, &#x5219;&#x56DE;&#x4F20;&#x7A7A; List. &#x7B2C;&#x4E09;&#x4E2A;&#x6A21;&#x5F0F;&#x5C06; List &#x5206;&#x5272;&#x4E3A;&#x5934;&#x90E8;&#x548C;&#x5C3E;&#x90E8;, &#x7136;&#x540E;&#x8868;&#x660E;&#x4ECE;&#x4E00;&#x4E2A; List &#x4E2D;&#x53D6;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#x7B49;&#x540C;&#x4E8E;&#x4EE4; <code>x</code> &#x4F5C;&#x5934;&#x90E8;&#x540E;&#x63A5;&#x4ECE;&#x5C3E;&#x90E8;&#x53D6; <code>n-1</code> &#x4E2A;&#x5143;&#x7D20;&#x6240;&#x5F97;&#x7684; List. &#x5047;&#x5982;&#x6211;&#x4EEC;&#x8981;&#x4ECE; <code>[4,3,2,1]</code> &#x4E2D;&#x53D6; 3 &#x4E2A;&#x5143;&#x7D20;, &#x8BD5;&#x7740;&#x4ECE;&#x7EB8;&#x4E0A;&#x5199;&#x51FA;&#x5B83;&#x7684;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;</p>
<p><code>reverse</code> &#x51FD;&#x6570;&#x7B80;&#x5355;&#x5730;&#x53CD;&#x8F6C;&#x4E00;&#x4E2A; List, &#x52A8;&#x8111;&#x7B4B;&#x60F3;&#x4E00;&#x4E0B;&#x5B83;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;! &#x8BE5;&#x600E;&#x6837;&#x5462;? &#x60F3;&#x60F3;...&#x662F;&#x7A7A; List! &#x7A7A; List &#x7684;&#x53CD;&#x8F6C;&#x7ED3;&#x679C;&#x8FD8;&#x662F;&#x5B83;&#x81EA;&#x5DF1;. Okay, &#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x529E;? &#x597D;&#x7684;, &#x4F60;&#x731C;&#x7684;&#x51FA;&#x6765;. &#x82E5;&#x5C06;&#x4E00;&#x4E2A; List &#x5206;&#x5272;&#x4E3A;&#x5934;&#x90E8;&#x4E0E;&#x5C3E;&#x90E8;, &#x90A3;&#x5B83;&#x53CD;&#x8F6C;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x53CD;&#x8F6C;&#x540E;&#x7684;&#x5C3E;&#x90E8;&#x4E0E;&#x5934;&#x90E8;&#x76F8;&#x8FDE;&#x6240;&#x5F97;&#x7684; List.</p>
<pre><code class="lang-haskell"><span class="hljs-title">reverse&apos;</span> :: [a] -&gt; [a]  
<span class="hljs-title">reverse&apos;</span> [] = []  
<span class="hljs-title">reverse&apos;</span> (x:xs) = reverse&apos; xs ++ [x]
</code></pre>
<p>&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;!</p>
<p>Haskell &#x652F;&#x6301;&#x65E0;&#x9650; List&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x9012;&#x5F52;&#x5C31;&#x4E0D;&#x5FC5;&#x6DFB;&#x52A0;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5BF9;&#x67D0;&#x503C;&#x8BA1;&#x7B97;&#x4E2A;&#x6CA1;&#x5B8C;, &#x4E5F;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x65E0;&#x9650; List&#x3002;&#x800C;&#x65E0;&#x9650; List &#x7684;&#x597D;&#x5904;&#x5C31;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x5C06;&#x5B83;&#x65AD;&#x5F00;.</p>
<p><code>repeat</code> &#x51FD;&#x6570;&#x53D6;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4F5C;&#x53C2;&#x6570;, &#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x4EC5;&#x5305;&#x542B;&#x8BE5;&#x5143;&#x7D20;&#x7684;&#x65E0;&#x9650; List. &#x5B83;&#x7684;&#x9012;&#x5F52;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684;&#x5F88;, &#x770B;:</p>
<pre><code class="lang-haskell"><span class="hljs-title">repeat&apos;</span> :: a -&gt; [a]  
<span class="hljs-title">repeat&apos;</span> x = x:repeat&apos; x
</code></pre>
<p>&#x8C03;&#x7528; <code>repeat 3</code> &#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4EE5; 3 &#x4E3A;&#x5934;&#x90E8;&#x5E76;&#x65E0;&#x9650;&#x6570;&#x91CF;&#x7684; 3 &#x4E3A;&#x5C3E;&#x90E8;&#x7684; List, &#x53EF;&#x4EE5;&#x8BF4; <code>repeat 3</code> &#x8FD0;&#x884C;&#x8D77;&#x6765;&#x5C31;&#x662F; <code>3:repeat 3</code> , &#x7136;&#x540E; <code>3:3:3:3</code> &#x7B49;&#x7B49;. &#x82E5;&#x6267;&#x884C; <code>repeat 3</code>, &#x90A3;&#x5B83;&#x7684;&#x8FD0;&#x7B97;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x505C;&#x6B62;&#x3002;&#x800C; <code>take 5 (repeat 3)</code> &#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230; 5 &#x4E2A; 3, &#x4E0E; <code>replicate 5 3</code> &#x5DEE;&#x4E0D;&#x591A;.</p>
<p><code>zip</code> &#x53D6;&#x4E24;&#x4E2A; List &#x4F5C;&#x53C2;&#x6570;&#x5E76;&#x5C06;&#x5176;&#x6346;&#x5728;&#x4E00;&#x8D77;&#x3002;<code>zip [1,2,3] [2,3]</code> &#x56DE;&#x4F20; <code>[(1,2),(2,3)]</code>, &#x5B83;&#x4F1A;&#x628A;&#x8F83;&#x957F;&#x7684; List &#x4ECE;&#x4E2D;&#x95F4;&#x65AD;&#x5F00;, &#x4EE5;&#x5339;&#x914D;&#x8F83;&#x77ED;&#x7684; List. &#x7528; <code>zip</code> &#x5904;&#x7406;&#x4E00;&#x4E2A; List &#x4E0E;&#x7A7A; List &#x53C8;&#x4F1A;&#x600E;&#x6837;? &#x55EF;, &#x4F1A;&#x5F97;&#x4E00;&#x4E2A;&#x7A7A; List, &#x8FD9;&#x4FBF;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x9650;&#x5236;&#x6761;&#x4EF6;, &#x7531;&#x4E8E; <code>zip</code> &#x53D6;&#x4E24;&#x4E2A;&#x53C2;&#x6570;, &#x6240;&#x4EE5;&#x8981;&#x6709;&#x4E24;&#x4E2A;&#x8FB9;&#x7F18;&#x6761;&#x4EF6;</p>
<pre><code class="lang-haskell"><span class="hljs-title">zip&apos;</span> :: [a] -&gt; [b] -&gt; [(a,b)]  
<span class="hljs-title">zip&apos;</span> _ [] = []  
<span class="hljs-title">zip&apos;</span> [] _ = []  
<span class="hljs-title">zip&apos;</span> (x:xs) (y:ys) = (x,y):zip&apos; xs ys
</code></pre>
<p>&#x524D;&#x4E24;&#x4E2A;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x4E24;&#x4E2A; List &#x4E2D;&#x82E5;&#x5B58;&#x5728;&#x7A7A; List, &#x5219;&#x56DE;&#x4F20;&#x7A7A; List. &#x7B2C;&#x4E09;&#x4E2A;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x5C06;&#x4E24;&#x4E2A; List &#x6346;&#x7ED1;&#x7684;&#x884C;&#x4E3A;, &#x5373;&#x5C06;&#x5176;&#x5934;&#x90E8;&#x914D;&#x5BF9;&#x5E76;&#x540E;&#x8DDF;&#x6346;&#x7ED1;&#x7684;&#x5C3E;&#x90E8;. &#x7528; <code>zip</code> &#x5904;&#x7406; <code>[1,2,3]</code> &#x4E0E; <code>[&apos;a&apos;,&apos;b&apos;]</code> &#x7684;&#x8BDD;, &#x5C31;&#x4F1A;&#x5728; <code>[3]</code> &#x4E0E; <code>[]</code> &#x65F6;&#x89E6;&#x53CA;&#x8FB9;&#x754C;&#x6761;&#x4EF6;, &#x5F97;&#x5230; <code>(1,&apos;a&apos;):(2,&apos;b&apos;):[]</code> &#x7684;&#x7ED3;&#x679C;,&#x4E0E; <code>[(1,&apos;a&apos;),(2,&apos;b&apos;)]</code> &#x7B49;&#x4EF7;.</p>
<p>&#x518D;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x5E93;&#x51FD;&#x6570; -- <code>elem</code>! &#x5B83;&#x53D6;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E0E;&#x4E00;&#x4E2A; List &#x4F5C;&#x53C2;&#x6570;, &#x5E76;&#x68C0;&#x6D4B;&#x8BE5;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5305;&#x542B;&#x4E8E;&#x6B64; List. &#x800C;&#x8FB9;&#x7F18;&#x6761;&#x4EF6;&#x5C31;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x76F8;&#x540C;, &#x7A7A; List. &#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x7A7A; List &#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x5143;&#x7D20;, &#x4FBF;&#x4E0D;&#x5FC5;&#x518D;&#x505A;&#x4EFB;&#x4F55;&#x5224;&#x65AD;</p>
<pre><code class="lang-haskell"><span class="hljs-title">elem&apos;</span> :: (<span class="hljs-type">Eq</span> a) =&gt; a -&gt; [a] -&gt; <span class="hljs-type">Bool</span>  
<span class="hljs-title">elem&apos;</span> a [] = <span class="hljs-type">False</span>  
<span class="hljs-title">elem&apos;</span> a (x:xs)  
    | a == x    = <span class="hljs-type">True</span>  
    | otherwise = a `elem&apos;` xs
</code></pre>
<p>&#x8FD9;&#x5F88;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x3002;&#x82E5;&#x5934;&#x90E8;&#x4E0D;&#x662F;&#x8BE5;&#x5143;&#x7D20;, &#x5C31;&#x68C0;&#x6D4B;&#x5C3E;&#x90E8;, &#x82E5;&#x4E3A;&#x7A7A; List &#x5C31;&#x56DE;&#x4F20; <code>False</code>.</p>
<h2 id="&#x5FEB;&#x901F;&#x6392;&#x5E8F;">&quot;&#x5FEB;&#x901F;&quot;&#x6392;&#x5E8F;</h2>
<p><img src="img/quickman.png" alt=""></p>
<p>&#x5047;&#x5B9A;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x6392;&#x5E8F;&#x7684; List, &#x5176;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x578B;&#x522B;&#x4E3A; Ord Typeclass &#x7684;&#x6210;&#x5458;. &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x7ED9;&#x5B83;&#x6392;&#x5E8F;! &#x6709;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x7684;&#x9177;, &#x5C31;&#x662F;&#x5FEB;&#x901F;&#x6392;&#x5E8F; (quick sort), &#x777F;&#x667A;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;. &#x5C3D;&#x7BA1;&#x5B83;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#x4E5F;&#x4E0D;&#x8FC7; 10 &#x884C;, &#x4F46;&#x5728; Haskell &#x4E0B;&#x8FB9;&#x8981;&#x66F4;&#x77ED;, &#x66F4;&#x6F02;&#x4EAE;, &#x4FE8;&#x7136;&#x5DF2;&#x7ECF;&#x6210;&#x4E86; Haskell &#x7684;&#x62DB;&#x724C;&#x4E86;. &#x55EF;, &#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x4E5F;&#x5B9E;&#x73B0;&#x4E00;&#x4E0B;. &#x6216;&#x8BB8;&#x4F1A;&#x663E;&#x5F97;&#x5F88;&#x4FD7;&#x6C14;, &#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x7528;&#x5B83;&#x6765;&#x5C55;&#x793A; Haskell &#x7A76;&#x7ADF;&#x6709;&#x591A;&#x4F18;&#x96C5;!</p>
<p>&#x5B83;&#x7684;&#x578B;&#x522B;&#x58F0;&#x660E;&#x5E94;&#x4E3A; <code>quicksort :: (Ord a) =&gt; [a] -&gt; [a]</code>, &#x6CA1;&#x5565;&#x5947;&#x602A;&#x7684;. &#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x5462;? &#x5982;&#x6599;&#xFF0C;&#x7A7A; List&#x3002;&#x6392;&#x8FC7;&#x5E8F;&#x7684;&#x7A7A; List &#x8FD8;&#x662F;&#x7A7A; List&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x4FBF;&#x662F;&#x7B97;&#x6CD5;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;<em>&#x6392;&#x8FC7;&#x5E8F;&#x7684; List &#x5C31;&#x662F;&#x4EE4;&#x6240;&#x6709;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#x5934;&#x90E8;&#x7684;&#x5143;&#x7D20;&#x5728;&#x5148;(&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x6392;&#x8FC7;&#x4E86;&#x5E8F;), &#x540E;&#x8DDF;&#x5927;&#x4E8E;&#x5934;&#x90E8;&#x7684;&#x5143;&#x7D20;(&#x5B83;&#x4EEC;&#x540C;&#x6837;&#x5DF2;&#x7ECF;&#x62CD;&#x8FC7;&#x4E86;&#x5E8F;)</em>&#x3002; &#x6CE8;&#x610F;&#x5B9A;&#x4E49;&#x4E2D;&#x6709;&#x4E24;&#x6B21;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x5F97;&#x9012;&#x5F52;&#x4E24;&#x6B21;&#xFF01;&#x540C;&#x65F6;&#x4E5F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7B97;&#x6CD5;&#x5B9A;&#x4E49;&#x7684;&#x52A8;&#x8BCD;&#x4E3A;&quot;&#x662F;&quot;&#x4EC0;&#x4E48;&#x800C;&#x975E;&quot;&#x505A;&quot;&#x8FD9;&#x4E2A;, &quot;&#x505A;&quot;&#x90A3;&#x4E2A;, &#x518D;&quot;&#x505A;&quot;&#x90A3;&#x4E2A;...&#x8FD9;&#x4FBF;&#x662F;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E4B;&#x7F8E;&#xFF01;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x4ECE; List &#x4E2D;&#x53D6;&#x5F97;&#x6BD4;&#x5934;&#x90E8;&#x5C0F;&#x7684;&#x90A3;&#x4E9B;&#x5143;&#x7D20;&#x5462;&#xFF1F;List Comprehension&#x3002;&#x597D;&#xFF0C;&#x52A8;&#x624B;&#x5199;&#x51FA;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF01;</p>
<pre><code class="lang-haskell"><span class="hljs-title">quicksort</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; [a]  
<span class="hljs-title">quicksort</span> [] = []  
<span class="hljs-title">quicksort</span> (x:xs) =  
  <span class="hljs-keyword">let</span> smallerSorted = quicksort [a | a &lt;- xs, a &lt;= x] 
      biggerSorted = quicksort [a | a &lt;- xs, a &gt; x]  
  <span class="hljs-keyword">in</span> smallerSorted ++ [x] ++ biggerSorted
</code></pre>
<p>&#x5C0F;&#x5C0F;&#x7684;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;, &#x770B;&#x770B;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x6B63;&#x786E;~</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; quicksort [<span class="hljs-number">10</span>,<span class="hljs-number">2</span>,<span class="hljs-number">5</span>,<span class="hljs-number">3</span>,<span class="hljs-number">1</span>,<span class="hljs-number">6</span>,<span class="hljs-number">7</span>,<span class="hljs-number">4</span>,<span class="hljs-number">2</span>,<span class="hljs-number">3</span>,<span class="hljs-number">4</span>,<span class="hljs-number">8</span>,<span class="hljs-number">9</span>]  
[<span class="hljs-number">1</span>,<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-number">3</span>,<span class="hljs-number">3</span>,<span class="hljs-number">4</span>,<span class="hljs-number">4</span>,<span class="hljs-number">5</span>,<span class="hljs-number">6</span>,<span class="hljs-number">7</span>,<span class="hljs-number">8</span>,<span class="hljs-number">9</span>,<span class="hljs-number">10</span>]  
<span class="hljs-title">ghci</span>&gt; quicksort <span class="hljs-string">&quot;the quick brown fox jumps over the lazy dog&quot;</span>  
<span class="hljs-string">&quot; abcdeeefghhijklmnoooopqrrsttuuvwxyz&quot;</span>
</code></pre>
<p>booyah! &#x5982;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x4E00;&#x6837;! &#x82E5;&#x7ED9; <code>[5,1,9,4,6,7,3]</code> &#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x53D6;&#x51FA;&#x5B83;&#x7684;&#x5934;&#x90E8;&#xFF0C;&#x5373; 5&#x3002; &#x5C06;&#x5176;&#x7F6E;&#x4E8E;&#x5206;&#x522B;&#x6BD4;&#x5B83;&#x5927;&#x548C;&#x6BD4;&#x5B83;&#x5C0F;&#x7684;&#x4E24;&#x4E2A; List &#x4E2D;&#x95F4;&#xFF0C;&#x5F97; <code>[1,4,3] ++ [5] ++ [9,6,7]</code>, &#x6211;&#x4EEC;&#x4FBF;&#x77E5;&#x9053;&#x4E86;&#x5F53;&#x6392;&#x5E8F;&#x7ED3;&#x675F;&#x4E4B;&#x65F6;&#xFF0C;5&#x4F1A;&#x5728;&#x7B2C;&#x56DB;&#x4F4D;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;3&#x4E2A;&#x6570;&#x6BD4;&#x5B83;&#x5C0F;&#x6BCF;&#xFF0C;&#x4E5F;&#x6709;&#x4E09;&#x4E2A;&#x6570;&#x6BD4;&#x5B83;&#x5927;&#x3002;&#x597D;&#x7684;&#xFF0C;&#x63A5;&#x7740;&#x6392; <code>[1,4,3]</code> &#x4E0E; <code>[9,6,7]</code>, &#x7ED3;&#x679C;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#xFF01;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x6392;&#x5E8F;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x6210;&#x8BB8;&#x591A;&#x5C0F;&#x5757;&#xFF0C;&#x6700;&#x7EC8;&#x5230;&#x8FBE;&#x4E34;&#x754C;&#x6761;&#x4EF6;&#xFF0C;&#x5373;&#x7A7A; List &#x7ECF;&#x6392;&#x5E8F;&#x4F9D;&#x7136;&#x4E3A;&#x7A7A;&#xFF0C;&#x6709;&#x4E2A;&#x63D2;&#x56FE;&#xFF1A;</p>
<p>&#x6A59;&#x8272;&#x7684;&#x90E8;&#x5206;&#x8868;&#x793A;&#x5DF2;&#x5B9A;&#x4F4D;&#x5E76;&#x4E0D;&#x518D;&#x79FB;&#x52A8;&#x7684;&#x5143;&#x7D20;&#x3002;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x770B;&#xFF0C;&#x4FBF;&#x662F;&#x4E00;&#x4E2A;&#x6392;&#x8FC7;&#x5E8F;&#x7684; List&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C06;&#x6240;&#x6709;&#x5143;&#x7D20;&#x4E0E; <code>head</code> &#x4F5C;&#x6BD4;&#x8F83;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x800C;&#x8A00;&#xFF0C;&#x9009;&#x62E9;&#x4EFB;&#x610F;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x88AB;&#x9009;&#x62E9;&#x7684;&#x5143;&#x7D20;&#x5C31;&#x88AB;&#x79F0;&#x4F5C;&#x951A; &#xFF08;<code>pivot</code>&#xFF09;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x5C0F;&#x4E8E;&#x951A;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x5728;&#x6D45;&#x7EFF;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5927;&#x4E8E;&#x951A;&#x90FD;&#x5728;&#x6DF1;&#x7EFF;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E2A;&#x9EC4;&#x9EC4;&#x7684;&#x5761;&#x5C31;&#x8868;&#x793A;&#x4E86;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p><img src="img/quicksort.png" alt=""></p>
<h2 id="&#x7528;&#x9012;&#x5F52;&#x6765;&#x601D;&#x8003;">&#x7528;&#x9012;&#x5F52;&#x6765;&#x601D;&#x8003;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5199;&#x4E86;&#x4E0D;&#x5C11;&#x9012;&#x5F52;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x5DF2;&#x7ECF;&#x53D1;&#x89C9;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x56FA;&#x5B9A;&#x6A21;&#x5F0F;&#xFF1A;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#xFF0C;&#x518D;&#x5B9A;&#x4E49;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8BA9;&#x5B83;&#x4ECE;&#x4E00;&#x5806;&#x5143;&#x7D20;&#x4E2D;&#x53D6;&#x4E00;&#x4E2A;&#x5E76;&#x505A;&#x70B9;&#x4E8B;&#x60C5;&#x540E;&#xFF0C;&#x628A;&#x4F59;&#x4E0B;&#x7684;&#x5143;&#x7D20;&#x91CD;&#x65B0;&#x4EA4;&#x7ED9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002; &#x8FD9;&#x4E00;&#x6A21;&#x5F0F;&#x5BF9; List&#x3001;Tree &#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x9002;&#x7528;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>sum</code> &#x51FD;&#x6570;&#x5C31;&#x662F;&#x4E00;&#x4E2A; List &#x5934;&#x90E8;&#x4E0E;&#x5176;&#x5C3E;&#x90E8;&#x7684; <code>sum</code> &#x7684;&#x548C;&#x3002;&#x4E00;&#x4E2A; List &#x7684;&#x79EF;&#x4FBF;&#x662F;&#x8BE5; List &#x7684;&#x5934;&#x4E0E;&#x5176;&#x5C3E;&#x90E8;&#x7684;&#x79EF;&#x76F8;&#x4E58;&#x7684;&#x79EF;&#xFF0C;&#x4E00;&#x4E2A; List &#x7684;&#x957F;&#x5EA6;&#x5C31;&#x662F; 1 &#x4E0E;&#x5176;&#x5C3E;&#x90E8;&#x957F;&#x5EA6;&#x7684;&#x548C;. &#x7B49;&#x7B49;</p>
<p><img src="img/brain.png" alt=""></p>
<p>&#x518D;&#x8005;&#x5C31;&#x662F;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x5C31;&#x662F;&#x4E3A;&#x907F;&#x514D;&#x8FDB;&#x7A0B;&#x51FA;&#x9519;&#x800C;&#x8BBE;&#x7F6E;&#x7684;&#x4FDD;&#x62A4;&#x63AA;&#x65BD;&#xFF0C;&#x5904;&#x7406; List &#x65F6;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x7A7A; List&#xFF0C;&#x800C;&#x5904;&#x7406; Tree &#x65F6;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x5904;&#x7406;&#x6570;&#x5B57;&#x65F6;&#x4E5F;&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#x3002;&#x51FD;&#x6570;&#x4E00;&#x822C;&#x90FD;&#x5F97;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x503C;&#x5E76;&#x4FEE;&#x6539;&#x5B83;&#x3002;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x8FC7;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97; Factorial &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4FBF;&#x662F;&#x67D0;&#x6570;&#x4E0E;&#x5B83;&#x51CF;&#x4E00;&#x7684; Factorial &#x6570;&#x7684;&#x79EF;&#x3002;&#x8BA9;&#x5B83;&#x4E58;&#x4EE5;&#x96F6;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#xFF0C; Factorial &#x6570;&#x53C8;&#x90FD;&#x662F;&#x975E;&#x8D1F;&#x6570;&#xFF0C;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x4FBF;&#x53EF;&#x4EE5;&#x5B9A;&#x4E3A; 1&#xFF0C;&#x5373;&#x4E58;&#x6CD5;&#x7684;&#x5355;&#x6BD4;&#x7279;&#x3002; &#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x6570;&#x4E58;&#x4EE5; 1 &#x7684;&#x7ED3;&#x679C;&#x8FD8;&#x662F;&#x8FD9;&#x4E2A;&#x6570;&#x3002;&#x800C;&#x5728; <code>sum</code> &#x4E2D;&#xFF0C;&#x52A0;&#x6CD5;&#x7684;&#x5355;&#x6BD4;&#x7279;&#x5C31;&#x662F; 0&#x3002;&#x5728;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x548C;&#x5355;&#x6BD4;&#x7279;&#x90FD;&#x662F;&#x7A7A; List&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4E00; List &#x4E0E;&#x7A7A; List &#x76F8;&#x52A0;&#x7684;&#x7ED3;&#x679C;&#x4F9D;&#x7136;&#x662F;&#x539F; List&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x65F6;&#x5E94;&#x5F53;&#x5148;&#x8003;&#x8651;&#x9012;&#x5F52;&#x4F1A;&#x5728;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x4E0D;&#x53EF;&#x7528;, &#x7136;&#x540E;&#x518D;&#x627E;&#x51FA;&#x5B83;&#x7684;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x548C;&#x5355;&#x6BD4;&#x7279;, &#x8003;&#x8651;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x5728;&#x4F55;&#x65F6;&#x5207;&#x5F00;(&#x5982;&#x5BF9; List &#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;), &#x4EE5;&#x53CA;&#x5728;&#x4F55;&#x5904;&#x6267;&#x884C;&#x9012;&#x5F52;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4-syntax-in-function.html" class="navigation navigation-prev " aria-label="Previous page: Syntax in Function">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="6-high-order-function.html" class="navigation navigation-next " aria-label="Next page: High Order Function">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Recursion","level":"1.6","depth":1,"next":{"title":"High Order Function","level":"1.7","depth":1,"path":"6-high-order-function.md","ref":"6-high-order-function.md","articles":[]},"previous":{"title":"Syntax in Function","level":"1.5","depth":1,"path":"4-syntax-in-function.md","ref":"4-syntax-in-function.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-cn","gitbook":"*"},"file":{"path":"5-recursion.md","mtime":"2019-11-07T09:17:12.677Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-07T09:30:46.419Z"},"basePath":".","book":{"language":"zh-cn"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

