
<!DOCTYPE HTML>
<html lang="zh-tw" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-ready-go.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    HASKELL 趣學指南
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-ready-go.html">
            
                <a href="2-ready-go.html">
            
                    
                    Ready Go
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-type-and-typeclass.html">
            
                <a href="3-type-and-typeclass.html">
            
                    
                    Type And Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-syntax-in-function.html">
            
                <a href="4-syntax-in-function.html">
            
                    
                    Syntax in Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-recursion.html">
            
                <a href="5-recursion.html">
            
                    
                    Recursion
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-high-order-function.html">
            
                <a href="6-high-order-function.html">
            
                    
                    High Order Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-module.html">
            
                <a href="7-module.html">
            
                    
                    Module
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-build-our-own-type-and-typeclass.html">
            
                <a href="8-build-our-own-type-and-typeclass.html">
            
                    
                    Build Our Own Type and Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-input-and-output.html">
            
                <a href="9-input-and-output.html">
            
                    
                    Input and Output
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-functionally-solving-problems.html">
            
                <a href="10-functionally-solving-problems.html">
            
                    
                    Functionally Solving Problems
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-functors-applicative-functors-and-monoids.html">
            
                <a href="11-functors-applicative-functors-and-monoids.html">
            
                    
                    Functors, Applicative Functors 與 Monoids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-a-fistful-of-monads.html">
            
                <a href="12-a-fistful-of-monads.html">
            
                    
                    A Fistful of Monad
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-for-a-few-monads-more.html">
            
                <a href="13-for-a-few-monads-more.html">
            
                    
                    For a Few Monad More
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-zippers.html">
            
                <a href="14-zippers.html">
            
                    
                    Zippers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    Resource
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7C21;&#x4ECB;">&#x7C21;&#x4ECB;</h1>
<h2 id="&#x95DC;&#x65BC;&#x9019;&#x4EFD;&#x6559;&#x5B78;">&#x95DC;&#x65BC;&#x9019;&#x4EFD;&#x6559;&#x5B78;</h2>
<p>&#x6B61;&#x8FCE;&#x4F86;&#x5230; <em>Haskell &#x8DA3;&#x5B78;&#x6307;&#x5357;</em>&#xFF01;&#x6703;&#x60F3;&#x770B;&#x9019;&#x7BC7;&#x6587;&#x7AE0;&#x8868;&#x793A;&#x4F60;&#x5C0D;&#x5B78;&#x7FD2; Haskell &#x6709;&#x5F88;&#x5927;&#x7684;&#x8208;&#x8DA3;&#x3002;&#x4F60;&#x4F86;&#x5C0D;&#x5730;&#x65B9;&#x4E86;&#xFF0C;&#x4F86;&#x8B93;&#x6211;&#x7C21;&#x55AE;&#x4ECB;&#x7D39;&#x4E00;&#x4E0B;&#x9019;&#x500B;&#x6559;&#x5B78;&#x3002;</p>
<p>&#x64B0;&#x5BEB;&#x9019;&#x4EFD;&#x6559;&#x5B78;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x8B93;&#x6211;&#x81EA;&#x5DF1;&#x5C0D; Haskell &#x66F4;&#x719F;&#x7DF4;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x5920;&#x5206;&#x4EAB;&#x6211;&#x7684;&#x5B78;&#x7FD2;&#x7D93;&#x9A57;&#xFF0C;&#x5E6B;&#x52A9;&#x521D;&#x5B78;&#x8005;&#x66F4;&#x5FEB;&#x9032;&#x5165;&#x72C0;&#x6CC1;&#x3002;&#x7DB2;&#x8DEF;&#x4E0A;&#x5DF2;&#x7D93;&#x6709;&#x7121;&#x6578; Haskell &#x7684;&#x6559;&#x5B78;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x6211;&#x5B78;&#x7FD2;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4E26;&#x4E0D;&#x9650;&#x65BC;&#x53EA;&#x53C3;&#x8003;&#x4E00;&#x4EFD;&#x4F86;&#x6E90;&#x3002;&#x6211;&#x5E38;&#x5E38;&#x95B1;&#x8B80;&#x4E0D;&#x540C;&#x7684;&#x6559;&#x5B78;&#x6587;&#x7AE0;&#xFF0C;&#x4ED6;&#x5011;&#x6BCF;&#x500B;&#x90FD;&#x5F9E;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x767C;&#x3002;&#x53C3;&#x8003;&#x9019;&#x4E9B;&#x8CC7;&#x6E90;&#x8B93;&#x6211;&#x80FD;&#x5C07;&#x77E5;&#x8B58;&#x5316;&#x6574;&#x70BA;&#x96F6;&#x3002;&#x9019;&#x4EFD;&#x6559;&#x5B78;&#x662F;&#x5E0C;&#x671B;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x6A5F;&#x6703;&#x80FD;&#x8B93;&#x4F60;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x7684;&#x89E3;&#x7B54;&#x3002;</p>
<p><img src="img/bird.png" alt=""></p>
<p>&#x9019;&#x4EFD;&#x6559;&#x5B78;&#x4E3B;&#x8981;&#x91DD;&#x5C0D;&#x5DF2;&#x7D93;&#x6709;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x5F0F;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00; (imperative programming languages) &#x5BEB;&#x7A0B;&#x5F0F;&#x7D93;&#x9A57; (C, C++, Java, Python &#x2026;) &#x3001;&#x537B;&#x672A;&#x66FE;&#x63A5;&#x89F8;&#x904E;&#x51FD;&#x6578;&#x5F0F;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00; (functional programming languages) (Haskell, ML, OCaml &#x2026;) &#x7684;&#x8B80;&#x8005;&#x3002;&#x5C31;&#x7B97;&#x6C92;&#x6709;&#x5BEB;&#x7A0B;&#x5F0F;&#x7D93;&#x9A57;&#x4E5F;&#x6C92;&#x95DC;&#x4FC2;&#xFF0C;&#x6703;&#x60F3;&#x5B78; Haskell &#x7684;&#x4EBA;&#x6211;&#x76F8;&#x4FE1;&#x90FD;&#x662F;&#x5F88;&#x8070;&#x660E;&#x7684;&#x3002;</p>
<p>&#x82E5;&#x5728;&#x5B78;&#x7FD2;&#x4E2D;&#x9047;&#x5230;&#x4EC0;&#x9EBC;&#x5730;&#x65B9;&#x4E0D;&#x61C2;&#x7684;&#xFF0C;Freenode IRC &#x4E0A;&#x7684; #Haskell &#x983B;&#x9053;&#x662F;&#x63D0;&#x554F;&#x7684;&#x7D55;&#x4F73;&#x53BB;&#x8655;&#x3002;&#x90A3;&#x88E1;&#x7684;&#x4EBA;&#x90FD;&#x5F88;&#x53CB;&#x5584;&#xFF0C;&#x6709;&#x8010;&#x5FC3;&#x4E14;&#x80FD;&#x9AD4;&#x8AD2;&#x521D;&#x5B78;&#x8005;&#x3002; (&#x8B6F;&#x8A3B;&#xFF1A; Stackoverflow &#x4E0A;&#x7684; #haskell tag &#x4E5F;&#x6709;&#x5F88;&#x591A; Haskell &#x795E;&#x4EBA;&#x5011;&#x8010;&#x5FC3;&#x5730;&#x56DE;&#x7B54;&#x554F;&#x984C;&#xFF0C;&#x63D0;&#x4F9B;&#x7D66;&#x4E0D;&#x7FD2;&#x6163;&#x7528; IRC &#x7684;&#x4EBA;&#x7684;&#x53E6;&#x4E00;&#x500B;&#x9078;&#x64C7;&#x3002;)</p>
<p>&#x6211;&#x7D93;&#x6B77;&#x4E86;&#x4E0D;&#x5C11;&#x632B;&#x6298;&#x624D;&#x5B78;&#x6703; Haskell&#xFF0C;&#x5728;&#x521D;&#x5B78;&#x7684;&#x6642;&#x5019;&#x5B83;&#x770B;&#x8D77;&#x4F86;&#x662F;&#x5982;&#x6B64;&#x5947;&#x602A;&#x7684;&#x8A9E;&#x8A00;&#x3002;&#x4F46;&#x6709;&#x4E00;&#x5929;&#x6211;&#x7A81;&#x7136;&#x958B;&#x7AC5;&#x4E86;&#xFF0C;&#x4E4B;&#x5F8C;&#x7684;&#x5B78;&#x7FD2;&#x4FBF;&#x5982;&#x9B5A;&#x5F97;&#x6C34;&#x3002;&#x6211;&#x60F3;&#x8981;&#x8868;&#x9054;&#x7684;&#x662F;&#xFF1A;&#x5118;&#x7BA1; Haskell &#x4E4D;&#x770B;&#x4E0B;&#x5982;&#x6B64;&#x5730;&#x8A6D;&#x7570;&#xFF0C;&#x4F46;&#x5047;&#x5982;&#x4F60;&#x5C0D;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5341;&#x5206;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x4ED6;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x4F60;&#x5B78;&#x7FD2;&#x3002;&#x5B78;&#x7FD2; Haskell &#x8B93;&#x4F60;&#x60F3;&#x8D77;&#x4F60;&#x7B2C;&#x4E00;&#x6B21;&#x5BEB;&#x7A0B;&#x5F0F;&#x7684;&#x611F;&#x89BA;&#x3002;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#xFF0C;&#x800C;&#x4E14;&#x5F37;&#x8FEB;&#x4F60; Think different&#x3002;</p>
<h2 id="&#x4EC0;&#x9EBC;&#x662F;-haskell&#xFF1F;">&#x4EC0;&#x9EBC;&#x662F; Haskell&#xFF1F;</h2>
<p><img src="img/fx.png" alt=""></p>
<p>Haskell &#x8207;&#x5176;&#x4ED6;&#x8A9E;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x4E00;&#x9580;<em>&#x7D14;&#x7CB9;&#x51FD;&#x6578;&#x5F0F;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00; (purely functional programming language)</em>&#x3002;&#x5728;&#x4E00;&#x822C;&#x5E38;&#x898B;&#x7684;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#xFF0C;&#x8981;&#x57F7;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x8A71;&#x662F;&#x7D66;&#x96FB;&#x8166;&#x4E00;&#x7D44;&#x547D;&#x4EE4;&#xFF0C;&#x800C;&#x72C0;&#x614B;&#x6703;&#x96A8;&#x8457;&#x547D;&#x4EE4;&#x7684;&#x57F7;&#x884C;&#x800C;&#x6539;&#x8B8A;&#x3002;&#x4F8B;&#x5982;&#x4F60;&#x6307;&#x6D3E;&#x8B8A;&#x6578; <code>a</code> &#x7684;&#x503C;&#x70BA; 5&#xFF0C;&#x800C;&#x96A8;&#x5F8C;&#x505A;&#x4E86;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x4E4B;&#x5F8C; a &#x5C31;&#x53EF;&#x80FD;&#x8B8A;&#x6210;&#x7684;&#x5176;&#x5B83;&#x503C;&#x3002;&#x6709;&#x63A7;&#x5236;&#x6D41;&#x7A0B; (control flow)&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x91CD;&#x8907;&#x57F7;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x7136;&#x800C;&#x5728;&#x7D14;&#x7CB9;&#x51FD;&#x6578;&#x5F0F;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#xFF0C;&#x4F60;&#x4E0D;&#x662F;&#x50CF;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x90A3;&#x6A23;&#x547D;&#x4EE4;&#x96FB;&#x8166;&#x300C;&#x8981;&#x505A;&#x4EC0;&#x9EBC;&#x300D;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x904E;&#x7528;&#x51FD;&#x6578;&#x4F86;&#x63CF;&#x8FF0;&#x51FA;&#x554F;&#x984C;&#x300C;&#x662F;&#x4EC0;&#x9EBC;&#x300D;&#xFF0C;&#x5982;&#x300C;<em>&#x968E;&#x4E58;&#x662F;&#x6307;&#x5F9E;1&#x5230;&#x67D0;&#x500B;&#x6578;&#x7684;&#x4E58;&#x7A4D;&#x300D;&#xFF0C;&#x300C;&#x4E00;&#x500B;&#x4E32;&#x5217;&#x4E2D;&#x6578;&#x5B57;&#x7684;&#x548C;&#x300D;&#x662F;&#x6307;&#x628A;&#x7B2C;&#x4E00;&#x500B;&#x6578;&#x5B57;&#x8DDF;&#x5269;&#x9918;&#x6578;&#x5B57;&#x7684;&#x548C;&#x76F8;&#x52A0;&#x3002;&#x4F60;&#x7528;&#x5BA3;&#x544A;&#x51FD;&#x6578;&#x662F;&#x4EC0;&#x9EBC;&#x7684;&#x5F62;&#x5F0F;&#x4F86;&#x5BEB;&#x7A0B;&#x5F0F;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8B8A;&#x6578; (variable) &#x4E00;&#x65E6;&#x88AB;&#x6307;&#x5B9A;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x4E86;&#xFF0C;&#x4F60;&#x5DF2;&#x7D93;&#x8AAA;&#x4E86; <code>a</code> &#x5C31;&#x662F; 5&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x53E6;&#x8AAA; a &#x662F;&#x5225;&#x7684;&#x4EC0;&#x9EBC;&#x6578;&#x3002;&#xFF08;&#x8B6F;&#x8A3B;&#xFF1A;&#x5176;&#x5BE6;&#x7528; variable &#x4F86;&#x8868;&#x9054;&#x9020;&#x6210;&#x5B57;&#x7FA9;&#x7684; overloading&#xFF0C;&#x6703;&#x8B93;&#x4EBA;&#x806F;&#x60F3;&#x5230; imperative languages &#x4E2D; variable &#x662F;&#x4EE3;&#x8868;&#x72C0;&#x614B;&#xFF0C;&#x4F46;&#x5728; functional languages &#x4E2D; variable &#x662F;&#x76F8;&#x8FD1;&#x65BC;&#x6578;&#x5B78;&#x4E2D;&#x4F7F;&#x7528;&#x7684; variable&#x3002;<code>x=5</code> &#x4EE3;&#x8868; <code>x</code> &#x5C31;&#x662F; 5&#xFF0C;&#x4E0D;&#x662F;&#x8AAA; <code>x</code> &#x5728; 5 &#x9019;&#x500B;&#x72C0;&#x614B;&#x3002;) &#x6240;&#x4EE5;&#x8AAA;&#xFF0C;&#x5728;&#x7D14;&#x7CB9;&#x51FD;&#x6578;&#x5F0F;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6578;&#x80FD;&#x505A;&#x7684;&#x552F;&#x4E00;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x5229;&#x7528;&#x5F15;&#x6578;&#x8A08;&#x7B97;&#x7D50;&#x679C;&#xFF0C;&#x4E0D;&#x6703;&#x7522;&#x751F;&#x6240;&#x8B02;&#x7684;&quot;&#x526F;&#x4F5C;&#x7528; (side effect)&quot; (&#x8B6F;&#x8A3B;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x6539;&#x8B8A;&#x975E;&#x51FD;&#x6578;&#x5167;&#x90E8;&#x7684;&#x72C0;&#x614B;&#xFF0C;&#x50CF;&#x662F; imperative languages &#x88E1;&#x9762;&#x52D5;&#x5230; global variable &#x5C31;&#x662F; side effect)&#x3002;&#x4E00;&#x958B;&#x59CB;&#x6703;&#x89BA;&#x5F97;&#x9019;&#x9650;&#x5236;&#x5F88;&#x5927;&#xFF0C;&#x4E0D;&#x904E;&#x9019;&#x4E5F;&#x662F;&#x4ED6;&#x7684;&#x512A;&#x9EDE;&#x6240;&#x5728;&#xFF1A;&#x82E5;&#x4EE5;&#x540C;&#x6A23;&#x7684;&#x53C3;&#x6578;&#x547C;&#x53EB;&#x540C;&#x4E00;&#x500B;&#x51FD;&#x6578;&#x5169;&#x6B21;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7D50;&#x679C;&#x4E00;&#x5B9A;&#x662F;&#x76F8;&#x540C;&#x3002;&#x9019;&#x88AB;&#x7A31;&#x4F5C;&#x201C;</em>&#x5F15;&#x7528;&#x900F;&#x660E; (Referential Transparency)_&#x201D; (&#x8B6F;&#x8A3B;&#xFF1A;&#x9019;&#x5C31;&#x8DDF;&#x6578;&#x5B78;&#x4E0A;&#x51FD;&#x6578;&#x7684;&#x4F7F;&#x7528;&#x4E00;&#x6A23;)&#x3002;&#x5982;&#x6B64;&#x4E00;&#x4F86;&#x7DE8;&#x8B6F;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7A0B;&#x5F0F;&#x7684;&#x884C;&#x70BA;&#xFF0C;&#x4F60;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x80FD;&#x9A57;&#x8B49;&#x4E00;&#x500B;&#x51FD;&#x6578;&#x7684;&#x6B63;&#x78BA;&#x6027;&#xFF0C;&#x7E7C;&#x800C;&#x53EF;&#x4EE5;&#x5C07;&#x4E00;&#x4E9B;&#x7C21;&#x55AE;&#x7684;&#x51FD;&#x6578;&#x7D44;&#x5408;&#x6210;&#x66F4;&#x8907;&#x96DC;&#x7684;&#x51FD;&#x6578;&#x3002;</p>
<p><img src="img/lazy.png" alt=""></p>
<p>Haskell &#x662F;<em>&#x60F0;&#x6027; (lazy)</em> &#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8AAA;&#x82E5;&#x975E;&#x7279;&#x6B8A;&#x6307;&#x660E;&#xFF0C;&#x51FD;&#x6578;&#x5728;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7D50;&#x679C;&#x4EE5;&#x524D;&#x4E0D;&#x6703;&#x88AB;&#x6C42;&#x503C;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x5F15;&#x7528;&#x900F;&#x660E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x7A0B;&#x5F0F;&#x50C5;&#x770B;&#x4F5C;&#x662F;&#x6578;&#x64DA;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8B8A;&#x5F62;&#x3002;&#x5982;&#x6B64;&#x4E00;&#x4F86;&#x5C31;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x6709;&#x8DA3;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x7121;&#x9650;&#x9577;&#x5EA6;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x3002;&#x5047;&#x8A2D;&#x4F60;&#x6709;&#x4E00;&#x500B; List: <code>xs = [1,2,3,4,5,6,7,8]</code>&#xFF0C;&#x9084;&#x6709;&#x4E00;&#x500B;&#x51FD;&#x6578; <code>doubleMe</code>&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C07;&#x4E00;&#x500B; List &#x4E2D;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x90FD;&#x4E58;&#x4EE5;&#x4E8C;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x500B;&#x65B0;&#x7684; List&#x3002;&#x82E5;&#x662F;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#xFF0C;&#x628A;&#x4E00;&#x500B; List &#x4E58;&#x4EE5; 8&#xFF0C;&#x57F7;&#x884C; <code>doubleMe(doubleMe(doubleMe(xs)))</code>&#xFF0C;&#x5F97;&#x904D;&#x6B77;&#x4E09;&#x904D; <code>xs</code> &#x624D;&#x6703;&#x5F97;&#x5230;&#x7D50;&#x679C;&#x3002;&#x800C;&#x5728;&#x60F0;&#x6027;&#x8A9E;&#x8A00;&#x4E2D;&#xFF0C;&#x8ABF;&#x7528; <code>doubleMe</code> &#x6642;&#x4E26;&#x4E0D;&#x6703;&#x7ACB;&#x5373;&#x6C42;&#x503C;&#xFF0C;&#x5B83;&#x6703;&#x8AAA;&#x201C;&#x55EF;&#x55EF;&#xFF0C;&#x5F85;&#x6703;&#x5152;&#x518D;&#x505A;&#xFF01;&#x201D;&#x3002;&#x4E0D;&#x904E;&#x4E00;&#x65E6;&#x8981;&#x770B;&#x7D50;&#x679C;&#xFF0C;&#x7B2C;&#x4E00;&#x500B; <code>doubleMe</code> &#x5C31;&#x6703;&#x5C0D;&#x7B2C;&#x4E8C;&#x500B;&#x8AAA;&#x201C;&#x7D66;&#x6211;&#x7D50;&#x679C;&#xFF0C;&#x5FEB;&#xFF01;&#x201D;&#x7B2C;&#x4E8C;&#x500B; <code>doubleMe</code> &#x5C31;&#x6703;&#x628A;&#x540C;&#x6A23;&#x7684;&#x8A71;&#x50B3;&#x7D66;&#x7B2C;&#x4E09;&#x500B; <code>doubleMe</code>&#xFF0C;&#x7B2C;&#x4E09;&#x500B; <code>doubleMe</code> &#x53EA;&#x80FD;&#x5C07; 1 &#x4E58;&#x4EE5; 2 &#x5F97; 2 &#x5F8C;&#x4EA4;&#x7D66;&#x7B2C;&#x4E8C;&#x500B;&#xFF0C;&#x7B2C;&#x4E8C;&#x500B;&#x518D;&#x4E58;&#x4EE5; 2 &#x5F97; 4 &#x4EA4;&#x7D66;&#x7B2C;&#x4E00;&#x500B;&#xFF0C;&#x6700;&#x7D42;&#x5F97;&#x5230;&#x7B2C;&#x4E00;&#x500B;&#x5143;&#x7D20; 8&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8AAA;&#xFF0C;&#x9019;&#x4E00;&#x5207;&#x53EA;&#x9700;&#x8981;&#x904D;&#x6B77;&#x4E00;&#x6B21; list &#x5373;&#x53EF;&#xFF0C;&#x800C;&#x4E14;&#x50C5;&#x5728;&#x4F60;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7D50;&#x679C;&#x6642;&#x624D;&#x6703;&#x57F7;&#x884C;&#x3002;&#x60F0;&#x6027;&#x8A9E;&#x8A00;&#x4E2D;&#x7684;&#x8A08;&#x7B97;&#x53EA;&#x662F;&#x4E00;&#x7D44;&#x521D;&#x59CB;&#x6578;&#x64DA;&#x548C;&#x8B8A;&#x63DB;&#x516C;&#x5F0F;&#x3002;</p>
<p><img src="img/boat.png" alt=""></p>
<p>Haskell &#x662F;<em>&#x975C;&#x614B;&#x985E;&#x578B; (statically typed)</em> &#x7684;&#x3002;&#x7576;&#x4F60;&#x7DE8;&#x8B6F;&#x7A0B;&#x5F0F;&#x6642;&#xFF0C;&#x7DE8;&#x8B6F;&#x5668;&#x9700;&#x8981;&#x660E;&#x78BA;&#x54EA;&#x500B;&#x662F;&#x6578;&#x5B57;&#xFF0C;&#x54EA;&#x500B;&#x662F;&#x5B57;&#x4E32;&#x3002;&#x9019;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x932F;&#x8AA4;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x7DE8;&#x8B6F;&#x6642;&#x88AB;&#x767C;&#x73FE;&#xFF0C;&#x82E5;&#x8A66;&#x5716;&#x5C07;&#x4E00;&#x500B;&#x6578;&#x5B57;&#x548C;&#x5B57;&#x4E32;&#x76F8;&#x52A0;&#xFF0C;&#x7DE8;&#x8B6F;&#x5668;&#x5C31;&#x6703;&#x5831;&#x932F;&#x3002;Haskell &#x64C1;&#x6709;&#x4E00;&#x5957;&#x5F37;&#x5927;&#x7684;&#x985E;&#x578B;&#x7CFB;&#x7D71;&#xFF0C;&#x652F;&#x6301;&#x81EA;&#x52D5;&#x985E;&#x578B;&#x63A8;&#x5C0E; (type inference)&#x3002;&#x9019;&#x4E00;&#x4F86;&#x4F60;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x6BB5;&#x7A0B;&#x5F0F;&#x78BC;&#x4E0A;&#x90FD;&#x6A19;&#x660E;&#x5B83;&#x7684;&#x985E;&#x578B;&#xFF0C;&#x50CF;&#x8A08;&#x7B97; <code>a=5+4</code>&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x9700;&#x53E6;&#x544A;&#x8A34;&#x7DE8;&#x8B6F;&#x5668;&#x201C; a &#x662F;&#x4E00;&#x500B;&#x6578;&#x503C;&#x201D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x63A8;&#x5C0E;&#x51FA;&#x4F86;&#x3002;&#x985E;&#x578B;&#x63A8;&#x5C0E;&#x53EF;&#x4EE5;&#x8B93;&#x4F60;&#x7684;&#x7A0B;&#x5F0F;&#x66F4;&#x52A0;&#x7C21;&#x7DF4;&#x3002;&#x5047;&#x8A2D;&#x6709;&#x500B;&#x51FD;&#x6578;&#x662F;&#x5C07;&#x5169;&#x500B;&#x6578;&#x503C;&#x76F8;&#x52A0;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x8072;&#x660E;&#x5176;&#x985E;&#x578B;&#xFF0C;&#x9019;&#x500B;&#x51FD;&#x6578;&#x53EF;&#x4EE5;&#x5C0D;&#x4E00;&#x5207;&#x53EF;&#x4EE5;&#x76F8;&#x52A0;&#x7684;&#x503C;&#x9032;&#x884C;&#x8A08;&#x7B97;&#x3002;</p>
<p>Haskell &#x63A1;&#x7D0D;&#x4E86;&#x5F88;&#x591A;&#x9AD8;&#x968E;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56E0;&#x800C;&#x5B83;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;<em>&#x512A;&#x96C5;&#x4E14;&#x7C21;&#x7DF4;</em>&#x3002;&#x8207;&#x540C;&#x5C64;&#x6B21;&#x7684;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x76F8;&#x6BD4;&#xFF0C;Haskell &#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x5F80;&#x5F80;&#x6703;&#x66F4;&#x77ED;&#xFF0C;&#x66F4;&#x77ED;&#x5C31;&#x610F;&#x5473;&#x7740;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;bug &#x4E5F;&#x5C31;&#x66F4;&#x5C11;&#x3002;</p>
<p>Haskell &#x9019;&#x8A9E;&#x8A00;&#x662F;&#x4E00;&#x7FA4;&#x975E;&#x5E38;&#x8070;&#x660E;&#x7684;&#x4EBA;&#x8A2D;&#x8A08;&#x7684; (&#x4ED6;&#x5011;&#x6BCF;&#x500B;&#x4EBA;&#x90FD;&#x6709; PhD &#x5B78;&#x4F4D;)&#x3002;&#x6700;&#x521D;&#x7684;&#x5DE5;&#x4F5C;&#x59CB;&#x65BC; 1987 &#x5E74;&#xFF0C;&#x4E00;&#x7FA4;&#x5B78;&#x8005;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x60F3;&#x8A2D;&#x8A08;&#x4E00;&#x500B;&#x5C4C;&#x5230;&#x7206;&#x7684;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x3002;&#x5230;&#x4E86; 2003 &#x5E74;&#xFF0C;&#x4ED6;&#x5011;&#x516C;&#x958B;&#x4E86; Haskell Report&#xFF0C;&#x9019;&#x4EFD;&#x5831;&#x544A;&#x63CF;&#x8FF0;&#x4E86; Haskell &#x8A9E;&#x8A00;&#x7684;&#x4E00;&#x500B;&#x7A69;&#x5B9A;&#x7248;&#x672C;&#x3002;(&#x8B6F;&#x8A3B;&#xFF1A;&#x9019;&#x4EFD;&#x5831;&#x544A;&#x662F; Haskell 98 &#x6A19;&#x6E96;&#x7684;&#x4FEE;&#x8A02;&#x7248;&#xFF0C;Haskell 98 &#x662F;&#x5728; 1999 &#x5E74;&#x516C;&#x958B;&#x7684;&#xFF0C;&#x662F;&#x76EE;&#x524D; Haskell &#x5404;&#x500B;&#x7DE8;&#x8B6F;&#x5668;&#x5BE6;&#x73FE;&#x9810;&#x8A2D;&#x652F;&#x63F4;&#x7684;&#x6A19;&#x6E96;&#x3002;&#x5728; 2010 &#x5E74;&#x53C8;&#x516C;&#x958B;&#x4E86;&#x53E6;&#x4E00;&#x4EFD; Haskell 2010 &#x6A19;&#x6E96;&#xFF0C;&#x8A73;&#x60C5;&#x53EF;&#x898B;&#x7A46;&#x4FE1;&#x6210;&#x8001;&#x5E2B;&#x6240;&#x64B0;&#x5BEB;&#x7684;<a href="http://www.iis.sinica.edu.tw/~scm/ncs/2010/07/haskell-2010-report/" target="_blank">&#x7C21;&#x4ECB;</a>&#x3002;</p>
<h2 id="&#x8981;&#x4F7F;&#x7528;-haskell-&#x6709;&#x54EA;&#x4E9B;&#x8981;&#x6C42;&#x5462;&#xFF1F;">&#x8981;&#x4F7F;&#x7528; Haskell &#x6709;&#x54EA;&#x4E9B;&#x8981;&#x6C42;&#x5462;&#xFF1F;</h2>
<p>&#x4E00;&#x53E5;&#x8A71;&#x7248;&#x672C;&#x7684;&#x7B54;&#x6848;&#x662F;&#xFF1A;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x500B;&#x7DE8;&#x8F2F;&#x5668;&#x548C;&#x4E00;&#x500B;&#x7DE8;&#x8B6F;&#x5668;&#x3002;&#x5728;&#x9019;&#x88E1;&#x6211;&#x5011;&#x4E0D;&#x6703;&#x5C0D;&#x7DE8;&#x8F2F;&#x5668;&#x591A;&#x52A0;&#x8457;&#x58A8;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x4F60;&#x559C;&#x6B61;&#x7684;&#x7DE8;&#x8F2F;&#x5668;&#x3002;&#x81F3;&#x65BC;&#x7DE8;&#x8B6F;&#x5668;&#xFF0C;&#x5728;&#x9019;&#x4EFD;&#x6559;&#x5B78;&#x4E2D;&#x6211;&#x5011;&#x6703;&#x4F7F;&#x7528;&#x76EE;&#x524D;&#x6700;&#x6D41;&#x884C;&#x7684;&#x7248;&#x672C;&#xFF1A;GHC&#x3002;&#x800C;&#x5B89;&#x88DD; GHC &#x6700;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x53BB;&#x4E0B;&#x8F09; Haskell Platform&#xFF0C;&#x4ED6;&#x5305;&#x542B;&#x4E86;&#x8A31;&#x591A;&#x73FE;&#x6210; Runtime Library &#x8B93;&#x4F60;&#x65B9;&#x4FBF;&#x5BEB;&#x7A0B;&#x5F0F;&#x3002;(&#x8B6F;&#x8A3B;&#xFF1A;Ubuntu &#x7684;&#x4F7F;&#x7528;&#x8005;&#x6709;&#x73FE;&#x6210;&#x7684;&#x5957;&#x4EF6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5; <code>apt-get install Haskell-platform</code> &#x4F86;&#x5B89;&#x88DD;&#x3002;&#x4F46;&#x5957;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x6709;&#x53EF;&#x80FD;&#x6BD4;&#x8F03;&#x820A;&#x3002;)</p>
<p>GHC &#x53EF;&#x4EE5;&#x89E3;&#x91CB;&#x57F7;&#x884C; Haskell Script &#xFF08;&#x901A;&#x5E38;&#x662F;&#x4EE5; <code>.hs</code> &#x4F5C;&#x70BA;&#x7D50;&#x5C3E;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7DE8;&#x8B6F;&#x3002;&#x5B83;&#x9084;&#x6709;&#x500B;&#x4E92;&#x52D5;&#x6A21;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x88E1;&#x9762;&#x547C;&#x53EB; Script &#x88E1;&#x5B9A;&#x7FA9;&#x7684;&#x51FD;&#x6578;&#xFF0C;&#x5373;&#x6642;&#x5F97;&#x5230;&#x7D50;&#x679C;&#x3002; &#x5C0D;&#x65BC;&#x5B78;&#x7FD2;&#x800C;&#x8A00;&#xFF0C;&#x9019;&#x6BD4;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#x90FD;&#x7DE8;&#x8B6F;&#x57F7;&#x884C;&#x8981;&#x65B9;&#x4FBF;&#x7684;&#x591A;&#x3002;&#x60F3;&#x9032;&#x5165;&#x4E92;&#x52D5;&#x6A21;&#x5F0F;&#xFF0C;&#x53EA;&#x8981;&#x6253;&#x958B;&#x63A7;&#x5236;&#x53F0;&#x8F38;&#x5165; <code>ghci</code> &#x5373;&#x53EF;&#x3002;&#x5047;&#x8A2D;&#x4F60;&#x5728; <code>myfunctions.hs</code> &#x88E1;&#x5B9A;&#x7FA9;&#x4E86;&#x4E00;&#x4E9B;&#x51FD;&#x6578;&#xFF0C;&#x5728; ghci &#x4E2D;&#x8F38;&#x5165; <code>:l myfunctions.hs</code>&#xFF0C;ghci &#x4FBF;&#x6703;&#x8F09;&#x5165; <code>myfunctions.hs</code>&#x3002;&#x4E4B;&#x5F8C;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x547C;&#x53EB;&#x4F60;&#x5B9A;&#x7FA9;&#x7684;&#x51FD;&#x6578;&#x3002;&#x4E00;&#x65E6;&#x4FEE;&#x6539;&#x4E86;&#x9019;&#x500B; <code>.hs</code> &#x6A94;&#x6848;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x518D;&#x6B21;&#x57F7;&#x884C; <code>:l myfunctions.hs</code> &#x6216;&#x8005;&#x76F8;&#x540C;&#x4F5C;&#x7528;&#x7684; <code>:r</code> &#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x8F09;&#x5165;&#x8A72;&#x6A94;&#x6848;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x901A;&#x5E38;&#x5C31;&#x662F;&#x5728; <code>.hs</code> &#x6A94;&#x6848;&#x4E2D;&#x5B9A;&#x7FA9;&#x5E7E;&#x500B;&#x51FD;&#x6578;&#xFF0C;&#x518D;&#x5230; ghci &#x8F09;&#x5165;&#xFF0C;&#x547C;&#x53EB;&#x770B;&#x770B;&#xFF0C;&#x518D;&#x4FEE;&#x6539;&#x518D;&#x91CD;&#x65B0;&#x8F09;&#x5165;&#x3002;&#x9019;&#x4E5F;&#x6B63;&#x662F;&#x6211;&#x5011;&#x5F80;&#x5F8C;&#x7684;&#x57FA;&#x672C;&#x6D41;&#x7A0B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: HASKELL 趣學指南">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2-ready-go.html" class="navigation navigation-next " aria-label="Next page: Ready Go">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.2","depth":1,"next":{"title":"Ready Go","level":"1.3","depth":1,"path":"2-ready-go.md","ref":"2-ready-go.md","articles":[]},"previous":{"title":"HASKELL 趣學指南","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-tw","gitbook":"*"},"file":{"path":"1-introduction.md","mtime":"2019-11-07T09:17:12.692Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-07T09:30:46.419Z"},"basePath":".","book":{"language":"zh-tw"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

