
<!DOCTYPE HTML>
<html lang="zh-tw" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Functionally Solving Problems · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11-functors-applicative-functors-and-monoids.html" />
    
    
    <link rel="prev" href="9-input-and-output.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    HASKELL 趣學指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-ready-go.html">
            
                <a href="2-ready-go.html">
            
                    
                    Ready Go
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-type-and-typeclass.html">
            
                <a href="3-type-and-typeclass.html">
            
                    
                    Type And Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-syntax-in-function.html">
            
                <a href="4-syntax-in-function.html">
            
                    
                    Syntax in Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-recursion.html">
            
                <a href="5-recursion.html">
            
                    
                    Recursion
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-high-order-function.html">
            
                <a href="6-high-order-function.html">
            
                    
                    High Order Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-module.html">
            
                <a href="7-module.html">
            
                    
                    Module
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-build-our-own-type-and-typeclass.html">
            
                <a href="8-build-our-own-type-and-typeclass.html">
            
                    
                    Build Our Own Type and Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-input-and-output.html">
            
                <a href="9-input-and-output.html">
            
                    
                    Input and Output
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="10-functionally-solving-problems.html">
            
                <a href="10-functionally-solving-problems.html">
            
                    
                    Functionally Solving Problems
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-functors-applicative-functors-and-monoids.html">
            
                <a href="11-functors-applicative-functors-and-monoids.html">
            
                    
                    Functors, Applicative Functors 與 Monoids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-a-fistful-of-monads.html">
            
                <a href="12-a-fistful-of-monads.html">
            
                    
                    A Fistful of Monad
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-for-a-few-monads-more.html">
            
                <a href="13-for-a-few-monads-more.html">
            
                    
                    For a Few Monad More
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-zippers.html">
            
                <a href="14-zippers.html">
            
                    
                    Zippers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    Resource
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Functionally Solving Problems</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x51FD;&#x6578;&#x5F0F;&#x5730;&#x601D;&#x8003;&#x4F86;&#x89E3;&#x6C7A;&#x554F;&#x984C;">&#x51FD;&#x6578;&#x5F0F;&#x5730;&#x601D;&#x8003;&#x4F86;&#x89E3;&#x6C7A;&#x554F;&#x984C;</h1>
<p>&#x5728;&#x9019;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x6AA2;&#x8996;&#x5E7E;&#x500B;&#x6709;&#x8DA3;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4E26;&#x5617;&#x8A66;&#x7528;&#x51FD;&#x6578;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x6F02;&#x4EAE;&#x5730;&#x89E3;&#x6C7A;&#x4ED6;&#x5011;&#x3002;&#x6211;&#x5011;&#x4E26;&#x4E0D;&#x6703;&#x4ECB;&#x7D39;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x662F;&#x7DF4;&#x7FD2;&#x6211;&#x5011;&#x525B;&#x5B78;&#x5230;&#x7684;&#x5BEB;&#x7A0B;&#x5F0F;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x6BCF;&#x4E00;&#x7BC0;&#x90FD;&#x6703;&#x63A2;&#x8A0E;&#x4E0D;&#x540C;&#x7684;&#x554F;&#x984C;&#x3002;&#x6703;&#x5148;&#x63CF;&#x8FF0;&#x554F;&#x984C;&#xFF0C;&#x7136;&#x5F8C;&#x7528;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x6C7A;&#x4ED6;&#x3002;</p>
<h2 id="&#x904B;&#x7B97;&#x9006;&#x6CE2;&#x862D;&#x8868;&#x793A;&#x6CD5;reverse-polish-notation-form">&#x904B;&#x7B97;&#x9006;&#x6CE2;&#x862D;&#x8868;&#x793A;&#x6CD5;(Reverse Polish notation form)</h2>
<p>&#x6211;&#x5011;&#x5728;&#x5B78;&#x6821;&#x5B78;&#x7FD2;&#x6578;&#x5B78;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x5011;&#x591A;&#x534A;&#x90FD;&#x662F;&#x7528;&#x4E2D;&#x7F6E;(infix)&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x5BEB;&#x6578;&#x5B78;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#x8AAA;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x5BEB; <code>10 - (4 + 3) * 2</code>&#x3002;<code>+</code>, <code>*</code>, <code>-</code> &#x662F;&#x4E2D;&#x7F6E;&#x904B;&#x7B97;&#x5B50;(infix operators)&#x3002;&#x5728; Haskell &#x4E2D;&#x5C31;&#x50CF;&#x662F; <code>+</code> &#x6216; <code>elem</code> &#x4E00;&#x6A23;&#x3002;&#x9019;&#x7A2E;&#x5BEB;&#x6CD5;&#x5C0D;&#x65BC;&#x4EBA;&#x985E;&#x4F86;&#x8AAA;&#x5F88;&#x5BB9;&#x6613;&#x95B1;&#x8B80;&#x8207;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x7F3A;&#x9EDE;&#x662F;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x7528;&#x62EC;&#x865F;&#x4F86;&#x63CF;&#x8FF0;&#x904B;&#x7B97;&#x7684;&#x512A;&#x5148;&#x9806;&#x5E8F;&#x3002;</p>
<p>&#x9006;&#x6CE2;&#x862D;&#x8868;&#x793A;&#x6CD5;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x7A2E;&#x6578;&#x5B78;&#x5F0F;&#x7684;&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x3002;&#x4E4D;&#x770B;&#x4E4B;&#x4E0B;&#x986F;&#x5F97;&#x602A;&#x7570;&#xFF0C;&#x4F46;&#x4ED6;&#x5176;&#x5BE6;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4E26;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x4E0D;&#x9700;&#x8981;&#x62EC;&#x5F27;&#x4F86;&#x63CF;&#x8FF0;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x653E;&#x9032;&#x8A08;&#x7B97;&#x6A5F;&#x88E1;&#x9762;&#x904B;&#x7B97;&#x3002;&#x5118;&#x7BA1;&#x73FE;&#x5728;&#x7684;&#x8A08;&#x7B97;&#x6A5F;&#x90FD;&#x662F;&#x7528;&#x4E2D;&#x7F6E;&#x7684;&#x65B9;&#x5F0F;&#x8B93;&#x4F60;&#x8F38;&#x5165;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4ECD;&#x5805;&#x6301;&#x7528; RPN &#x7684;&#x8A08;&#x7B97;&#x6A5F;&#x3002;&#x524D;&#x8FF0;&#x7684;&#x7B97;&#x5F0F;&#x5982;&#x679C;&#x8868;&#x9054;&#x6210; RPN &#x7684;&#x8A71;&#x6703;&#x662F; <code>10 4 3 + 2 * -</code>&#x3002;&#x6211;&#x5011;&#x8981;&#x5982;&#x4F55;&#x8A08;&#x7B97;&#x4ED6;&#x7684;&#x7D50;&#x679C;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;&#x5806;&#x758A;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x662F;&#x5F9E;&#x5DE6;&#x5411;&#x53F3;&#x95B1;&#x8B80;&#x7B97;&#x5F0F;&#x3002;&#x6BCF;&#x7576;&#x78B0;&#x5230;&#x4E00;&#x500B;&#x6578;&#x503C;&#xFF0C;&#x5C31;&#x628A;&#x4ED6;&#x5806;&#x4E0A;&#x5806;&#x758A;&#x3002;&#x7576;&#x6211;&#x5011;&#x78B0;&#x5230;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50;&#x3002;&#x5C31;&#x628A;&#x5169;&#x500B;&#x6578;&#x503C;&#x5F9E;&#x5806;&#x758A;&#x4E0A;&#x62FF;&#x4E0B;&#x4F86;&#xFF0C;&#x7528;&#x904B;&#x7B97;&#x5B50;&#x904B;&#x7B97;&#x5169;&#x500B;&#x6578;&#x503C;&#x7136;&#x5F8C;&#x628A;&#x7D50;&#x679C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x4E2D;&#x3002;&#x7576;&#x4F60;&#x6D88;&#x8017;&#x5B8C;&#x6574;&#x500B;&#x7B97;&#x5F0F;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x800C;&#x4E14;&#x5047;&#x8A2D;&#x4F60;&#x7684;&#x7B97;&#x5F0F;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x61C9;&#x8A72;&#x53EA;&#x5269;&#x4E00;&#x500B;&#x6578;&#x503C;&#x5728;&#x5806;&#x758A;&#x4E2D;&#xFF0C;</p>
<p><img src="img/rpn.png" alt=""></p>
<p>&#x6211;&#x5011;&#x518D;&#x63A5;&#x8457;&#x770B; <code>10 4 3 + 2 * -</code>&#x3002;&#x9996;&#x5148;&#x6211;&#x5011;&#x628A; <code>10</code> &#x63A8;&#x5230;&#x5806;&#x758A;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x758A;&#x73FE;&#x5728;&#x662F; <code>10</code>&#x3002;&#x4E0B;&#x4E00;&#x500B;&#x63A5;&#x8457;&#x7684;&#x8F38;&#x5165;&#x662F; <code>4</code>&#xFF0C;&#x6211;&#x5011;&#x4E5F;&#x628A;&#x4ED6;&#x63A8;&#x4E0A;&#x5806;&#x758A;&#x3002;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x4FBF;&#x8B8A;&#x6210; <code>10, 4</code>&#x3002;&#x63A5;&#x8457;&#x4E5F;&#x5C0D;&#x4E0B;&#x4E00;&#x500B;&#x8F38;&#x5165; <code>3</code> &#x505A;&#x540C;&#x6A23;&#x7684;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x758A;&#x8B8A;&#x6210; <code>10, 4, 3</code>&#x3002;&#x7136;&#x5F8C;&#x4FBF;&#x78B0;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50; <code>+</code>&#x3002;&#x6211;&#x5011;&#x628A;&#x5806;&#x758A;&#x6700;&#x4E0A;&#x5C64;&#x7684;&#x5169;&#x500B;&#x6578;&#x503C;&#x53D6;&#x4E0B;&#x4F86;&#xFF08;&#x6240;&#x4EE5;&#x5806;&#x758A;&#x8B8A;&#x6210; <code>10</code>&#xFF09;&#x628A;&#x5169;&#x500B;&#x6578;&#x503C;&#x52A0;&#x8D77;&#x4F86;&#x7136;&#x5F8C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x4E0A;&#x3002;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x4FBF;&#x8B8A;&#x6210; <code>10, 7</code>&#x3002;&#x6211;&#x5011;&#x518D;&#x628A;&#x8F38;&#x5165; <code>2</code> &#x63A8;&#x4E0A;&#x5806;&#x758A;&#xFF0C;&#x5806;&#x758A;&#x8B8A;&#x6210; <code>10, 7, 2</code>&#x3002;&#x6211;&#x5011;&#x53C8;&#x78B0;&#x5230;&#x53E6;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x628A; <code>7</code> &#x8DDF; <code>2</code> &#x53D6;&#x4E0B;&#xFF0C;&#x628A;&#x4ED6;&#x5011;&#x76F8;&#x4E58;&#x8D77;&#x4F86;&#x7136;&#x5F8C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x4E0A;&#x3002;<code>7</code> &#x8DDF; <code>2</code> &#x76F8;&#x4E58;&#x7684;&#x7D50;&#x679C;&#x662F; <code>14</code>&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x662F; <code>10, 14</code>&#x3002;&#x6700;&#x5F8C;&#x6211;&#x5011;&#x78B0;&#x5230;&#x4E86; <code>-</code>&#x3002;&#x6211;&#x5011;&#x628A; <code>10</code> &#x8DDF; <code>14</code> &#x53D6;&#x4E0B;&#xFF0C;&#x5C07;&#x4ED6;&#x5011;&#x76F8;&#x6E1B;&#x7136;&#x5F8C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x4E0A;&#x3002;&#x6240;&#x4EE5;&#x73FE;&#x5728;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x8B8A;&#x6210; <code>-4</code>&#x3002;&#x800C;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x628A;&#x6240;&#x6709;&#x6578;&#x503C;&#x8DDF;&#x904B;&#x7B97;&#x5B50;&#x7684;&#x6D88;&#x8017;&#x5B8C;&#x4E86;&#xFF0C;&#x6240;&#x4EE5; <code>-4</code> &#x4FBF;&#x662F;&#x6211;&#x5011;&#x7684;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x77E5;&#x9053;&#x6211;&#x5011;&#x5982;&#x4F55;&#x624B;&#x7B97; RPN &#x904B;&#x7B97;&#x5F0F;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x4F86;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x6211;&#x5011;&#x5BEB;&#x4E00;&#x500B; Haskell &#x7684;&#x51FD;&#x6578;&#xFF0C;&#x7576;&#x4ED6;&#x63A5;&#x5230;&#x4E00;&#x500B; RPN &#x904B;&#x7B97;&#x5F0F;&#xFF0C;&#x50CF;&#x662F; <code>&quot;10 4 3 + 2 * -&quot;</code> &#x6642;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x7D66;&#x51FA;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x9019;&#x500B;&#x51FD;&#x6578;&#x7684;&#x578B;&#x5225;&#x6703;&#x662F;&#x4EC0;&#x9EBC;&#x6A23;&#x5462;&#xFF1F;&#x6211;&#x5011;&#x5E0C;&#x671B;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x5B57;&#x4E32;&#x7576;&#x4F5C;&#x53C3;&#x6578;&#xFF0C;&#x4E26;&#x7522;&#x51FA;&#x4E00;&#x500B;&#x6578;&#x503C;&#x4F5C;&#x70BA;&#x7D50;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x61C9;&#x8A72;&#x6703;&#x662F; <code>solveRPN :: (Num a) =&gt; String -&gt; a</code>&#x3002;</p>
<pre><code class="lang-text">&#x5C0F;&#x5EFA;&#x8B70;&#xFF1A;&#x5728;&#x4F60;&#x53BB;&#x5BE6;&#x4F5C;&#x51FD;&#x6578;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x60F3;&#x4E00;&#x4E0B;&#x4F60;&#x6703;&#x600E;&#x9EBC;&#x5BA3;&#x544A;&#x9019;&#x500B;&#x51FD;&#x6578;&#x7684;&#x578B;&#x5225;&#x80FD;&#x5920;&#x5E6B;&#x52A9;&#x4F60;&#x91D0;&#x6E05;&#x554F;&#x984C;&#x3002;&#x5728; Haskell &#x4E2D;&#x7531;&#x65BC;&#x6211;&#x5011;&#x6709;&#x5920;&#x5F37;&#x7684;&#x578B;&#x5225;&#x7CFB;&#x7D71;&#xFF0C;&#x5149;&#x5F9E;&#x51FD;&#x6578;&#x7684;&#x5BA3;&#x544A;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8A31;&#x591A;&#x8CC7;&#x8A0A;&#x3002;
</code></pre>
<p><img src="img/calculator.png" alt=""></p>
<p>&#x7576;&#x6211;&#x5011;&#x8981;&#x5BE6;&#x4F5C;&#x4E00;&#x500B;&#x554F;&#x984C;&#x7684;&#x89E3;&#x6CD5;&#x6642;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x52D5;&#x624B;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x89E3;&#x770B;&#x770B;&#xFF0C;&#x5617;&#x8A66;&#x5F9E;&#x88E1;&#x9762;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x9748;&#x611F;&#x3002;&#x6211;&#x5011;&#x9019;&#x908A;&#x628A;&#x6BCF;&#x4E00;&#x500B;&#x7528;&#x7A7A;&#x767D;&#x9694;&#x958B;&#x7684;&#x6578;&#x503C;&#x6216;&#x904B;&#x7B97;&#x5B50;&#x90FD;&#x7576;&#x4F5C;&#x7368;&#x7ACB;&#x7684;&#x4E00;&#x9805;&#x3002;&#x6240;&#x4EE5;&#x628A; <code>&quot;10 4 3 + 2 * -&quot;</code> &#x9019;&#x6A23;&#x4E00;&#x500B;&#x5B57;&#x4E32;&#x65B7;&#x6210;&#x4E00;&#x4E32; list <code>[&quot;10&quot;,&quot;4&quot;,&quot;3&quot;,&quot;+&quot;,&quot;2&quot;,&quot;*&quot;,&quot;-&quot;]</code> &#x61C9;&#x8A72;&#x6703;&#x6709;&#x5E6B;&#x52A9;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x4F86;&#x6211;&#x5011;&#x8981;&#x5982;&#x4F55;&#x61C9;&#x7528;&#x9019;&#x500B;&#x65B7;&#x597D;&#x7684; list &#x5462;&#xFF1F;&#x6211;&#x5011;&#x5F9E;&#x5DE6;&#x81F3;&#x53F3;&#x4F86;&#x8D70;&#x4E00;&#x904D;&#xFF0C;&#x4E26;&#x4FDD;&#x5B58;&#x4E00;&#x500B;&#x5DE5;&#x4F5C;&#x7528;&#x7684;&#x5806;&#x758A;&#x3002;&#x9019;&#x6A23;&#x6709;&#x8B93;&#x4F60;&#x60F3;&#x5230;&#x4E9B;&#x4EC0;&#x9EBC;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x55CE;&#xFF1F;&#x6C92;&#x932F;&#xFF0C;&#x5728; <code>folds</code> &#x7684;&#x90A3;&#x4E00;&#x7AE0;&#x88E1;&#x9762;&#xFF0C;&#x6211;&#x5011;&#x63D0;&#x5230;&#x57FA;&#x672C;&#x4E0A;&#x7576;&#x4F60;&#x9700;&#x8981;&#x5F9E;&#x5DE6;&#x81F3;&#x53F3;&#x6216;&#x7531;&#x53F3;&#x81F3;&#x5DE6;&#x8D70;&#x904E;&#x4E00;&#x904D; list &#x7684;&#x6642;&#x5019;&#x4E26;&#x7522;&#x751F;&#x4E9B;&#x7D50;&#x679C;&#x7684;&#x6642;&#x5019;&#x3002;&#x6211;&#x5011;&#x90FD;&#x80FD;&#x7528; fold &#x4F86;&#x5BE6;&#x4F5C;&#x4ED6;&#x3002;</p>
<p>&#x5728;&#x9019;&#x500B; case &#x4E2D;&#x7531;&#x65BC;&#x6211;&#x5011;&#x662F;&#x5F9E;&#x5DE6;&#x908A;&#x8D70;&#x5230;&#x53F3;&#x908A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x63A1;&#x53D6; left fold&#x3002;accumulator &#x5247;&#x662F;&#x9078;&#x7528;&#x5806;&#x758A;&#xFF0C;&#x800C; fold &#x7684;&#x7D50;&#x679C;&#x4E5F;&#x6703;&#x662F;&#x4E00;&#x500B;&#x5806;&#x758A;&#xFF0C;&#x53EA;&#x662F;&#x88E1;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x8981;&#x591A;&#x8003;&#x616E;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x6211;&#x5011;&#x7528;&#x4EC0;&#x9EBC;&#x4F86;&#x4EE3;&#x8868;&#x6211;&#x5011;&#x7684;&#x5806;&#x758A;&#xFF1F;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x7528; list &#x4F86;&#x4EE3;&#x66FF;&#xFF0C;list &#x7684; head &#x5C31;&#x53EF;&#x4EE5;&#x7576;&#x4F5C;&#x662F;&#x5806;&#x758A;&#x7684;&#x9802;&#x7AEF;&#x3002;&#x7562;&#x7ADF;&#x8981;&#x628A;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x52A0;&#x5230; list &#x7684; head &#x8981;&#x6BD4;&#x52A0;&#x5230;&#x6700;&#x5F8C;&#x8981;&#x6709;&#x6548;&#x7387;&#x591A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6211;&#x5011;&#x6709;&#x4E00;&#x500B;&#x5806;&#x758A;&#xFF0C;&#x88E1;&#x9762;&#x6709; <code>10, 4, 3</code>&#xFF0C;&#x90A3;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x7528; <code>[3,4,10]</code> &#x4F86;&#x4EE3;&#x8868;&#x4ED6;&#x3002;</p>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x6709;&#x4E86;&#x8DB3;&#x5920;&#x7684;&#x8CC7;&#x8A0A;&#x4F86;&#x5BEB;&#x51FA;&#x6211;&#x5011;&#x7684;&#x51FD;&#x6578;&#x3002;&#x4ED6;&#x6703;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x5B57;&#x4E32; <code>&quot;10 4 3 + 2 * -&quot;</code>&#xFF0C;&#x96A8;&#x5373;&#x7528; <code>words</code> &#x4F86;&#x65B7;&#x6210; list <code>[&quot;10&quot;,&quot;4&quot;,&quot;3&quot;,&quot;+&quot;,&quot;2&quot;,&quot;*&quot;,&quot;-&quot;]</code>&#x3002;&#x63A5;&#x4E0B;&#x4F86;&#x6211;&#x5011;&#x505A;&#x4E00;&#x500B; left fold &#x4F86;&#x7522;&#x751F;&#x51FA;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x7684;&#x5806;&#x758A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; <code>[-4]</code>&#x3002;&#x6211;&#x5011;&#x628A;&#x9019;&#x500B;&#x5143;&#x7D20;&#x5F9E; list &#x53D6;&#x51FA;&#x4FBF;&#x662F;&#x6700;&#x5F8C;&#x7684;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x4F86;&#x770B;&#x770B;&#x6211;&#x5011;&#x7684;&#x5BE6;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> expression = head (foldl foldingFunction [] (words expression))  
    <span class="hljs-keyword">where</span>   foldingFunction stack item = ...
</code></pre>
<p>&#x6211;&#x5011;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5F0F;&#x4E26;&#x628A;&#x4ED6;&#x65B7;&#x6210;&#x4E00;&#x4E32; List&#x3002;&#x7136;&#x5F8C;&#x6211;&#x5011;&#x7528;&#x4E00;&#x500B; folding &#x51FD;&#x6578;&#x4F86; fold &#x9019;&#x4E32; list&#x3002;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x5011;&#x7528; <code>[]</code> &#x4F86;&#x7576;&#x4F5C;&#x8D77;&#x59CB;&#x7684; accumulator&#x3002;&#x9019;&#x500B; accumulator &#x5C31;&#x662F;&#x6211;&#x5011;&#x7684;&#x5806;&#x758A;&#xFF0C;&#x6240;&#x4EE5; <code>[]</code> &#x4EE3;&#x8868;&#x4E00;&#x500B;&#x7A7A;&#x7684;&#x5806;&#x758A;&#x3002;&#x5728;&#x904B;&#x7B97;&#x4E4B;&#x5F8C;&#x6211;&#x5011;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x7684;&#x5806;&#x758A;&#xFF0C;&#x6211;&#x5011;&#x547C;&#x53EB; <code>head</code> &#x4F86;&#x53D6;&#x51FA;&#x4ED6;&#x4E26;&#x7528; <code>read</code> &#x4F86;&#x8F49;&#x63DB;&#x4ED6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5011;&#x73FE;&#x5728;&#x53EA;&#x7F3A;&#x4E00;&#x500B;&#x63A5;&#x53D7;&#x5806;&#x758A;&#x7684; folding &#x51FD;&#x6578;&#xFF0C;&#x50CF;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7; <code>[4,10]</code> &#x8DDF; <code>&quot;3&quot;</code>&#xFF0C;&#x7136;&#x5F8C;&#x5F97;&#x5230; <code>[3,4,10]</code>&#x3002;&#x5982;&#x679C;&#x662F; <code>[4,10]</code> &#x8DDF; <code>&quot;*&quot;</code>&#xFF0C;&#x90A3;&#x5C31;&#x6703;&#x5F97;&#x5230; <code>[40]</code>&#x3002;&#x4F46;&#x5728;&#x5BE6;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5011;&#x5148;&#x628A;&#x6211;&#x5011;&#x7684;&#x51FD;&#x6578;&#x6539;&#x5BEB;&#x6210; point-free style&#xFF0C;&#x9019;&#x6A23;&#x53EF;&#x4EE5;&#x7701;&#x4E0B;&#x8A31;&#x591A;&#x62EC;&#x865F;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
      <span class="hljs-keyword">where</span>   foldingFunction stack item = ...
</code></pre>
<p>&#x770B;&#x8D77;&#x4F86;&#x597D;&#x591A;&#x4E86;&#x3002;&#x6211;&#x5011;&#x7684; folding &#x51FD;&#x6578;&#x6703;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x5806;&#x758A;&#x3001;&#x65B0;&#x7684;&#x9805;&#xFF0C;&#x4E26;&#x56DE;&#x50B3;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x5806;&#x758A;&#x3002;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x53D6;&#x51FA;&#x5806;&#x758A;&#x6700;&#x4E0A;&#x5C64;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x5F8C;&#x5C0D; <code>&quot;*&quot;</code> &#x8DDF; <code>&quot;-&quot;</code> &#x505A;&#x5339;&#x914D;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">solveRPN</span> :: (<span class="hljs-type">Num</span> a, <span class="hljs-type">Read</span> a) =&gt; <span class="hljs-type">String</span> -&gt; a  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
    <span class="hljs-keyword">where</span>   foldingFunction (x:y:ys) <span class="hljs-string">&quot;*&quot;</span> = (x * y):ys  
            foldingFunction (x:y:ys) <span class="hljs-string">&quot;+&quot;</span> = (x + y):ys  
            foldingFunction (x:y:ys) <span class="hljs-string">&quot;-&quot;</span> = (y - x):ys  
            foldingFunction xs numberString = read numberString:xs
</code></pre>
<p>&#x6211;&#x5011;&#x7528;&#x5C55;&#x958B;&#x6210;&#x56DB;&#x500B;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x6A21;&#x5F0F;&#x6703;&#x5F9E;&#x7B2C;&#x4E00;&#x500B;&#x958B;&#x59CB;&#x5617;&#x8A66;&#x5339;&#x914D;&#x3002;&#x6240;&#x4EE5; folding &#x51FD;&#x6578;&#x6703;&#x770B;&#x770B;&#x76EE;&#x524D;&#x7684;&#x9805;&#x662F;&#x5426;&#x662F; <code>&quot;*&quot;</code>&#x3002;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x90A3;&#x5C31;&#x6703;&#x5C07; <code>[3,4,9,3]</code> &#x7684;&#x982D;&#x5169;&#x500B;&#x5143;&#x7D20;&#x7D81;&#x5B9A;&#x5230; <code>x</code>&#xFF0C;<code>y</code> &#x5169;&#x500B;&#x540D;&#x7A31;&#x3002;&#x6240;&#x4EE5; <code>x</code> &#x6703;&#x662F; <code>3</code> &#x800C; <code>y</code> &#x7B49;&#x65BC; <code>4</code>&#x3002;<code>ys</code> &#x4FBF;&#x6703;&#x662F; <code>[9,3]</code>&#x3002;&#x4ED6;&#x6703;&#x56DE;&#x50B3;&#x4E00;&#x500B; list&#xFF0C;&#x53EA;&#x5DEE;&#x5728; <code>x</code> &#x8DDF; <code>y</code> &#x76F8;&#x4E58;&#x7684;&#x7D50;&#x679C;&#x70BA;&#x7B2C;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8AAA;&#x6703;&#x628A;&#x6700;&#x4E0A;&#x5C64;&#x5169;&#x500B;&#x5143;&#x7D20;&#x53D6;&#x51FA;&#xFF0C;&#x76F8;&#x4E58;&#x5F8C;&#x518D;&#x653E;&#x56DE;&#x53BB;&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x4E0D;&#x662F; <code>&quot;*&quot;</code>&#xFF0C;&#x90A3;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x5C31;&#x6703;&#x6BD4;&#x5C0D;&#x5230; <code>&quot;+&quot;</code>&#xFF0C;&#x4EE5;&#x6B64;&#x985E;&#x63A8;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9805;&#x4E26;&#x672A;&#x5339;&#x914D;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x90A3;&#x6211;&#x5011;&#x5C31;&#x6703;&#x5047;&#x8A2D;&#x9019;&#x500B;&#x5B57;&#x4E32;&#x662F;&#x4E00;&#x500B;&#x6578;&#x503C;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x662F;&#x4E00;&#x500B;&#x6578;&#x503C;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x7528; <code>read</code> &#x4F86;&#x628A;&#x5B57;&#x4E32;&#x8F49;&#x63DB;&#x6210;&#x6578;&#x503C;&#x3002;&#x4E26;&#x628A;&#x9019;&#x500B;&#x6578;&#x503C;&#x63A8;&#x5230;&#x5806;&#x758A;&#x4E0A;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x5011;&#x52A0;&#x4E86; <code>Read a</code> &#x9019;&#x50CF; class constraint&#xFF0C;&#x7562;&#x7ADF;&#x6211;&#x5011;&#x8981;&#x4F7F;&#x7528;&#x5230; <code>read</code> &#x4F86;&#x8F49;&#x63DB;&#x6210;&#x6578;&#x503C;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x5BA3;&#x544A;&#x6210;&#x4ED6;&#x8981;&#x5C6C;&#x65BC; <code>Num</code> &#x8DDF; <code>Read</code> &#x5169;&#x7A2E; typeclass&#x3002;&#xFF08;&#x8B6C;&#x5982;&#x8AAA; <code>Int</code>,<code>Float</code> &#x7B49;&#xFF09;</p>
<p>&#x6211;&#x5011;&#x662F;&#x5F9E;&#x5DE6;&#x81F3;&#x53F3;&#x8D70;&#x904E; <code>[&quot;2&quot;,&quot;3&quot;,&quot;+&quot;]</code>&#x3002;&#x4E00;&#x958B;&#x59CB;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x662F; <code>[]</code>&#x3002;&#x9996;&#x5148;&#x4ED6;&#x6703;&#x7528; <code>[]</code> &#x8DDF; <code>&quot;2&quot;</code> &#x4F86;&#x9935;&#x7D66; folding &#x51FD;&#x6578;&#x3002;&#x7531;&#x65BC;&#x6B64;&#x9805;&#x4E26;&#x4E0D;&#x662F;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50;&#x3002;&#x4ED6;&#x6703;&#x7528; <code>read</code> &#x8B80;&#x53D6;&#x5F8C;&#x52A0;&#x5230; <code>[]</code> &#x7684;&#x958B;&#x982D;&#x3002;&#x6240;&#x4EE5;&#x5806;&#x758A;&#x7684;&#x72C0;&#x614B;&#x8B8A;&#x6210; <code>[2]</code>&#x3002;&#x63A5;&#x4E0B;&#x4F86;&#x5C31;&#x662F;&#x7528; <code>[2]</code> &#x8DDF; <code>[&quot;3&quot;]</code> &#x4F86;&#x9935;&#x7D66; folding &#x51FD;&#x6578;&#xFF0C;&#x800C;&#x5F97;&#x5230; <code>[3,2]</code>&#x3002;&#x6700;&#x5F8C;&#x518D;&#x7528; <code>[3,2]</code> &#x8DDF; <code>&quot;+&quot;</code> &#x4F86;&#x547C;&#x53EB; folding &#x51FD;&#x6578;&#x3002;&#x9019;&#x6703;&#x5806;&#x758A;&#x9802;&#x7AEF;&#x7684;&#x5169;&#x500B;&#x6578;&#x503C;&#xFF0C;&#x52A0;&#x8D77;&#x4F86;&#x5F8C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x3002;&#x6700;&#x5F8C;&#x5806;&#x758A;&#x8B8A;&#x6210; <code>[5]</code>&#xFF0C;&#x9019;&#x5C31;&#x662F;&#x6211;&#x5011;&#x56DE;&#x50B3;&#x7684;&#x6578;&#x503C;&#x3002;</p>
<p>&#x6211;&#x5011;&#x4F86;&#x8A66;&#x8A66;&#x770B;&#x6211;&#x5011;&#x65B0;&#x5BEB;&#x7684;&#x51FD;&#x6578;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 4 3 + 2 * -&quot;</span>  
<span class="hljs-number">-4</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;2 3 +&quot;</span>  
<span class="hljs-number">5</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - +&quot;</span>  
<span class="hljs-number">-3947</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - + -&quot;</span>  
<span class="hljs-number">4037</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 34 12 33 55 66 + * - + -&quot;</span>  
<span class="hljs-number">4037</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;90 3 -&quot;</span>  
<span class="hljs-number">87</span>
</code></pre>
<p>&#x770B;&#x8D77;&#x4F86;&#x904B;&#x4F5C;&#x826F;&#x597D;&#x3002;&#x9019;&#x500B;&#x51FD;&#x6578;&#x6709;&#x4E00;&#x500B;&#x7279;&#x8272;&#x5C31;&#x662F;&#x4ED6;&#x5F88;&#x5BB9;&#x6613;&#x6539;&#x5BEB;&#x4F86;&#x652F;&#x6301;&#x984D;&#x5916;&#x7684;&#x904B;&#x7B97;&#x5B50;&#x3002;&#x4ED6;&#x5011;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x662F;&#x4E8C;&#x5143;&#x904B;&#x7B97;&#x5B50;&#x3002;&#x4F8B;&#x5982;&#x8AAA;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5BEB;&#x4E00;&#x500B;&#x904B;&#x7B97;&#x5B50;&#x53EB;&#x505A; <code>&quot;log&quot;</code>&#xFF0C;&#x4ED6;&#x6703;&#x5F9E;&#x5806;&#x758A;&#x53D6;&#x51FA;&#x4E00;&#x500B;&#x6578;&#x503C;&#x7B97;&#x51FA;&#x4ED6;&#x7684; log &#x5F8C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x3002;&#x6211;&#x5011;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E09;&#x5143;&#x904B;&#x7B97;&#x5B50;&#x4F86;&#x5F9E;&#x5806;&#x758A;&#x53D6;&#x51FA;&#x4E09;&#x500B;&#x6578;&#x503C;&#xFF0C;&#x4E26;&#x628A;&#x7D50;&#x679C;&#x653E;&#x56DE;&#x5806;&#x758A;&#x3002;&#x751A;&#x81F3;&#x662F;&#x50CF;&#x662F; <code>&quot;sum&quot;</code> &#x9019;&#x6A23;&#x7684;&#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x53D6;&#x51FA;&#x6240;&#x6709;&#x6578;&#x503C;&#x4E26;&#x628A;&#x4ED6;&#x5011;&#x7684;&#x548C;&#x63A8;&#x56DE;&#x5806;&#x758A;&#x3002;</p>
<p>&#x6211;&#x5011;&#x4F86;&#x6539;&#x5BEB;&#x4E00;&#x4E0B;&#x6211;&#x5011;&#x7684;&#x51FD;&#x6578;&#x8B93;&#x4ED6;&#x591A;&#x652F;&#x63F4;&#x5E7E;&#x500B;&#x904B;&#x7B97;&#x5B50;&#x3002;&#x70BA;&#x4E86;&#x7C21;&#x55AE;&#x8D77;&#x898B;&#xFF0C;&#x6211;&#x5011;&#x6539;&#x5BEB;&#x5BA3;&#x544A;&#x8B93;&#x4ED6;&#x56DE;&#x50B3; <code>Float</code> &#x578B;&#x5225;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">solveRPN</span> :: <span class="hljs-type">String</span> -&gt; <span class="hljs-type">Float</span>  
<span class="hljs-title">solveRPN</span> = head . foldl foldingFunction [] . words  
<span class="hljs-title">where</span>   foldingFunction (x:y:ys) <span class="hljs-string">&quot;*&quot;</span> = (x * y):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;+&quot;</span> = (x + y):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;-&quot;</span> = (y - x):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;/&quot;</span> = (y / x):ys  
        foldingFunction (x:y:ys) <span class="hljs-string">&quot;^&quot;</span> = (y ** x):ys  
        foldingFunction (x:xs) <span class="hljs-string">&quot;ln&quot;</span> = log x:xs  
        foldingFunction xs <span class="hljs-string">&quot;sum&quot;</span> = [sum xs]  
        foldingFunction xs numberString = read numberString:xs
</code></pre>
<p>&#x770B;&#x8D77;&#x4F86;&#x4E0D;&#x932F;&#xFF0C;&#x6C92;&#x6709;&#x7591;&#x554F;&#x5730; <code>/</code> &#x662F;&#x9664;&#x6CD5;&#x800C; <code>**</code> &#x662F;&#x53D6; exponential&#x3002;&#x81F3;&#x65BC; log &#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x9700;&#x8981;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E00;&#x500B;&#x5143;&#x7D20;&#xFF0C;&#x7562;&#x7ADF; log &#x53EA;&#x9700;&#x8981;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x3002;&#x800C; sum &#x904B;&#x7B97;&#x5B50;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x56DE;&#x50B3;&#x4E00;&#x500B;&#x50C5;&#x6709;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x7684;&#x5806;&#x758A;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7684;&#x548C;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;2.7 ln&quot;</span>  
<span class="hljs-number">0.9932518</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 10 10 10 sum 4 /&quot;</span>  
<span class="hljs-number">10.0</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 10 10 10 10 sum 4 /&quot;</span>  
<span class="hljs-number">12.5</span>  
<span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;10 2 ^&quot;</span>  
<span class="hljs-number">100.0</span>
</code></pre>
<p>&#x7531;&#x65BC; <code>read</code> &#x77E5;&#x9053;&#x5982;&#x4F55;&#x8F49;&#x63DB;&#x6D6E;&#x9EDE;&#x6578;&#xFF0C;&#x6211;&#x5011;&#x4E5F;&#x53EF;&#x5728;&#x904B;&#x7B97;&#x9069;&#x4E2D;&#x4F7F;&#x7528;&#x4ED6;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; solveRPN <span class="hljs-string">&quot;43.2425 0.5 ^&quot;</span>  
<span class="hljs-number">6.575903</span>
</code></pre>
<p>&#x6709;&#x9019;&#x6A23;&#x4E00;&#x500B;&#x5BB9;&#x6613;&#x62D3;&#x5C55;&#x5230;&#x6D6E;&#x9EDE;&#x6578;&#x800C;&#x4E14;&#x52D5;&#x5230;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x53C8;&#x5728;&#x5341;&#x884C;&#x4EE5;&#x5167;&#x7684;&#x51FD;&#x6578;&#xFF0C;&#x6211;&#x60F3;&#x662F;&#x975E;&#x5E38;&#x68D2;&#x7684;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4EF6;&#x4E8B;&#x8981;&#x7559;&#x610F;&#x7684;&#x662F;&#x9019;&#x500B;&#x51FD;&#x6578;&#x5C0D;&#x65BC;&#x932F;&#x8AA4;&#x8655;&#x7406;&#x4E26;&#x4E0D;&#x597D;&#x3002;&#x7576;&#x6211;&#x5011;&#x78B0;&#x5230;&#x975E;&#x6CD5;&#x8F38;&#x5165;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x4ED6;&#x5C31;&#x6703;&#x76F4;&#x63A5;&#x7576;&#x6389;&#x3002;&#x4E4B;&#x5F8C;&#x6211;&#x5011;&#x78B0;&#x5230; Monad &#x7684;&#x6642;&#x5019;&#x6211;&#x5011;&#x6703;&#x5BEB;&#x4E00;&#x500B;&#x5BB9;&#x932F;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4ED6;&#x7684;&#x578B;&#x5225;&#x6703;&#x662F; <code>solveRPN :: String -&gt; Maybe Float</code>&#x3002;&#x7576;&#x7136;&#x6211;&#x5011;&#x73FE;&#x5728;&#x4E5F;&#x53EF;&#x4EE5;&#x5BEB;&#x4E00;&#x500B;&#xFF0C;&#x4E0D;&#x904E;&#x90A3;&#x6703;&#x6709;&#x9EDE;&#x9EBB;&#x7169;&#xFF0C;&#x56E0;&#x70BA;&#x6703;&#x6709;&#x4E00;&#x5927;&#x5806;&#x6AA2;&#x67E5; <code>Nothing</code> &#x7684;&#x52D5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x6311;&#x6230;&#x7684;&#x8A71;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x76E1;&#x7BA1;&#x5617;&#x8A66;&#x3002;&#xFF08;&#x63D0;&#x793A;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x7528; <code>reads</code> &#x4F86;&#x770B;&#x770B;&#x4E00;&#x6B21; read &#x662F;&#x5426;&#x6703;&#x6210;&#x529F;&#xFF09;</p>
<h2 id="&#x8DEF;&#x5F91;&#x898F;&#x5283;">&#x8DEF;&#x5F91;&#x898F;&#x5283;</h2>
<p>&#x6211;&#x5011;&#x63A5;&#x4E0B;&#x4F86;&#x7684;&#x554F;&#x984C;&#x662F;&#xFF1A;&#x4F60;&#x7684;&#x98DB;&#x6A5F;&#x525B;&#x525B;&#x964D;&#x843D;&#x5728;&#x82F1;&#x683C;&#x862D;&#x7684;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x3002;&#x4F60;&#x63A5;&#x4E0B;&#x4F86;&#x6709;&#x4E00;&#x500B;&#x6703;&#x8B70;&#xFF0C;&#x4F60;&#x79DF;&#x4E86;&#x4E00;&#x53F0;&#x8ECA;&#x5E0C;&#x671B;&#x76E1;&#x901F;&#x5F9E;&#x6A5F;&#x5834;&#x524D;&#x5F80;&#x502B;&#x6566;&#x5E02;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>&#x5F9E;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x5230;&#x502B;&#x6566;&#x6709;&#x5169;&#x689D;&#x4E3B;&#x8981;&#x9053;&#x8DEF;&#xFF0C;&#x4ED6;&#x5011;&#x4E2D;&#x9593;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x8DEF;&#x9023;&#x63A5;&#x5F7C;&#x6B64;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8D70;&#x5C0F;&#x8DEF;&#x7684;&#x8A71;&#x90FD;&#x6703;&#x82B1;&#x6389;&#x4E00;&#x5B9A;&#x7684;&#x6642;&#x9593;&#x3002;&#x4F60;&#x7684;&#x554F;&#x984C;&#x5C31;&#x662F;&#x8981;&#x9078;&#x4E00;&#x689D;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x8B93;&#x4F60;&#x53EF;&#x4EE5;&#x76E1;&#x5FEB;&#x524D;&#x5F80;&#x502B;&#x6566;&#x3002;&#x4F60;&#x5F9E;&#x5716;&#x7684;&#x6700;&#x5DE6;&#x908A;&#x51FA;&#x767C;&#xFF0C;&#x4E2D;&#x9593;&#x53EF;&#x80FD;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x4F86;&#x524D;&#x5F80;&#x53F3;&#x908A;&#x3002;</p>
<p><img src="img/roads.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5F9E;&#x5716;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x5F9E;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x5230;&#x502B;&#x6566;&#x5728;&#x9019;&#x500B;&#x8DEF;&#x5F91;&#x914D;&#x7F6E;&#x4E0B;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x662F;&#x5148;&#x9078;&#x4E3B;&#x8981;&#x9053;&#x8DEF; B&#xFF0C;&#x7D93;&#x7531;&#x5C0F;&#x8DEF;&#x5230; A &#x4E4B;&#x5F8C;&#xFF0C;&#x518D;&#x8D70;&#x4E00;&#x5C0F;&#x6BB5;&#xFF0C;&#x8F49;&#x5230; B &#x4E4B;&#x5F8C;&#x7E7C;&#x7E8C;&#x5F80;&#x524D;&#x8D70;&#x3002;&#x5982;&#x679C;&#x63A1;&#x53D6;&#x9019;&#x500B;&#x8DEF;&#x5F91;&#x7684;&#x8A71;&#xFF0C;&#x6703;&#x82B1;&#x53BB; 75 &#x5206;&#x9418;&#x3002;&#x5982;&#x679C;&#x9078;&#x5176;&#x4ED6;&#x9053;&#x8DEF;&#x7684;&#x8A71;&#xFF0C;&#x5C31;&#x6703;&#x82B1;&#x66F4;&#x591A;&#x6642;&#x9593;&#x3002;</p>
<p>&#x6211;&#x5011;&#x4EFB;&#x52D9;&#x5C31;&#x662F;&#x8981;&#x5BEB;&#x4E00;&#x500B;&#x7A0B;&#x5F0F;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x7684;&#x8F38;&#x5165;&#xFF0C;&#x7136;&#x5F8C;&#x5370;&#x51FA;&#x5C0D;&#x61C9;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x7684;&#x8F38;&#x5165;&#x770B;&#x8D77;&#x4F86;&#x50CF;&#x662F;&#x9019;&#x6A23;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-number">50</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">30</span>  
<span class="hljs-number">5</span>  
<span class="hljs-number">90</span>  
<span class="hljs-number">20</span>  
<span class="hljs-number">40</span>  
<span class="hljs-number">2</span>  
<span class="hljs-number">25</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">8</span>  
<span class="hljs-number">0</span>
</code></pre>
<p>&#x6211;&#x5011;&#x5728;&#x5FC3;&#x4E2D;&#x53EF;&#x4EE5;&#x628A;&#x8F38;&#x5165;&#x7684;&#x6578;&#x503C;&#x4E09;&#x500B;&#x4E09;&#x500B;&#x770B;&#x4F5C;&#x4E00;&#x7D44;&#x3002;&#x6BCF;&#x4E00;&#x7D44;&#x7531;&#x9053;&#x8DEF; A,&#x9053;&#x8DEF; B,&#x9084;&#x6709;&#x4EA4;&#x53C9;&#x7684;&#x5C0F;&#x8DEF;&#x7D44;&#x6210;&#x3002;&#x800C;&#x8981;&#x80FD;&#x5920;&#x9019;&#x6A23;&#x7D44;&#x6210;&#xFF0C;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8B93;&#x6700;&#x5F8C;&#x6709;&#x4E00;&#x689D;&#x865B;&#x64EC;&#x7684;&#x4EA4;&#x53C9;&#x5C0F;&#x8DEF;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8D70; 0 &#x5206;&#x9418;&#x5C31;&#x53EF;&#x4EE5;&#x7A7F;&#x8D8A;&#x4ED6;&#x3002;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x4E26;&#x4E0D;&#x6703;&#x5728;&#x610F;&#x5728;&#x502B;&#x6566;&#x88E1;&#x9762;&#x958B;&#x8ECA;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x7562;&#x7ADF;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x5230;&#x9054;&#x502B;&#x6566;&#x4E86;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x5011;&#x5728;&#x89E3; RPN &#x8A08;&#x7B97;&#x6A5F;&#x7684;&#x554F;&#x984C;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x5011;&#x662F;&#x7528;&#x4E09;&#x6B65;&#x9A5F;&#x4F86;&#x89E3;&#x984C;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#x5FD8;&#x6389; Haskell&#xFF0C;&#x60F3;&#x60F3;&#x6211;&#x5011;&#x81EA;&#x5DF1;&#x662F;&#x600E;&#x9EBC;&#x4E00;&#x6B65;&#x6B65;&#x89E3;&#x984C;&#x7684;&#x3002;</li>
<li>&#x60F3;&#x60F3;&#x5982;&#x4F55;&#x5728; Haskell &#x4E2D;&#x8868;&#x9054;&#x6211;&#x5011;&#x7684;&#x8CC7;&#x6599;&#x3002;</li>
<li>&#x5728; Haskell &#x4E2D;&#x8981;&#x5982;&#x4F55;&#x5C0D;&#x9019;&#x4E9B;&#x8CC7;&#x6599;&#x505A;&#x904B;&#x7B97;&#x4F86;&#x7522;&#x751F;&#x51FA;&#x89E3;&#x7B54;&#x3002;</li>
</ul>
<p>&#x5728;&#x4ECB;&#x7D39; RPN &#x8A08;&#x7B97;&#x6A5F;&#x7684;&#x7AE0;&#x7BC0;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x9996;&#x5148;&#x81EA;&#x5DF1;&#x7528;&#x4EBA;&#x8166;&#x8A08;&#x7B97;&#x8868;&#x9054;&#x5F0F;&#xFF0C;&#x5728;&#x5FC3;&#x4E2D;&#x7DAD;&#x6301;&#x4E00;&#x500B;&#x5806;&#x758A;&#x7136;&#x5F8C;&#x4E00;&#x9805;&#x4E00;&#x9805;&#x8655;&#x7406;&#x3002;&#x6211;&#x5011;&#x6C7A;&#x5B9A;&#x7528;&#x4E00;&#x500B;&#x5B57;&#x4E32;&#x4F86;&#x8868;&#x9054;&#x6211;&#x5011;&#x7684;&#x8868;&#x9054;&#x5F0F;&#x3002;&#x6700;&#x5F8C;&#xFF0C;&#x6211;&#x5011;&#x7528; left fold &#x4F86;&#x8D70;&#x904E;&#x6211;&#x5011;&#x9019;&#x4E00;&#x4E32; list&#xFF0C;&#x4E26;&#x7B97;&#x51FA;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x7A76;&#x7ADF;&#x6211;&#x5011;&#x8981;&#x600E;&#x9EBC;&#x7528;&#x624B;&#x7B97;&#x51FA;&#x5F9E;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x5230;&#x502B;&#x6566;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x5462;&#xFF1F;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x89C0;&#x5BDF;&#x6574;&#x7AE0;&#x5716;&#x7247;&#xFF0C;&#x731C;&#x6E2C;&#x54EA;&#x4E00;&#x689D;&#x662F;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x7136;&#x5F8C;&#x5E0C;&#x671B;&#x6211;&#x5011;&#x6709;&#x731C;&#x5C0D;&#x3002;&#x9019;&#x6A23;&#x7684;&#x4F5C;&#x6CD5;&#x5C0D;&#x65BC;&#x5F88;&#x5C0F;&#x7684;&#x8F38;&#x5165;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x5011;&#x7684;&#x8DEF;&#x5F91;&#x8D85;&#x904E; 10000 &#x7D44;&#x5462;&#xFF1F;&#x9019;&#x6A23;&#x6211;&#x5011;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x5011;&#x7684;&#x89E3;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x89E3;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x80FD;&#x8AAA;&#x53EF;&#x80FD;&#x662F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x90A3;&#x4E26;&#x4E0D;&#x662F;&#x4E00;&#x500B;&#x597D;&#x4F5C;&#x6CD5;&#x3002;&#x9019;&#x908A;&#x6709;&#x4E00;&#x5F35;&#x7C21;&#x5316;&#x904E;&#x5F8C;&#x7684;&#x5716;&#x3002;</p>
<p><img src="img/roads_simple.png" alt=""></p>
<p>&#x4F60;&#x80FD;&#x60F3;&#x51FA;&#x4F86;&#x5230;&#x9053;&#x8DEF; A &#x4E0A;&#x7B2C;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x55CE;&#xFF1F;&#xFF08;&#x6A19;&#x8A18;&#x6210; A1 &#x7684;&#x9EDE;&#xFF09;&#x9019;&#x592A;&#x5BB9;&#x6613;&#x4E86;&#x3002;&#x6211;&#x5011;&#x53EA;&#x8981;&#x770B;&#x770B;&#x5F9E;&#x9053;&#x8DEF; A &#x51FA;&#x767C;&#x6216;&#x662F;&#x5F9E;&#x9053;&#x8DEF; B &#x51FA;&#x767C;&#x7A7F;&#x8D8A;&#x81F3;&#x9053;&#x8DEF; A &#x5169;&#x7A2E;&#x4F5C;&#x6CD5;&#x54EA;&#x7A2E;&#x6BD4;&#x8F03;&#x77ED;&#x5C31;&#x597D;&#x3002;&#x5F88;&#x660E;&#x986F;&#x7684;&#xFF0C;&#x5F9E;&#x9053;&#x8DEF; B &#x51FA;&#x767C;&#x7684;&#x6BD4;&#x8F03;&#x77ED;&#xFF0C;&#x53EA;&#x8981;&#x82B1;&#x8CBB; 40 &#x5206;&#x9418;&#xFF0C;&#x7136;&#x800C;&#x5F9E;&#x9053;&#x8DEF; A &#x5247;&#x8981;&#x82B1;&#x8CBB; 50 &#x5206;&#x9418;&#x3002;&#x90A3;&#x5230;&#x4EA4;&#x53C9;&#x9EDE; B1 &#x5462;&#xFF1F;&#x540C;&#x6A23;&#x7684;&#x4F5C;&#x6CD5;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5F9E;&#x9053;&#x8DEF; B &#x51FA;&#x767C;&#x53EA;&#x8981;&#x82B1;&#x8CBB; 10 &#x5206;&#x9418;&#xFF0C;&#x9060;&#x6BD4;&#x5F9E;&#x9053;&#x8DEF; A &#x51FA;&#x767C;&#x7136;&#x5F8C;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x8981;&#x82B1;&#x8CBB;&#x5C11;&#xFF0C;&#x5F8C;&#x8005;&#x8981;&#x82B1;&#x8CBB; 80 &#x5206;&#x9418;&#xFF01;</p>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x77E5;&#x9053;&#x8981;&#x5230;&#x9054; A1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x662F;&#x7D93;&#x7531; B &#x7136;&#x5F8C;&#x9112;&#x5C0F;&#x8DEF;&#x5230;&#x9054;&#xFF0C;&#x5171;&#x82B1;&#x8CBB; 40&#x3002;&#x800C;&#x6211;&#x5011;&#x77E5;&#x9053;&#x8981;&#x9054;&#x5230; B1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x5247;&#x662F;&#x76F4;&#x63A5;&#x8D70; B&#xFF0C;&#x82B1;&#x8CBB; 10&#x3002;&#x9019;&#x6A23;&#x7684;&#x77E5;&#x8B58;&#x6709;&#x8FA6;&#x6CD5;&#x5E6B;&#x52A9;&#x6211;&#x5011;&#x5F97;&#x77E5;&#x5230;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x55CE;&#xFF1F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p>&#x6211;&#x5011;&#x4F86;&#x770B;&#x770B;&#x5230;&#x9054; A2 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x662F;&#x4EC0;&#x9EBD;&#x3002;&#x8981;&#x5230;&#x9054; A2&#xFF0C;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x5F9E; A1 &#x8D70;&#x5230; A2 &#x6216;&#x662F;&#x5F9E; B1 &#x8D70;&#x5C0F;&#x8DEF;&#x3002;&#x7531;&#x65BC;&#x6211;&#x5011;&#x77E5;&#x9053;&#x5230;&#x9054; A1 &#x8DDF; B1 &#x7684;&#x6210;&#x672C;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x60F3;&#x51FA;&#x5230;&#x9054; A2 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x5230;&#x9054; A1 &#x8981;&#x82B1;&#x8CBB; 40&#xFF0C;&#x800C;&#x5F9E; A1 &#x5230; A2 &#x9700;&#x8981; 5&#x3002;&#x6240;&#x4EE5; <code>B, C, A</code> &#x7E3D;&#x5171;&#x8981; 45&#x3002;&#x800C;&#x8981;&#x5230;&#x9054; B1 &#x53EA;&#x8981; 10&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x984D;&#x5916;&#x82B1;&#x8CBB; 110 &#x5206;&#x9418;&#x4F86;&#x5230;&#x9054; B2 &#x7136;&#x5F8C;&#x8D70;&#x5C0F;&#x8DEF;&#x5230;&#x9054; A2&#x3002;&#x6240;&#x4EE5;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x5C31;&#x662F; <code>B, C, A</code>&#x3002;&#x540C;&#x6A23;&#x5730;&#x5230;&#x9054; B2 &#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x8D70; A1 &#x7136;&#x5F8C;&#x8D70;&#x5C0F;&#x8DEF;&#x3002;</p>
<pre><code class="lang-text">&#x4E5F;&#x8A31;&#x4F60;&#x6703;&#x554F;&#x5982;&#x679C;&#x5148;&#x5728; B1 &#x8DE8;&#x5230;&#x9053;&#x8DEF; A &#x7136;&#x5F8C;&#x8D70;&#x5230; A2 &#x7684;&#x60C5;&#x6CC1;&#x5462;&#xFF1F;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x8003;&#x616E;&#x904E;&#x4E86;&#x5F9E; B1 &#x5230; A1 &#x7684;&#x60C5;&#x6CC1;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x628A;&#x4ED6;&#x8003;&#x616E;&#x9032;&#x53BB;&#x3002;
</code></pre>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x6709;&#x4E86;&#x81F3; A2 &#x8DDF; B2 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x91CD;&#x8907;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x76F4;&#x5230;&#x6700;&#x53F3;&#x908A;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x5011;&#x5230;&#x9054;&#x4E86; A4 &#x8DDF; B4&#xFF0C;&#x90A3;&#x5176;&#x4E2D;&#x6BD4;&#x8F03;&#x77ED;&#x7684;&#x5C31;&#x662F;&#x6211;&#x5011;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x4E86;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x5C0D;&#x65BC;&#x7B2C;&#x4E8C;&#x7D44;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x662F;&#x4E0D;&#x65B7;&#x5730;&#x91CD;&#x8907;&#x4E4B;&#x524D;&#x7684;&#x6B65;&#x9A5F;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x5011;&#x8003;&#x616E;&#x9032;&#x5728;&#x524D;&#x9762;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x800C;&#x5DF2;&#x3002;&#x7576;&#x7136;&#x6211;&#x5011;&#x4E5F;&#x53EF;&#x4EE5;&#x8AAA;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x8003;&#x616E;&#x9032;&#x4E86;&#x524D;&#x9762;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#xFF0C;&#x53EA;&#x662F;&#x4ED6;&#x5011;&#x90FD;&#x662F; 0 &#x800C;&#x5DF2;&#x3002;</p>
<p>&#x7E3D;&#x7D50;&#x4E00;&#x4E0B;&#x3002;&#x8981;&#x5F97;&#x5230;&#x5F9E;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x5230;&#x502B;&#x6566;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x9996;&#x5148;&#x770B;&#x770B;&#x5230;&#x9054;&#x4E0B;&#x4E00;&#x500B;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;&#x5171;&#x6709;&#x5169;&#x7A2E;&#x9078;&#x64C7;&#x7684;&#x8DEF;&#x5F91;&#xFF0C;&#x4E00;&#x662F;&#x76F4;&#x63A5;&#x5F9E;&#x9053;&#x8DEF; A &#x51FA;&#x767C;&#x7136;&#x5F8C;&#x8D70;&#x5230;&#x4EA4;&#x53C9;&#x9EDE;&#xFF0C;&#x8981;&#x4E0D;&#x7136;&#x5C31;&#x662F;&#x5F9E;&#x9053;&#x8DEF; B &#x51FA;&#x767C;&#xFF0C;&#x8D70;&#x5230;&#x7B2C;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7136;&#x5F8C;&#x8D70;&#x5C0F;&#x8DEF;&#x3002;&#x5F97;&#x5230;&#x7D50;&#x679C;&#x5F8C;&#x8A18;&#x4F4F;&#x7D50;&#x679C;&#x3002;&#x63A5;&#x8457;&#x518D;&#x7528;&#x540C;&#x6A23;&#x7684;&#x65B9;&#x6CD5;&#x4F86;&#x5F97;&#x5230;&#x8D70;&#x5230;&#x9053;&#x8DEF; B &#x4E0A;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#xFF0C;&#x4E26;&#x4E5F;&#x8A18;&#x4F4F;&#x7D50;&#x679C;&#x3002;&#x7136;&#x5F8C;&#x6211;&#x5011;&#x770B;&#x770B;&#x8981;&#x8D70;&#x5230;&#x518D;&#x4E0B;&#x4E00;&#x500B;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#xFF0C;&#x7A76;&#x7ADF;&#x662F;&#x5F9E;&#x9019;&#x500B;&#x9053;&#x8DEF; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x6216;&#x662F;&#x5F9E;&#x5C0D;&#x61C9;&#x7684;&#x9053;&#x8DEF; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x5F80;&#x524D;&#x8D70;&#x518D;&#x8D70;&#x5230;&#x5C0D;&#x9762;&#xFF0C;&#x5169;&#x7A2E;&#x9078;&#x64C7;&#x54EA;&#x7A2E;&#x6BD4;&#x8F03;&#x597D;&#x3002;&#x8A18;&#x4E0B;&#x6BD4;&#x8F03;&#x597D;&#x7684;&#x9078;&#x64C7;&#xFF0C;&#x7136;&#x5F8C;&#x4E5F;&#x5C0D;&#x5C0D;&#x61C9;&#x7684;&#x9053;&#x8DEF; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x505A;&#x4E00;&#x6B21;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x3002;&#x505A;&#x5B8C;&#x5168;&#x90E8;&#x7D44;&#x4E4B;&#x5F8C;&#x5C31;&#x5230;&#x9054;&#x6700;&#x53F3;&#x908A;&#x3002;&#x4E00;&#x65E6;&#x5230;&#x9054;&#x6700;&#x53F3;&#x908A;&#xFF0C;&#x6700;&#x4F73;&#x7684;&#x9078;&#x64C7;&#x5C31;&#x662F;&#x6211;&#x5011;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x4E86;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x7576;&#x6211;&#x5011;&#x5230;&#x9054;&#x6700;&#x53F3;&#x908A;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x5011;&#x8A18;&#x4E0B;&#x4E86;&#x6700;&#x5F8C;&#x505C;&#x5728;&#x9053;&#x8DEF; A &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x8DDF;&#x6700;&#x5F8C;&#x505C;&#x5728;&#x9053;&#x8DEF; B &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;&#x5176;&#x4E2D;&#x6BD4;&#x8F03;&#x77ED;&#x7684;&#x662F;&#x6211;&#x5011;&#x771F;&#x6B63;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;&#x73FE;&#x5728;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x7528;&#x624B;&#x7B97;&#x51FA;&#x7B54;&#x6848;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x9592;&#x5DE5;&#x592B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x62FF;&#x7D19;&#x7B46;&#x5C0D;&#x65BC;&#x4EFB;&#x4F55;&#x4E00;&#x7D44;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x7B97;&#x51FA;&#x4ED6;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x4F86;&#x7684;&#x554F;&#x984C;&#x662F;&#xFF0C;&#x6211;&#x5011;&#x8981;&#x5982;&#x4F55;&#x7528; Haskell &#x7684;&#x578B;&#x5225;&#x4F86;&#x4EE3;&#x8868;&#x9019;&#x88E1;&#x7684;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#x5462;&#xFF1F;&#x4E00;&#x7A2E;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x628A;&#x8D77;&#x59CB;&#x9EDE;&#x8DDF;&#x4EA4;&#x53C9;&#x9EDE;&#x90FD;&#x7576;&#x4F5C;&#x5716;&#x7684;&#x7BC0;&#x9EDE;&#xFF0C;&#x4E26;&#x9023;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x60F3;&#x50CF;&#x5176;&#x5BE6;&#x8D77;&#x9EDE;&#x4E5F;&#x6709;&#x4E00;&#x689D;&#x9577;&#x5EA6;&#x70BA; 1 &#x7684;&#x865B;&#x64EC;&#x9053;&#x8DEF;&#x9023;&#x63A5;&#x5F7C;&#x6B64;&#xFF0C;&#x90A3;&#x6BCF;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x6216;&#x662F;&#x7BC0;&#x9EDE;&#x5C31;&#x90FD;&#x9023;&#x63A5;&#x5C0D;&#x9762;&#x7684;&#x7BC0;&#x9EDE;&#x4E86;&#x3002;&#x540C;&#x6642;&#x4ED6;&#x5011;&#x4E5F;&#x9023;&#x5230;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x3002;&#x552F;&#x4E00;&#x7684;&#x4F8B;&#x5916;&#x662F;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#xFF0C;&#x4ED6;&#x5011;&#x53EA;&#x9023;&#x63A5;&#x5230;&#x5C0D;&#x9762;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Node</span> = <span class="hljs-type">Node</span> <span class="hljs-type">Road</span> <span class="hljs-type">Road</span> | <span class="hljs-type">EndNode</span> <span class="hljs-type">Road</span>  </span>
<span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Road</span> = <span class="hljs-type">Road</span> <span class="hljs-type">Int</span> <span class="hljs-type">Node</span></span>
</code></pre>
<p>&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#x8981;&#x78BC;&#x662F;&#x4E00;&#x500B;&#x666E;&#x901A;&#x7684;&#x7BC0;&#x9EDE;&#xFF0C;&#x4ED6;&#x5305;&#x542B;&#x6709;&#x901A;&#x5F80;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x8DEF;&#x5F91;&#x8CC7;&#x8A0A;&#xFF0C;&#x9084;&#x6709;&#x5F80;&#x5C0D;&#x9762;&#x9053;&#x8DEF;&#x7684;&#x8CC7;&#x8A0A;&#x3002;&#x6216;&#x662F;&#x4E00;&#x500B;&#x7D42;&#x7AEF;&#x9EDE;&#xFF0C;&#x53EA;&#x5305;&#x542B;&#x5F80;&#x5C0D;&#x9762;&#x7BC0;&#x9EDE;&#x7684;&#x9053;&#x8DEF;&#x8CC7;&#x8A0A;&#x3002;&#x4E00;&#x689D;&#x9053;&#x8DEF;&#x5305;&#x542B;&#x4ED6;&#x591A;&#x9577;&#xFF0C;&#x9084;&#x6709;&#x4ED6;&#x6307;&#x5411;&#x54EA;&#x88E1;&#x3002;&#x4F8B;&#x5982;&#x8AAA;&#xFF0C;&#x9053;&#x8DEF; A &#x7684;&#x7B2C;&#x4E00;&#x500B;&#x90E8;&#x4EFD;&#x5C31;&#x53EF;&#x5BEB;&#x6210; <code>Road 50 a1</code>&#x3002;&#x5176;&#x4E2D; <code>a1</code> &#x662F; <code>Node x y</code> &#x9019;&#x6A23;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#x3002;&#x800C; <code>x</code> &#x8DDF; <code>y</code> &#x5247;&#x5206;&#x5225;&#x6307;&#x5411; B1 &#x8DDF; A2&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x7A2E;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7528; <code>Maybe</code> &#x4F86;&#x4EE3;&#x8868;&#x5F80;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x8D70;&#x7684;&#x8DEF;&#x3002;&#x6BCF;&#x500B;&#x7BC0;&#x9EDE;&#x6709;&#x6307;&#x5230;&#x5C0D;&#x9762;&#x7BC0;&#x9EDE;&#x7684;&#x8DEF;&#x5F91;&#x90E8;&#x4EFD;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x4E0D;&#x662F;&#x7D42;&#x7AEF;&#x7BC0;&#x9EDE;&#x7684;&#x7BC0;&#x9EDE;&#x624D;&#x6709;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x8DEF;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Node</span> = <span class="hljs-type">Node</span> <span class="hljs-type">Road</span> (<span class="hljs-type">Maybe</span> <span class="hljs-type">Road</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Road</span> = <span class="hljs-type">Road</span> <span class="hljs-type">Int</span> <span class="hljs-type">Node</span></span>
</code></pre>
<p>&#x9019;&#x4E9B;&#x662F;&#x7528; Haskell &#x4F86;&#x4EE3;&#x8868;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x6211;&#x5011;&#x4E5F;&#x80FD;&#x9760;&#x4ED6;&#x5011;&#x4F86;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x3002;&#x4F46;&#x4E5F;&#x8A31;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x60F3;&#x51FA;&#x66F4;&#x7C21;&#x55AE;&#x7684;&#x6A21;&#x578B;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x5011;&#x60F3;&#x60F3;&#x4E4B;&#x524D;&#x624B;&#x7B97;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x5011;&#x6BCF;&#x6B21;&#x6AA2;&#x67E5;&#x90FD;&#x53EA;&#x6709;&#x6AA2;&#x67E5;&#x4E09;&#x689D;&#x8DEF;&#x5F91;&#x7684;&#x9577;&#x5EA6;&#x800C;&#x5DF2;&#x3002;&#x5728;&#x9053;&#x8DEF; A &#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x8DDF;&#x5728;&#x9053;&#x8DEF; B &#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x9084;&#x6709;&#x63A5;&#x89F8;&#x5169;&#x500B;&#x90E8;&#x4EFD;&#x4E26;&#x5C07;&#x4ED6;&#x5011;&#x9023;&#x63A5;&#x8D77;&#x4F86;&#x7684;&#x90E8;&#x4EFD;&#x3002;&#x7576;&#x6211;&#x5011;&#x89C0;&#x5BDF;&#x5230; A1 &#x8DDF; B1 &#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x6642;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x8003;&#x616E;&#x7B2C;&#x4E00;&#x7D44;&#x7684;&#x4E09;&#x500B;&#x90E8;&#x4EFD;&#xFF0C;&#x4ED6;&#x5011;&#x5206;&#x5225;&#x82B1;&#x8CBB; 50, 10 &#x8DDF; 30&#x3002;&#x6240;&#x4EE5;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#x53EF;&#x4EE5;&#x7528;&#x56DB;&#x7D44;&#x4F86;&#x8868;&#x793A;&#xFF1A;<code>50, 10, 30</code>&#xFF0C;<code>5, 90, 20</code>&#xFF0C;<code>40, 2, 25</code> &#x8DDF; <code>10, 8, 0</code>&#x3002;</p>
<p>&#x8B93;&#x6211;&#x5011;&#x8CC7;&#x6599;&#x578B;&#x5225;&#x8D8A;&#x7C21;&#x55AE;&#x8D8A;&#x597D;&#xFF0C;&#x4E0D;&#x904E;&#x9019;&#x6A23;&#x5DF2;&#x7D93;&#x662F;&#x6975;&#x9650;&#x4E86;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Section</span> = <span class="hljs-type">Section</span> { <span class="hljs-title">getA</span> :: <span class="hljs-type">Int</span>, <span class="hljs-title">getB</span> :: <span class="hljs-type">Int</span>, <span class="hljs-title">getC</span> :: <span class="hljs-type">Int</span> } <span class="hljs-keyword">deriving</span> (<span class="hljs-type">Show</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">type</span> <span class="hljs-type">RoadSystem</span> = [<span class="hljs-type">Section</span>]</span>
</code></pre>
<p>&#x9019;&#x6A23;&#x5F88;&#x5B8C;&#x7F8E;&#xFF0C;&#x800C;&#x4E14;&#x5C0D;&#x65BC;&#x6211;&#x5011;&#x7684;&#x5BE6;&#x4F5C;&#x4E5F;&#x6709;&#x5E6B;&#x52A9;&#x3002;<code>Section</code> &#x662F;&#x4E00;&#x500B; algebraic data type&#xFF0C;&#x5305;&#x542B;&#x4E09;&#x500B;&#x6574;&#x6578;&#xFF0C;&#x5206;&#x5225;&#x4EE3;&#x8868;&#x4E09;&#x500B;&#x4E0D;&#x540C;&#x90E8;&#x4EFD;&#x7684;&#x9053;&#x8DEF;&#x9577;&#x3002;&#x6211;&#x5011;&#x4E5F;&#x5B9A;&#x7FA9;&#x4E86;&#x578B;&#x5225;&#x540C;&#x7FA9;&#x5B57;&#xFF0C;&#x8AAA; <code>RoadSystem</code> &#x4EE3;&#x8868;&#x5305;&#x542B; section &#x7684; list&#x3002;</p>
<pre><code class="lang-text">&#x7576;&#x7136;&#x6211;&#x5011;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x500B; tuple ``(Int, Int, Int)`` &#x4F86;&#x4EE3;&#x8868;&#x4E00;&#x500B; section&#x3002;&#x4F7F;&#x7528; tuple &#x5C0D;&#x65BC;&#x4E00;&#x4E9B;&#x7C21;&#x55AE;&#x7684;&#x60C5;&#x6CC1;&#x662F;&#x6BD4;&#x8F03;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x5C0D;&#x65BC;&#x6BD4;&#x8F03;&#x8907;&#x96DC;&#x7684;&#x60C5;&#x6CC1;&#x5B9A;&#x7FA9;&#x81EA;&#x5DF1;&#x7684; algebraic data type &#x6703;&#x6BD4;&#x8F03;&#x597D;&#x3002;&#x4ED6;&#x8B93;&#x578B;&#x5225;&#x7CFB;&#x7D71;&#x7372;&#x5F97;&#x6BD4;&#x8F03;&#x591A;&#x7684;&#x8CC7;&#x8A0A;&#x3002;``(Int, Int, Int)`` &#x7562;&#x7ADF;&#x4E5F;&#x53EF;&#x80FD;&#x88AB;&#x4F7F;&#x7528;&#x5728;&#x5B9A;&#x7FA9;&#x4E09;&#x7DAD;&#x7A7A;&#x9593;&#x4E2D;&#x7684;&#x4E00;&#x500B;&#x5411;&#x91CF;&#xFF0C;&#x53EA;&#x7528; tuple &#x8B93;&#x6211;&#x5011;&#x53EF;&#x80FD;&#x628A;&#x9019;&#x5169;&#x7A2E;&#x60C5;&#x5F62;&#x6DF7;&#x96DC;&#x8D77;&#x4F86;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x7528; ``Section`` &#x8DDF; ``Vector`` &#x7684;&#x8A71;&#x5C31;&#x4E0D;&#x6703;&#x4E0D;&#x5C0F;&#x5FC3;&#x641E;&#x6DF7;&#x4E86;&#x3002;
</code></pre>
<p>&#x5F9E;&#x5E0C;&#x601D;&#x7F85;&#x6A5F;&#x5834;&#x5230;&#x502B;&#x6566;&#x7684;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#x4FBF;&#x53EF;&#x4EE5;&#x9019;&#x6A23;&#x8868;&#x793A;&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-title">heathrowToLondon</span> :: <span class="hljs-type">RoadSystem</span>  
<span class="hljs-title">heathrowToLondon</span> = [<span class="hljs-type">Section</span> <span class="hljs-number">50</span> <span class="hljs-number">10</span> <span class="hljs-number">30</span>, <span class="hljs-type">Section</span> <span class="hljs-number">5</span> <span class="hljs-number">90</span> <span class="hljs-number">20</span>, <span class="hljs-type">Section</span> <span class="hljs-number">40</span> <span class="hljs-number">2</span> <span class="hljs-number">25</span>, <span class="hljs-type">Section</span> <span class="hljs-number">10</span> <span class="hljs-number">8</span> <span class="hljs-number">0</span>]
</code></pre>
<p>&#x6211;&#x5011;&#x73FE;&#x5728;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528; Haskell &#x5BE6;&#x4F5C;&#x6211;&#x5011;&#x5148;&#x524D;&#x7684;&#x89E3;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x61C9;&#x8A72;&#x600E;&#x6A23;&#x5BA3;&#x544A;&#x6211;&#x5011;&#x8A08;&#x7B97;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x51FD;&#x6578;&#x7684;&#x578B;&#x5225;&#x5462;&#xFF1F;&#x4ED6;&#x61C9;&#x8A72;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#x4F5C;&#x70BA;&#x53C3;&#x6578;&#xFF0C;&#x7136;&#x5F8C;&#x56DE;&#x50B3;&#x4E00;&#x500B;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x6703;&#x7528;&#x4E00;&#x500B; list &#x4F86;&#x4EE3;&#x8868;&#x6211;&#x5011;&#x7684;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x5B9A;&#x7FA9;&#x4E86; <code>Label</code> &#x4F86;&#x8868;&#x793A; <code>A</code>, <code>B</code> &#x6216; <code>C</code>&#x3002;&#x4E26;&#x4E14;&#x4E5F;&#x5B9A;&#x7FA9;&#x4E00;&#x500B;&#x540C;&#x7FA9;&#x8A5E; <code>Path</code>&#xFF1A;</p>
<pre><code class="lang-haskell"><span class="hljs-class"><span class="hljs-keyword">data</span> <span class="hljs-type">Label</span> = <span class="hljs-type">A</span> | <span class="hljs-type">B</span> | <span class="hljs-type">C</span> <span class="hljs-keyword">deriving</span> (<span class="hljs-type">Show</span>)  </span>
<span class="hljs-class"><span class="hljs-keyword">type</span> <span class="hljs-type">Path</span> = [(<span class="hljs-type">Label</span>, <span class="hljs-type">Int</span>)]</span>
</code></pre>
<p>&#x800C;&#x6211;&#x5011;&#x7684;&#x51FD;&#x6578; <code>optimalPath</code> &#x61C9;&#x8A72;&#x8981;&#x6709; <code>optimalPath :: RoadSystem -&gt; Path</code> &#x9019;&#x6A23;&#x7684;&#x578B;&#x5225;&#x3002;&#x5982;&#x679C;&#x88AB;&#x9935;&#x7D66; <code>heathrowToLondon</code> &#x9019;&#x6A23;&#x7684;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#xFF0C;&#x4ED6;&#x61C9;&#x8A72;&#x8981;&#x56DE;&#x50B3;&#x4E0B;&#x5217;&#x7684;&#x8DEF;&#x5F91;&#xFF1A;</p>
<pre><code class="lang-haskell">[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">A</span>,<span class="hljs-number">5</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">20</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">2</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">8</span>)]
</code></pre>
<p>&#x6211;&#x5011;&#x63A5;&#x4E0B;&#x4F86;&#x5C31;&#x5F9E;&#x5DE6;&#x81F3;&#x53F3;&#x4F86;&#x8D70;&#x4E00;&#x904D; list&#xFF0C;&#x4E26;&#x6CBF;&#x8DEF;&#x4E0A;&#x8A18;&#x4E0B; A &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x6703; accumulate &#x6211;&#x5011;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x9019;&#x807D;&#x8D77;&#x4F86;&#x6709;&#x6C92;&#x6709;&#x5F88;&#x719F;&#x6089;&#xFF1F;&#x6C92;&#x932F;&#xFF01;&#x5C31;&#x662F; left fold&#x3002;</p>
<p>&#x7576;&#x6211;&#x5011;&#x624B;&#x52D5;&#x505A;&#x89E3;&#x7B54;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x6B65;&#x9A5F;&#x662F;&#x6211;&#x5011;&#x4E0D;&#x65B7;&#x91CD;&#x8907;&#x7684;&#x3002;&#x5C31;&#x662F;&#x6AA2;&#x67E5;&#x73FE;&#x6709; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x4EE5;&#x53CA;&#x76EE;&#x524D;&#x7684; section&#xFF0C;&#x7522;&#x751F;&#x51FA;&#x65B0;&#x7684; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x8209;&#x4F8B;&#x4F86;&#x8AAA;&#xFF0C;&#x6700;&#x958B;&#x59CB;&#x6211;&#x5011;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x662F; <code>[]</code> &#x8DDF; <code>[]</code>&#x3002;&#x6211;&#x5011;&#x770B;&#x904E; <code>Section 50 10 30</code> &#x5F8C;&#x5C31;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x5230; A1 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x70BA; <code>[(B,10),(C,30)]</code>&#xFF0C;&#x800C;&#x5230; B1 &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x662F; <code>[(B,10)]</code>&#x3002;&#x5982;&#x679C;&#x4F60;&#x5011;&#x628A;&#x9019;&#x500B;&#x6B65;&#x9A5F;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x500B;&#x51FD;&#x6578;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x5C0D;&#x8DEF;&#x5F91;&#x8DDF;&#x4E00;&#x500B; section&#xFF0C;&#x4E26;&#x7522;&#x751F;&#x51FA;&#x65B0;&#x7684;&#x4E00;&#x5C0D;&#x8DEF;&#x5F91;&#x3002;&#x6240;&#x4EE5;&#x578B;&#x5225;&#x662F; <code>(Path, Path) -&gt; Section -&gt; (Path, Path)</code>&#x3002;&#x6211;&#x5011;&#x63A5;&#x4E0B;&#x4F86;&#x7E7C;&#x7E8C;&#x5BE6;&#x4F5C;&#x9019;&#x500B;&#x51FD;&#x6578;&#x3002;</p>
<pre><code class="lang-text">&#x63D0;&#x793A;&#xFF1A;&#x628A; ``(Path, Path) -&gt; Section -&gt; (Path, Path)`` &#x7576;&#x4F5C; left fold &#x7528;&#x7684;&#x4E8C;&#x5143;&#x51FD;&#x6578;&#xFF0C;fold &#x8981;&#x6C42;&#x7684;&#x578B;&#x614B;&#x662F; ``a -&gt; b -&gt; a``&#x3002;
</code></pre>
<pre><code class="lang-haskell"><span class="hljs-title">roadStep</span> :: (<span class="hljs-type">Path</span>, <span class="hljs-type">Path</span>) -&gt; <span class="hljs-type">Section</span> -&gt; (<span class="hljs-type">Path</span>, <span class="hljs-type">Path</span>)  
<span class="hljs-title">roadStep</span> (pathA, pathB) (<span class="hljs-type">Section</span> a b c) =   
    <span class="hljs-keyword">let</span> priceA = sum $ map snd pathA  
        priceB = sum $ map snd pathB  
        forwardPriceToA = priceA + a  
        crossPriceToA = priceB + b + c  
        forwardPriceToB = priceB + b  
        crossPriceToB = priceA + a + c  
        newPathToA = <span class="hljs-keyword">if</span> forwardPriceToA &lt;= crossPriceToA  
                        <span class="hljs-keyword">then</span> (<span class="hljs-type">A</span>,a):pathA  
                        <span class="hljs-keyword">else</span> (<span class="hljs-type">C</span>,c):(<span class="hljs-type">B</span>,b):pathB  
        newPathToB = <span class="hljs-keyword">if</span> forwardPriceToB &lt;= crossPriceToB  
                        <span class="hljs-keyword">then</span> (<span class="hljs-type">B</span>,b):pathB  
                        <span class="hljs-keyword">else</span> (<span class="hljs-type">C</span>,c):(<span class="hljs-type">A</span>,a):pathA  
    <span class="hljs-keyword">in</span>  (newPathToA, newPathToB)
</code></pre>
<p><img src="img/guycar.png" alt=""></p>
<p>&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5F0F;&#x7A76;&#x7ADF;&#x5BEB;&#x4E86;&#x4E9B;&#x4EC0;&#x9EBD;&#xFF1F;&#x9996;&#x5148;&#x4ED6;&#x6839;&#x64DA;&#x5148;&#x524D; A &#x7684;&#x6700;&#x4F73;&#x89E3;&#x8A08;&#x7B97;&#x51FA;&#x9053;&#x8DEF; A &#x7684;&#x6700;&#x4F73;&#x89E3;&#xFF0C;&#x4E4B;&#x5F8C;&#x4E5F;&#x5982;&#x6CD5;&#x70AE;&#x88FD;&#x8A08;&#x7B97; B &#x7684;&#x6700;&#x4F73;&#x89E3;&#x3002;&#x4F7F;&#x7528; <code>sum $ map snd pathA</code>&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C; <code>pathA</code> &#x662F; <code>[(A,100),(C,20)]</code>&#x3002;<code>priceA</code> &#x5C31;&#x662F; <code>120</code>&#x3002;<code>forwardPriceToA</code> &#x5C31;&#x6703;&#x662F;&#x6211;&#x5011;&#x8981;&#x4ED8;&#x7684;&#x6210;&#x672C;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x662F;&#x5F9E;&#x5148;&#x524D;&#x5728; A &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x524D;&#x5F80;&#x3002;&#x90A3;&#x4ED6;&#x5C31;&#x6703;&#x7B49;&#x65BC;&#x6211;&#x5011;&#x81F3;&#x5148;&#x524D;&#x4EA4;&#x53C9;&#x9EDE;&#x7684;&#x6700;&#x4F73;&#x89E3;&#x52A0;&#x4E0A;&#x76EE;&#x524D; section &#x4E2D; A &#x7684;&#x90E8;&#x4EFD;&#x3002;<code>crossPriceToA</code> &#x5247;&#x662F;&#x6211;&#x5011;&#x5F9E;&#x5148;&#x524D;&#x5728; B &#x4E0A;&#x7684;&#x4EA4;&#x53C9;&#x9EDE;&#x524D;&#x5F80; A &#x6240;&#x8981;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x50F9;&#x3002;&#x4ED6;&#x662F;&#x5148;&#x524D; B &#x7684;&#x6700;&#x4F73;&#x89E3;&#x52A0;&#x4E0A; section &#x4E2D; B &#x7684;&#x90E8;&#x4EFD;&#x52A0;&#x4E0A; C &#x7684;&#x9577;&#x3002;&#x540C;&#x6A23;&#x5730;&#x65B9;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x6C7A;&#x5B9A; <code>forwardPriceToB</code> &#x8DDF; <code>crossPriceToB</code>&#x3002;</p>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x77E5;&#x9053;&#x4E86;&#x5230; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#xFF0C;&#x6211;&#x5011;&#x9700;&#x8981;&#x6839;&#x64DA;&#x9019;&#x4E9B;&#x8CC7;&#x8A0A;&#x4F86;&#x69CB;&#x9020;&#x5230; A &#x8DDF; B &#x7684;&#x6574;&#x9AD4;&#x8DEF;&#x5F91;&#x3002;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x8D70;&#x5230; A &#x8017;&#x8CBB;&#x8F03;&#x5C11;&#x7684;&#x8A71;&#xFF0C;&#x6211;&#x5011;&#x5C31;&#x628A; <code>newPathToA</code> &#x8A2D;&#x5B9A;&#x6210; <code>(A,a):pathA</code>&#x3002;&#x9019;&#x6A23;&#x505A;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x628A; <code>Label</code> <code>A</code> &#x8DDF; section &#x7684;&#x9577;&#x5EA6; <code>a</code> &#x63A5;&#x5230;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x7684;&#x524D;&#x9762;&#x3002;&#x8981;&#x8A18;&#x5F97; <code>A</code> &#x662F;&#x4E00;&#x500B; label&#xFF0C;&#x800C; <code>a</code> &#x7684;&#x578B;&#x5225;&#x662F; <code>Int</code>&#x3002;&#x6211;&#x5011;&#x70BA;&#x4EC0;&#x9EBD;&#x8981;&#x63A5;&#x5728;&#x524D;&#x9762;&#x800C;&#x4E0D;&#x662F; <code>pathA ++ [(A,a)]</code> &#x5462;&#xFF1F;&#x56E0;&#x70BA;&#x63A5;&#x5728; list &#x7684;&#x524D;&#x9762;&#x6BD4;&#x8D77;&#x63A5;&#x5728;&#x5F8C;&#x7AEF;&#x8981;&#x6709;&#x6548;&#x7387;&#x591A;&#x4E86;&#x3002;&#x4E0D;&#x904E;&#x9019;&#x6A23;&#x7522;&#x751F;&#x51FA;&#x4F86;&#x7684; list &#x5C31;&#x6703;&#x76F8;&#x53CD;&#x3002;&#x4F46;&#x8981;&#x628A; list &#x518D;&#x53CD;&#x904E;&#x4F86;&#x4E26;&#x4E0D;&#x96E3;&#x3002;&#x5982;&#x679C;&#x5148;&#x8D70;&#x5230; B &#x518D;&#x7A7F;&#x8D8A;&#x5C0F;&#x8DEF;&#x8D70;&#x5230; A &#x6BD4;&#x8F03;&#x77ED;&#x7684;&#x8A71;&#xFF0C;&#x90A3; <code>newPathToA</code> &#x5C31;&#x6703;&#x5305;&#x542B;&#x9019;&#x6A23;&#x8D70;&#x7684;&#x8DEF;&#x7DDA;&#x3002;&#x540C;&#x6A23;&#x7684;&#x9053;&#x7406;&#x4E5F;&#x53EF;&#x4EE5;&#x5957;&#x7528;&#x5728; <code>newPathToB</code> &#x4E0A;&#x3002;</p>
<p>&#x6700;&#x5F8C;&#x6211;&#x5011;&#x56DE;&#x50B3; <code>newPathToA</code> &#x8DDF; <code>newPathToB</code> &#x9019;&#x4E00;&#x5C0D;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x6211;&#x5011;&#x628A; <code>heathrowToLondon</code> &#x7684;&#x7B2C;&#x4E00;&#x500B; section &#x9935;&#x7D66;&#x6211;&#x5011;&#x7684;&#x51FD;&#x6578;&#x3002;&#x7531;&#x65BC;&#x4ED6;&#x662F;&#x7B2C;&#x4E00;&#x500B; section&#xFF0C;&#x6240;&#x4EE5;&#x5230; A &#x8DDF; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x5C31;&#x662F;&#x4E00;&#x5C0D;&#x7A7A;&#x7684; list&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; roadStep ([], []) (head heathrowToLondon)  
([(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>)],[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>)])
</code></pre>
<p>&#x8981;&#x8A18;&#x4F4F;&#x5305;&#x542B;&#x7684;&#x8DEF;&#x5F91;&#x662F;&#x53CD;&#x904E;&#x4F86;&#x7684;&#xFF0C;&#x8981;&#x5F9E;&#x53F3;&#x908A;&#x5F80;&#x5DE6;&#x908A;&#x8B80;&#x3002;&#x6240;&#x4EE5;&#x5230; A &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x53EF;&#x4EE5;&#x89E3;&#x8B80;&#x6210;&#x5F9E; B &#x51FA;&#x767C;&#xFF0C;&#x7136;&#x5F8C;&#x7A7F;&#x8D8A;&#x5230;&#x9053;&#x8DEF; A&#x3002;&#x800C; B &#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x5247;&#x662F;&#x76F4;&#x63A5;&#x5F9E; B &#x51FA;&#x767C;&#x8D70;&#x5230;&#x4E0B;&#x4E00;&#x500B;&#x4EA4;&#x53C9;&#x9EDE;&#x3002;</p>
<pre><code class="lang-text">&#x512A;&#x5316;&#x5C0F;&#x6280;&#x5DE7;&#xFF1A;&#x7576;&#x6211;&#x5011;&#x5BEB; ``priceA = sum $ map snd pathA`` &#x7684;&#x6642;&#x5019;&#x3002;&#x6211;&#x5011;&#x662F;&#x5728;&#x8A08;&#x7B97;&#x6BCF;&#x6B65;&#x7684;&#x6210;&#x672C;&#x3002;&#x5982;&#x679C;&#x6211;&#x5011;&#x5BE6;&#x4F5C; ``roadStep`` &#x6210; ``(Path, Path, Int, Int) -&gt; Section -&gt; (Path, Path, Int, Int)`` &#x7684;&#x8A71;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x90A3;&#x9EBC;&#x505A;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x6574;&#x6578;&#x578B;&#x5225;&#x4EE3;&#x8868; A &#x8DDF; B &#x4E0A;&#x7684;&#x6700;&#x5C0F;&#x6210;&#x672C;&#x3002;
</code></pre>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x6709;&#x4E86;&#x4E00;&#x500B;&#x51FD;&#x6578;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x5C0D;&#x8DEF;&#x5F91;&#x8DDF;&#x4E00;&#x500B; section&#xFF0C;&#x4E26;&#x7522;&#x751F;&#x65B0;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x500B; left fold &#x4F86;&#x505A;&#x3002;&#x6211;&#x5011;&#x7528; <code>([],[])</code> &#x8DDF;&#x7B2C;&#x4E00;&#x500B; section &#x4F86;&#x9935;&#x7D66; <code>roadStep</code> &#x4E26;&#x5F97;&#x5230;&#x4E00;&#x5C0D;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x3002;&#x7136;&#x5F8C;&#x4ED6;&#x53C8;&#x88AB;&#x9935;&#x7D66;&#x9019;&#x500B;&#x65B0;&#x5F97;&#x5230;&#x7684;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x8DDF;&#x4E0B;&#x4E00;&#x500B; section&#x3002;&#x4EE5;&#x6B64;&#x985E;&#x63A8;&#x3002;&#x7576;&#x6211;&#x5011;&#x8D70;&#x904E;&#x5168;&#x90E8;&#x7684; section &#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x5011;&#x5C31;&#x6703;&#x5F97;&#x5230;&#x4E00;&#x5C0D;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x6BD4;&#x8F03;&#x77ED;&#x7684;&#x90A3;&#x500B;&#x5C31;&#x662F;&#x89E3;&#x7B54;&#x3002;&#x6709;&#x4E86;&#x9019;&#x6A23;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x5011;&#x4FBF;&#x53EF;&#x4EE5;&#x5BE6;&#x4F5C; <code>optimalPath</code>&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">optimalPath</span> :: <span class="hljs-type">RoadSystem</span> -&gt; <span class="hljs-type">Path</span>  
<span class="hljs-title">optimalPath</span> roadSystem = 
    <span class="hljs-keyword">let</span> (bestAPath, bestBPath) = foldl roadStep ([],[]) roadSystem  
    <span class="hljs-keyword">in</span>  <span class="hljs-keyword">if</span> sum (map snd bestAPath) &lt;= sum (map snd bestBPath)  
                <span class="hljs-keyword">then</span> reverse bestAPath  
                <span class="hljs-keyword">else</span> reverse bestBPath
</code></pre>
<p>&#x6211;&#x5011;&#x5C0D; <code>roadSystem</code> &#x505A; left fold&#x3002;&#x800C;&#x7528;&#x7684;&#x8D77;&#x59CB; accumulator &#x662F;&#x4E00;&#x5C0D;&#x7A7A;&#x7684;&#x8DEF;&#x5F91;&#x3002;fold &#x7684;&#x7D50;&#x679C;&#x4E5F;&#x662F;&#x4E00;&#x5C0D;&#x8DEF;&#x5F91;&#xFF0C;&#x6211;&#x5011;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x628A;&#x8DEF;&#x5F91;&#x5F9E;&#x7D50;&#x679C;&#x53D6;&#x51FA;&#x3002;&#x7136;&#x5F8C;&#x6211;&#x5011;&#x6AA2;&#x67E5;&#x54EA;&#x4E00;&#x500B;&#x8DEF;&#x5F91;&#x6BD4;&#x8F03;&#x77ED;&#x4FBF;&#x56DE;&#x50B3;&#x4ED6;&#x3002;&#x800C;&#x4E14;&#x5728;&#x56DE;&#x50B3;&#x4E4B;&#x524D;&#x4E5F;&#x9806;&#x4FBF;&#x628A;&#x6574;&#x500B;&#x7D50;&#x679C;&#x53CD;&#x904E;&#x4F86;&#x3002;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x5148;&#x524D;&#x63D0;&#x5230;&#x7684;&#x6211;&#x5011;&#x662F;&#x7528;&#x63A5;&#x5728;&#x524D;&#x982D;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x69CB;&#x9020;&#x7D50;&#x679C;&#x7684;&#x3002;</p>
<p>&#x6211;&#x5011;&#x4F86;&#x6E2C;&#x8A66;&#x4E00;&#x4E0B;&#x5427;&#xFF01;</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; optimalPath heathrowToLondon  
[(<span class="hljs-type">B</span>,<span class="hljs-number">10</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">30</span>),(<span class="hljs-type">A</span>,<span class="hljs-number">5</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">20</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">2</span>),(<span class="hljs-type">B</span>,<span class="hljs-number">8</span>),(<span class="hljs-type">C</span>,<span class="hljs-number">0</span>)]
</code></pre>
<p>&#x9019;&#x6B63;&#x662F;&#x6211;&#x5011;&#x61C9;&#x8A72;&#x5F97;&#x5230;&#x7684;&#x7D50;&#x679C;&#xFF01;&#x4E0D;&#x904E;&#x8DDF;&#x6211;&#x5011;&#x9810;&#x671F;&#x7684;&#x7D50;&#x679C;&#x4ECD;&#x6709;&#x9EDE;&#x5DEE;&#x7570;&#xFF0C;&#x5728;&#x6700;&#x5F8C;&#x6709;&#x4E00;&#x6B65; <code>(C,0)</code>&#xFF0C;&#x90A3;&#x4EE3;&#x8868;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x5728;&#x502B;&#x6566;&#x4E86;&#x4ECD;&#x7136;&#x8DE8;&#x8D8A;&#x5C0F;&#x8DEF;&#x3002;&#x4E0D;&#x904E;&#x7531;&#x65BC;&#x4ED6;&#x7684;&#x6210;&#x672C;&#x662F; 0&#xFF0C;&#x6240;&#x4EE5;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x7B97;&#x505A;&#x6B63;&#x78BA;&#x7684;&#x7D50;&#x679C;&#x3002;</p>
<p>&#x6211;&#x5011;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x8DEF;&#x5F91;&#x7684;&#x51FD;&#x6578;&#xFF0C;&#x73FE;&#x5728;&#x8981;&#x505A;&#x7684;&#x53EA;&#x9700;&#x8981;&#x5F9E;&#x6A19;&#x6E96;&#x8F38;&#x5165;&#x8B80;&#x53D6;&#x6587;&#x5B57;&#x5F62;&#x5F0F;&#x9053;&#x8DEF;&#x7CFB;&#x7D71;&#xFF0C;&#x4E26;&#x628A;&#x4ED6;&#x8F49;&#x6210; <code>RoadSystem</code>&#xFF0C;&#x7136;&#x5F8C;&#x7528; <code>optimalPath</code> &#x4F86;&#x628A;&#x4ED6;&#x8DD1;&#x4E00;&#x904D;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x5011;&#x5BEB;&#x4E00;&#x500B;&#x51FD;&#x6578;&#xFF0C;&#x4ED6;&#x63A5;&#x53D7;&#x4E00;&#x4E32; list &#x4E26;&#x628A;&#x4ED6;&#x5207;&#x6210;&#x540C;&#x6A23;&#x5927;&#x5C0F;&#x7684; group&#x3002;&#x6211;&#x5011;&#x547D;&#x540D;&#x4ED6;&#x70BA; <code>groupOf</code>&#x3002;&#x7576;&#x53C3;&#x6578;&#x662F; <code>[1..10]</code> &#x6642;&#xFF0C;<code>groupOf 3</code> &#x61C9;&#x8A72;&#x56DE;&#x50B3; <code>[[1,2,3],[4,5,6],[7,8,9],[10]]</code>&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-title">groupsOf</span> :: <span class="hljs-type">Int</span> -&gt; [a] -&gt; [[a]]  
<span class="hljs-title">groupsOf</span> <span class="hljs-number">0</span> _ = undefined  
<span class="hljs-title">groupsOf</span> _ [] = []  
<span class="hljs-title">groupsOf</span> n xs = take n xs : groupsOf n (drop n xs)
</code></pre>
<p>&#x4E00;&#x500B;&#x6A19;&#x6E96;&#x7684;&#x905E;&#x8FF4;&#x51FD;&#x6578;&#x3002;&#x5C0D;&#x65BC; <code>xs</code> &#x7B49;&#x65BC; <code>[1..10]</code> &#x4E14; <code>n</code> &#x7B49;&#x65BC; <code>3</code>&#xFF0C;&#x9019;&#x53EF;&#x4EE5;&#x5BEB;&#x6210; <code>[1,2,3] : groupsOf 3 [4,5,6,7,8,9,10]</code>&#x3002;&#x7576;&#x9019;&#x500B;&#x905E;&#x8FF4;&#x7D50;&#x675F;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x5011;&#x7684; list &#x5C31;&#x4E09;&#x500B;&#x4E09;&#x500B;&#x5206;&#x597D;&#x7D44;&#x3002;&#x800C;&#x4E0B;&#x5217;&#x662F;&#x6211;&#x5011;&#x7684; <code>main</code> &#x51FD;&#x6578;&#xFF0C;&#x4ED6;&#x5F9E;&#x6A19;&#x6E96;&#x8F38;&#x5165;&#x8B80;&#x53D6;&#x8CC7;&#x6599;&#xFF0C;&#x69CB;&#x9020; <code>RoadSystem</code> &#x4E26;&#x5370;&#x51FA;&#x6700;&#x77ED;&#x8DEF;&#x5F91;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-keyword">import</span> Data.List  

<span class="hljs-title">main</span> = <span class="hljs-keyword">do</span>  
    contents &lt;- getContents  
    <span class="hljs-keyword">let</span> threes = groupsOf <span class="hljs-number">3</span> (map read $ lines contents)  
        roadSystem = map (\[a,b,c] -&gt; <span class="hljs-type">Section</span> a b c) threes  
        path = optimalPath roadSystem  
        pathString = concat $ map (show . fst) path  
        pathPrice = sum $ map snd path  
    putStrLn $ <span class="hljs-string">&quot;The best path to take is: &quot;</span> ++ pathString  
    putStrLn $ <span class="hljs-string">&quot;The price is: &quot;</span> ++ show pathPrice
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x5011;&#x5F9E;&#x6A19;&#x6E96;&#x8F38;&#x5165;&#x7372;&#x53D6;&#x6240;&#x6709;&#x7684;&#x8CC7;&#x6599;&#x3002;&#x7136;&#x5F8C;&#x6211;&#x5011;&#x547C;&#x53EB; <code>lines</code> &#x4F86;&#x628A; <code>&quot;50\n10\n30\n...</code> &#x8F49;&#x63DB;&#x6210; <code>[&quot;50&quot;,&quot;10&quot;,&quot;30&quot;..</code>&#xFF0C;&#x7136;&#x5F8C;&#x6211;&#x5011; map <code>read</code> &#x4F86;&#x628A;&#x9019;&#x4E9B;&#x8F49;&#x6210;&#x5305;&#x542B;&#x6578;&#x503C;&#x7684; list&#x3002;&#x6211;&#x5011;&#x547C;&#x53EB; <code>groupsOf 3</code> &#x4F86;&#x628A; list &#x7684; list&#xFF0C;&#x5176;&#x4E2D;&#x5B50; list &#x9577;&#x5EA6;&#x70BA; 3&#x3002;&#x6211;&#x5011;&#x63A5;&#x8457;&#x5C0D;&#x9019;&#x500B; list &#x4F86; map &#x4E00;&#x500B; lambda <code>(\[a,b,c] -&gt; Section a b c)</code>&#x3002;&#x6B63;&#x5982;&#x4F60;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x9019;&#x500B; lambda &#x63A5;&#x53D7;&#x4E00;&#x500B;&#x9577;&#x5EA6;&#x70BA; 3 &#x7684; list &#x7136;&#x5F8C;&#x628A;&#x4ED6;&#x8B8A;&#x6210; Section&#x3002;&#x6240;&#x4EE5; <code>roadSystem</code> &#x73FE;&#x5728;&#x5C31;&#x662F;&#x6211;&#x5011;&#x7684;&#x9053;&#x8DEF;&#x914D;&#x7F6E;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6B63;&#x78BA;&#x7684;&#x578B;&#x5225; <code>RoadSystem</code>&#x3002;&#x6211;&#x5011;&#x547C;&#x53EB; <code>optimalPath</code> &#x800C;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x8DEF;&#x5F91;&#x8DDF;&#x5C0D;&#x61C9;&#x7684;&#x4EE3;&#x50F9;&#xFF0C;&#x4E4B;&#x5F8C;&#x518D;&#x5370;&#x51FA;&#x4F86;&#x3002;</p>
<p>&#x6211;&#x5011;&#x5C07;&#x4E0B;&#x5217;&#x6587;&#x5B57;&#x5B58;&#x6210;&#x6A94;&#x6848;&#x3002;</p>
<pre><code class="lang-haskell"><span class="hljs-number">50</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">30</span>  
<span class="hljs-number">5</span>  
<span class="hljs-number">90</span>  
<span class="hljs-number">20</span>  
<span class="hljs-number">40</span>  
<span class="hljs-number">2</span>  
<span class="hljs-number">25</span>  
<span class="hljs-number">10</span>  
<span class="hljs-number">8</span>  
<span class="hljs-number">0</span>
</code></pre>
<p>&#x5B58;&#x6210;&#x4E00;&#x500B;&#x53EB; <code>paths.txt</code> &#x7684;&#x6A94;&#x6848;&#x7136;&#x5F8C;&#x9935;&#x7D66;&#x6211;&#x5011;&#x7684;&#x7A0B;&#x5F0F;&#x3002;</p>
<pre><code class="lang-haskell">$ cat paths.txt | runhaskell heathrow.hs  
<span class="hljs-type">The</span> best path to take is: <span class="hljs-type">BCACBBC</span>  
<span class="hljs-type">The</span> price is: <span class="hljs-number">75</span>
</code></pre>
<p>&#x57F7;&#x884C;&#x6210;&#x529F;&#xFF01;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4F60;&#x5C0D; <code>Data.Random</code> &#x7684;&#x77AD;&#x89E3;&#x4F86;&#x7522;&#x751F;&#x4E00;&#x500B;&#x6BD4;&#x8F03;&#x5927;&#x7684;&#x8DEF;&#x5F91;&#x914D;&#x7F6E;&#xFF0C;&#x7136;&#x5F8C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x7522;&#x751F;&#x7684;&#x4E82;&#x6578;&#x8CC7;&#x6599;&#x9935;&#x7D66;&#x4F60;&#x7684;&#x7A0B;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x78B0;&#x5230;&#x5806;&#x758A;&#x6EA2;&#x51FA;&#xFF0C;&#x8A66;&#x8A66;&#x770B;&#x7528; <code>foldl&apos;</code> &#x800C;&#x4E0D;&#x8981;&#x7528; <code>foldl</code>&#x3002;<code>foldl&apos;</code> &#x662F; strict &#x7684;&#x53EF;&#x4EE5;&#x6E1B;&#x5C11;&#x8A18;&#x61B6;&#x9AD4;&#x6D88;&#x8017;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9-input-and-output.html" class="navigation navigation-prev " aria-label="Previous page: Input and Output">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11-functors-applicative-functors-and-monoids.html" class="navigation navigation-next " aria-label="Next page: Functors, Applicative Functors 與 Monoids">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Functionally Solving Problems","level":"1.11","depth":1,"next":{"title":"Functors, Applicative Functors 與 Monoids","level":"1.12","depth":1,"path":"11-functors-applicative-functors-and-monoids.md","ref":"11-functors-applicative-functors-and-monoids.md","articles":[]},"previous":{"title":"Input and Output","level":"1.10","depth":1,"path":"9-input-and-output.md","ref":"9-input-and-output.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-tw","gitbook":"*"},"file":{"path":"10-functionally-solving-problems.md","mtime":"2020-12-03T17:01:40.724Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-03T17:01:59.781Z"},"basePath":".","book":{"language":"zh-tw"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

