
<!DOCTYPE HTML>
<html lang="zh-tw" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Recursion · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="6-high-order-function.html" />
    
    
    <link rel="prev" href="4-syntax-in-function.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    HASKELL 趣學指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-ready-go.html">
            
                <a href="2-ready-go.html">
            
                    
                    Ready Go
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-type-and-typeclass.html">
            
                <a href="3-type-and-typeclass.html">
            
                    
                    Type And Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-syntax-in-function.html">
            
                <a href="4-syntax-in-function.html">
            
                    
                    Syntax in Function
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="5-recursion.html">
            
                <a href="5-recursion.html">
            
                    
                    Recursion
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-high-order-function.html">
            
                <a href="6-high-order-function.html">
            
                    
                    High Order Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-module.html">
            
                <a href="7-module.html">
            
                    
                    Module
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-build-our-own-type-and-typeclass.html">
            
                <a href="8-build-our-own-type-and-typeclass.html">
            
                    
                    Build Our Own Type and Typeclass
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-input-and-output.html">
            
                <a href="9-input-and-output.html">
            
                    
                    Input and Output
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-functionally-solving-problems.html">
            
                <a href="10-functionally-solving-problems.html">
            
                    
                    Functionally Solving Problems
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-functors-applicative-functors-and-monoids.html">
            
                <a href="11-functors-applicative-functors-and-monoids.html">
            
                    
                    Functors, Applicative Functors 與 Monoids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-a-fistful-of-monads.html">
            
                <a href="12-a-fistful-of-monads.html">
            
                    
                    A Fistful of Monad
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-for-a-few-monads-more.html">
            
                <a href="13-for-a-few-monads-more.html">
            
                    
                    For a Few Monad More
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-zippers.html">
            
                <a href="14-zippers.html">
            
                    
                    Zippers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    Resource
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Recursion</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x905E;&#x8FF4;">&#x905E;&#x8FF4;</h1>
<h2 id="&#x4F60;&#x597D;&#xFF0C;&#x905E;&#x8FF4;&#xFF01;">&#x4F60;&#x597D;&#xFF0C;&#x905E;&#x8FF4;&#xFF01;</h2>
<p><img src="img/recursion.png" alt=""></p>
<p>&#x524D;&#x9762;&#x7684;&#x7AE0;&#x7BC0;&#x4E2D;&#x6211;&#x5011;&#x7C21;&#x8981;&#x8AC7;&#x4E86;&#x4E00;&#x4E0B;&#x905E;&#x8FF4;&#x3002;&#x800C;&#x5728;&#x672C;&#x7AE0;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x6DF1;&#x5165;&#x5730;&#x77AD;&#x89E3;&#x5230;&#x5B83;&#x70BA;&#x4F55;&#x5728; Haskell &#x4E2D;&#x662F;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF0C;&#x80FD;&#x5920;&#x4EE5;&#x905E;&#x8FF4;&#x601D;&#x60F3;&#x5BEB;&#x51FA;&#x7C21;&#x6F54;&#x512A;&#x96C5;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x9084;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x9EBC;&#x662F;&#x905E;&#x8FF4;&#xFF0C;&#x5C31;&#x8B80;&#x9019;&#x500B;&#x53E5;&#x5B50;&#x3002;&#x54C8;&#x54C8;&#xFF01;&#x958B;&#x500B;&#x73A9;&#x7B11;&#x800C;&#x5DF2;&#xFF01;&#x905E;&#x8FF4;&#x5BE6;&#x969B;&#x4E0A;&#x662F;&#x5B9A;&#x7FA9;&#x51FD;&#x6578;&#x4EE5;&#x547C;&#x53EB;&#x81EA;&#x8EAB;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x6578;&#x5B78;&#x5B9A;&#x7FA9;&#x4E2D;&#xFF0C;&#x905E;&#x8FF4;&#x96A8;&#x8655;&#x53EF;&#x898B;&#xFF0C;&#x5982;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6578;&#x5217; &#xFF08;fibonacci&#xFF09;&#x3002;&#x5B83;&#x5148;&#x662F;&#x5B9A;&#x7FA9;&#x5169;&#x500B;&#x975E;&#x905E;&#x8FF4;&#x7684;&#x6578;&#xFF1A;<code>F(0)=0,F(1)=1</code>&#xFF0C;&#x8868;&#x793A;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6578;&#x5217;&#x7684;&#x524D;&#x5169;&#x500B;&#x6578;&#x70BA; 0 &#x548C; 1&#x3002;&#x7136;&#x5F8C;&#x5C31;&#x662F;&#x5C0D;&#x5176;&#x4ED6;&#x81EA;&#x7136;&#x6578;&#xFF0C;&#x5176;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6578;&#x5C31;&#x662F;&#x5B83;&#x524D;&#x9762;&#x5169;&#x500B;&#x6578;&#x5B57;&#x7684;&#x548C;&#xFF0C;&#x5373; <code>F(N)=F(N-1)+F(N-2)</code>&#x3002;&#x9019;&#x6A23;&#x4E00;&#x4F86;&#xFF0C;<code>F(3)</code> &#x5C31;&#x662F; <code>F(2)+F(1)</code>&#xFF0C;&#x9032;&#x4E00;&#x6B65;&#x4FBF;&#x662F; <code>(F(1)+F(0))+F(1)</code>&#x3002;&#x5DF2;&#x7D93;&#x4E0B;&#x63A2;&#x5230;&#x4E86;&#x524D;&#x9762;&#x5B9A;&#x7FA9;&#x7684;&#x975E;&#x905E;&#x8FF4;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6578;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x5730;&#x8AAA; <code>F(3)</code> &#x5C31;&#x662F; 2 &#x4E86;&#x3002;&#x5728;&#x905E;&#x8FF4;&#x5B9A;&#x7FA9;&#x4E2D;&#x8072;&#x660E;&#x7684;&#x4E00;&#x5169;&#x500B;&#x975E;&#x905E;&#x8FF4;&#x7684;&#x503C;&#xFF08;&#x5982; <code>F(0)</code> &#x548C; <code>F(1)</code>&#xFF09; &#x4E5F;&#x53EF;&#x4EE5;&#x7A31;&#x4F5C;<em>&#x908A;&#x754C;&#x689D;&#x4EF6;</em>&#xFF0C;&#x9019;&#x5C0D;&#x905E;&#x8FF4;&#x51FD;&#x6578;&#x7684;&#x6B63;&#x78BA;&#x6C42;&#x503C;&#x81F3;&#x95DC;&#x91CD;&#x8981;&#x3002;&#x8981;&#x662F;&#x524D;&#x9762;&#x6C92;&#x6709;&#x5B9A;&#x7FA9; <code>F(0)</code> &#x548C; <code>F(1)</code> &#x7684;&#x8A71;&#xFF0C;&#x5B83;&#x4E0B;&#x63A2;&#x5230; 0 &#x4E4B;&#x5F8C;&#x5C31;&#x6703;&#x9032;&#x4E00;&#x6B65;&#x5230;&#x8CA0;&#x6578;&#xFF0C;&#x4F60;&#x5C31;&#x6C38;&#x9060;&#x90FD;&#x5F97;&#x4E0D;&#x5230;&#x7D50;&#x679C;&#x4E86;&#x3002;&#x4E00;&#x4E0D;&#x7559;&#x795E;&#x5B83;&#x5C31;&#x7B97;&#x5230;&#x4E86; <code>F(-2000)=F(-2001)+F(-2002)</code>&#xFF0C;&#x4E26;&#x4E14;&#x6C38;&#x9060;&#x90FD;&#x7B97;&#x4E0D;&#x5230;&#x982D;&#xFF01;</p>
<p>&#x905E;&#x8FF4;&#x5728; Haskell &#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B;&#x6C42;&#x89E3;&#x7684;&#x6B65;&#x9A5F;&#xFF0C;Haskell &#x5247;&#x50BE;&#x5411;&#x4E8E;&#x8B93;&#x4F60;&#x63D0;&#x4F9B;&#x554F;&#x984C;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x9019;&#x4FBF;&#x662F; Haskell &#x6C92;&#x6709; <code>while</code> &#x6216; <code>for</code> &#x5FAA;&#x74B0;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x905E;&#x8FF4;&#x662F;&#x6211;&#x5011;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x5BE6;&#x4F5C;-maximum">&#x5BE6;&#x4F5C; Maximum</h2>
<p><code>maximum</code> &#x51FD;&#x6578;&#x53D6;&#x4E00;&#x7D44;&#x53EF;&#x6392;&#x5E8F;&#x7684; List&#xFF08;&#x5C6C;&#x65BC; Ord Typeclass&#xFF09; &#x505A;&#x53C3;&#x6578;&#xFF0C;&#x4E26;&#x56DE;&#x50B3;&#x5176;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x60F3;&#x60F3;&#xFF0C;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x98A8;&#x683C;&#x4E2D;&#x9019;&#x4E00;&#x51FD;&#x6578;&#x8A72;&#x600E;&#x9EBC;&#x5BE6;&#x73FE;&#x3002;&#x5F88;&#x53EF;&#x80FD;&#x4F60;&#x6703;&#x8A2D;&#x4E00;&#x500B;&#x8B8A;&#x6578;&#x4F86;&#x5B58;&#x5132;&#x7576;&#x524D;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x7136;&#x5F8C;&#x7528;&#x5FAA;&#x74B0;&#x904D;&#x6B77;&#x8A72; List&#xFF0C;&#x82E5;&#x5B58;&#x5728;&#x6BD4;&#x9019;&#x500B;&#x503C;&#x66F4;&#x5927;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5247;&#x4FEE;&#x6539;&#x8B8A;&#x6578;&#x70BA;&#x9019;&#x4E00;&#x5143;&#x7D20;&#x7684;&#x503C;&#x3002;&#x5230;&#x6700;&#x5F8C;&#xFF0C;&#x8B8A;&#x6578;&#x7684;&#x503C;&#x5C31;&#x662F;&#x904B;&#x7B97;&#x7D50;&#x679C;&#x3002;&#x5514;&#xFF01;&#x63CF;&#x8FF0;&#x5982;&#x6B64;&#x7C21;&#x55AE;&#x7684;&#x7B97;&#x6CD5;&#x9084;&#x9817;&#x8CBB;&#x4E86;&#x9EDE;&#x53E3;&#x820C;&#x5462;&#xFF01;</p>
<p>&#x73FE;&#x5728;&#x770B;&#x770B;&#x905E;&#x8FF4;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5982;&#x4F55;&#xFF1A;&#x6211;&#x5011;&#x5148;&#x5B9A;&#x4E0B;&#x4E00;&#x500B;&#x908A;&#x754C;&#x689D;&#x4EF6;&#xFF0C;&#x5373;&#x8655;&#x7406;&#x55AE;&#x500B;&#x5143;&#x7D20;&#x7684; List &#x6642;&#xFF0C;&#x56DE;&#x50B3;&#x8A72;&#x5143;&#x7D20;&#x3002;&#x5982;&#x679C;&#x8A72; List &#x7684;&#x982D;&#x90E8;&#x5927;&#x65BC;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6211;&#x5011;&#x5C31;&#x53EF;&#x4EE5;&#x5047;&#x5B9A;&#x8F03;&#x9577;&#x7684; List &#x7684;&#x6700;&#x5927;&#x503C;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x982D;&#x90E8;&#x3002;&#x800C;&#x5C3E;&#x90E8;&#x82E5;&#x5B58;&#x5728;&#x6BD4;&#x5B83;&#x66F4;&#x5927;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x5C31;&#x9019;&#x9EBC;&#x7C21;&#x55AE;&#xFF01;&#x73FE;&#x5728;&#xFF0C;&#x6211;&#x5011;&#x5728; Haskell &#x4E2D;&#x5BE6;&#x73FE;&#x5B83;</p>
<pre><code class="lang-haskell"><span class="hljs-title">maximum&apos;</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; a  
<span class="hljs-title">maximum&apos;</span> [] = error <span class="hljs-string">&quot;maximum of empty list&quot;</span>  
<span class="hljs-title">maximum&apos;</span> [x] = x  
<span class="hljs-title">maximum&apos;</span> (x:xs)   
    | x &gt; maxTail = x  
    | otherwise = maxTail  
    <span class="hljs-keyword">where</span> maxTail = maximum&apos; xs
</code></pre>
<p>&#x5982;&#x4F60;&#x6240;&#x898B;&#xFF0C;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x8207;&#x905E;&#x8FF4;&#x7C21;&#x76F4;&#x5C31;&#x662F;&#x5929;&#x9020;&#x5730;&#x8A2D;&#xFF01;&#x5927;&#x591A;&#x6578;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#x90FD;&#x6C92;&#x6709;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x65BC;&#x662F;&#x4F60;&#x5C31;&#x5F97;&#x9020;&#x4E00;&#x5806; if-else &#x4F86;&#x6E2C;&#x8A66;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x3002;&#x800C;&#x5728;&#x9019;&#x88E1;&#xFF0C;&#x6211;&#x5011;&#x50C5;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5C07;&#x5176;&#x8868;&#x793A;&#x51FA;&#x4F86;&#x3002;&#x7B2C;&#x4E00;&#x500B;&#x6A21;&#x5F0F;&#x8AAA;&#xFF0C;&#x5982;&#x679C;&#x8A72; List &#x70BA;&#x7A7A;&#xFF0C;&#x5D29;&#x6F70;&#xFF01;&#x5C31;&#x8A72;&#x9019;&#x6A23;&#xFF0C;&#x4E00;&#x500B;&#x7A7A; List &#x7684;&#x6700;&#x5927;&#x503C;&#x80FD;&#x662F;&#x5565;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x7B2C;&#x4E8C;&#x500B;&#x6A21;&#x5F0F;&#x4E5F;&#x8868;&#x793A;&#x4E00;&#x500B;&#x908A;&#x7DE3;&#x689D;&#x4EF6;&#xFF0C;&#x5B83;&#x8AAA;&#xFF0C; &#x5982;&#x679C;&#x9019;&#x500B; List &#x50C5;&#x5305;&#x542B;&#x55AE;&#x500B;&#x5143;&#x7D20;&#xFF0C;&#x5C31;&#x56DE;&#x50B3;&#x8A72;&#x5143;&#x7D20;&#x7684;&#x503C;&#x3002;</p>
<p>&#x73FE;&#x5728;&#x662F;&#x7B2C;&#x4E09;&#x500B;&#x6A21;&#x5F0F;&#xFF0C;&#x57F7;&#x884C;&#x52D5;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#x3002; &#x901A;&#x904E;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x4E00;&#x500B; List &#x7684;&#x982D;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#x3002;&#x9019;&#x5728;&#x4F7F;&#x7528;&#x905E;&#x8FF4;&#x8655;&#x7406; List &#x6642;&#x662F;&#x5341;&#x5206;&#x5E38;&#x898B;&#x7684;&#x3002;&#x51FA;&#x65BC;&#x7FD2;&#x6163;&#xFF0C;&#x6211;&#x5011;&#x7528;&#x500B; <code>where</code> &#x8A9E;&#x53E5;&#x4F86;&#x8868;&#x793A; <code>maxTail</code> &#x4F5C;&#x70BA;&#x8A72; List &#x4E2D;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x7136;&#x5F8C;&#x6AA2;&#x67E5;&#x982D;&#x90E8;&#x662F;&#x5426;&#x5927;&#x65BC;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x82E5;&#x662F;&#xFF0C;&#x56DE;&#x50B3;&#x982D;&#x90E8;&#xFF1B;&#x82E5;&#x975E;&#xFF0C;&#x56DE;&#x50B3;&#x5C3E;&#x90E8;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<p>&#x6211;&#x5011;&#x53D6;&#x500B; List <code>[2,5,1]</code> &#x505A;&#x4F8B;&#x5B50;&#x4F86;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x7576;&#x547C;&#x53EB; <code>maximum&apos;</code> &#x8655;&#x7406;&#x5B83;&#x6642;&#xFF0C;&#x524D;&#x5169;&#x500B;&#x6A21;&#x5F0F;&#x4E0D;&#x6703;&#x88AB;&#x5339;&#x914D;&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x500B;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E86;&#x5B83;&#x4E26;&#x5C07;&#x5176;&#x5206;&#x70BA; <code>2</code> &#x8207; <code>[5,1]</code>&#x3002; <code>where</code> &#x5B50;&#x53E5;&#x518D;&#x53D6; <code>[5,1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x65BC;&#x662F;&#x518D;&#x6B21;&#x8207;&#x7B2C;&#x4E09;&#x500B;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x4E26;&#x5C07; <code>[5,1]</code> &#x5206;&#x5272;&#x70BA; <code>5</code> &#x548C; <code>[1]</code>&#x3002;&#x7E7C;&#x7E8C;&#xFF0C;<code>where</code> &#x5B50;&#x53E5;&#x53D6; <code>[1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x9019;&#x6642;&#x7D42;&#x65BC;&#x5230;&#x4E86;&#x908A;&#x7DE3;&#x689D;&#x4EF6;&#xFF01;&#x56DE;&#x50B3; <code>1</code>&#x3002;&#x9032;&#x4E00;&#x6B65;&#xFF0C;&#x5C07; <code>5</code> &#x8207; <code>[1]</code> &#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x505A;&#x6BD4;&#x8F03;&#xFF0C;&#x6613;&#x5F97; <code>5</code>&#xFF0C;&#x73FE;&#x5728;&#x6211;&#x5011;&#x5C31;&#x5F97;&#x5230;&#x4E86; <code>[5,1]</code> &#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x518D;&#x9032;&#x4E00;&#x6B65;&#xFF0C;&#x5C07; <code>2</code> &#x8207; <code>[5,1]</code> &#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x76F8;&#x6BD4;&#x8F03;&#xFF0C;&#x53EF;&#x5F97; <code>5</code> &#x66F4;&#x5927;&#xFF0C;&#x6700;&#x7D42;&#x5F97; <code>5</code>&#x3002;</p>
<p>&#x6539;&#x7528; <code>max</code> &#x51FD;&#x6578;&#x6703;&#x4F7F;&#x7A0B;&#x5F0F;&#x78BC;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9084;&#x8A18;&#x5F97;&#xFF0C;<code>max</code> &#x51FD;&#x6578;&#x53D6;&#x5169;&#x500B;&#x503C;&#x505A;&#x53C3;&#x6578;&#x4E26;&#x56DE;&#x50B3;&#x5176;&#x4E2D;&#x8F03;&#x5927;&#x7684;&#x503C;&#x3002;&#x5982;&#x4E0B;&#x4FBF;&#x662F;&#x7528; <code>max</code> &#x51FD;&#x6578;&#x91CD;&#x5BEB;&#x7684; <code>maximun&apos;</code></p>
<pre><code class="lang-haskell"><span class="hljs-title">maximum&apos;</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; a  
<span class="hljs-title">maximum&apos;</span> [] = error <span class="hljs-string">&quot;maximum of empty list&quot;</span>  
<span class="hljs-title">maximum&apos;</span> [x] = x  
<span class="hljs-title">maximum&apos;</span> (x:xs) = max x (maximum&apos; xs)
</code></pre>
<p>&#x592A;&#x6F02;&#x4EAE;&#x4E86;&#xFF01;&#x4E00;&#x500B; List &#x7684;&#x6700;&#x5927;&#x503C;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x9996;&#x500B;&#x5143;&#x7D20;&#x8207;&#x5B83;&#x5C3E;&#x90E8;&#x4E2D;&#x6700;&#x5927;&#x503C;&#x76F8;&#x6BD4;&#x8F03;&#x6240;&#x5F97;&#x7684;&#x7D50;&#x679C;&#xFF0C;&#x7C21;&#x660E;&#x627C;&#x8981;&#x3002;</p>
<p><img src="img/maxs.png" alt=""></p>
<h2 id="&#x4F86;&#x770B;&#x5E7E;&#x500B;&#x905E;&#x8FF4;&#x51FD;&#x6578;">&#x4F86;&#x770B;&#x5E7E;&#x500B;&#x905E;&#x8FF4;&#x51FD;&#x6578;</h2>
<p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x77AD;&#x89E3;&#x4E86;&#x905E;&#x8FF4;&#x7684;&#x601D;&#x8DEF;,&#x63A5;&#x4E0B;&#x4F86;&#x5C31;&#x4F7F;&#x7528;&#x905E;&#x8FF4;&#x4F86;&#x5BE6;&#x73FE;&#x5E7E;&#x500B;&#x51FD;&#x6578;. &#x5148;&#x5BE6;&#x73FE;&#x4E0B; <code>replicate</code> &#x51FD;&#x6578;, &#x5B83;&#x53D6;&#x4E00;&#x500B; <code>Int</code> &#x503C;&#x548C;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x505A;&#x53C3;&#x6578;, &#x56DE;&#x50B3;&#x4E00;&#x500B;&#x5305;&#x542B;&#x591A;&#x500B;&#x91CD;&#x8907;&#x5143;&#x7D20;&#x7684; List, &#x5982; <code>replicate 3 5</code> &#x56DE;&#x50B3; <code>[5,5,5]</code>. &#x8003;&#x616E;&#x4E00;&#x4E0B;, &#x6211;&#x89BA;&#x5F97;&#x5B83;&#x7684;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x61C9;&#x8A72;&#x662F;&#x8CA0;&#x6578;. &#x5982;&#x679C;&#x8981; <code>replicate</code> &#x91CD;&#x8907;&#x67D0;&#x5143;&#x7D20;&#x96F6;&#x6B21;, &#x90A3;&#x5C31;&#x662F;&#x7A7A; List. &#x8CA0;&#x6578;&#x4E5F;&#x662F;&#x540C;&#x6A23;, &#x4E0D;&#x9760;&#x8B5C;.</p>
<pre><code class="lang-haskell"><span class="hljs-title">replicate&apos;</span> :: (<span class="hljs-type">Num</span> i, <span class="hljs-type">Ord</span> i) =&gt; i -&gt; a -&gt; [a]  
<span class="hljs-title">replicate&apos;</span> n x  
    | n &lt;= <span class="hljs-number">0</span>    = []  
    | otherwise = x:replicate&apos; (n<span class="hljs-number">-1</span>) x
</code></pre>
<p>&#x5728;&#x9019;&#x88E1;&#x6211;&#x5011;&#x4F7F;&#x7528;&#x4E86; guard &#x800C;&#x975E;&#x6A21;&#x5F0F;&#x5339;&#x914D;, &#x662F;&#x56E0;&#x70BA;&#x9019;&#x88E1;&#x505A;&#x7684;&#x662F;&#x5E03;&#x6797;&#x5224;&#x65B7;. &#x5982;&#x679C; <code>n</code> &#x5C0F;&#x65BC; 0 &#x5C31;&#x56DE;&#x50B3;&#x4E00;&#x500B;&#x7A7A; List, &#x5426;&#x5247;, &#x56DE;&#x50B3;&#x4EE5; <code>x</code> &#x4F5C;&#x9996;&#x500B;&#x5143;&#x7D20;&#x4E26;&#x5F8C;&#x63A5;&#x91CD;&#x8907; <code>n-1</code> &#x6B21; <code>x</code> &#x7684; List. &#x6700;&#x5F8C;, <code>(n-1)</code> &#x7684;&#x90A3;&#x90E8;&#x5206;&#x5C31;&#x6703;&#x4EE4;&#x51FD;&#x6578;&#x62B5;&#x9054;&#x908A;&#x7DE3;&#x689D;&#x4EF6;.</p>
<pre><code class="lang-text">*Note*: Num &#x4E0D;&#x662F; Ord &#x7684;&#x5B50;&#x96C6;, &#x8868;&#x793A;&#x6578;&#x5B57;&#x4E0D;&#x4E00;&#x5B9A;&#x5F97;&#x62D8;&#x6CE5;&#x4E8E;&#x6392;&#x5E8F;, &#x9019;&#x5C31;&#x662F;&#x5728;&#x505A;&#x52A0;&#x6E1B;&#x6CD5;&#x6BD4;&#x8F03;&#x6642;&#x8981;&#x5C07; Num &#x8207; Ord &#x578B;&#x5225;&#x7D04;&#x675F;&#x5340;&#x5225;&#x958B;&#x4F86;&#x7684;&#x539F;&#x56E0;.
</code></pre>
<p>&#x63A5;&#x4E0B;&#x4F86;&#x5BE6;&#x73FE; <code>take</code> &#x51FD;&#x6578;, &#x5B83;&#x53EF;&#x4EE5;&#x5F9E;&#x4E00;&#x500B; List &#x53D6;&#x51FA;&#x4E00;&#x5B9A;&#x6578;&#x91CF;&#x7684;&#x5143;&#x7D20;. &#x5982; <code>take 3 [5,4,3,2,1]</code>, &#x5F97; <code>[5,4,3]</code>. &#x82E5;&#x8981;&#x53D6;&#x96F6;&#x6216;&#x8CA0;&#x6578;&#x500B;&#x7684;&#x8A71;&#x5C31;&#x6703;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x7A7A; List. &#x540C;&#x6A23;, &#x82E5;&#x662F;&#x5F9E;&#x4E00;&#x500B;&#x7A7A; List&#x4E2D;&#x53D6;&#x503C;, &#x5B83;&#x6703;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x7A7A; List. &#x6CE8;&#x610F;, &#x9019;&#x5152;&#x6709;&#x5169;&#x500B;&#x908A;&#x754C;&#x689D;&#x4EF6;, &#x5BEB;&#x51FA;&#x4F86;:</p>
<pre><code class="lang-haskell"><span class="hljs-title">take&apos;</span> :: (<span class="hljs-type">Num</span> i, <span class="hljs-type">Ord</span> i) =&gt; i -&gt; [a] -&gt; [a]  
<span class="hljs-title">take&apos;</span> n _  
    | n &lt;= <span class="hljs-number">0</span>   = []  
<span class="hljs-title">take&apos;</span> _ []     = []  
<span class="hljs-title">take&apos;</span> n (x:xs) = x : take&apos; (n<span class="hljs-number">-1</span>) xs
</code></pre>
<p><img src="img/painter.png" alt=""></p>
<p>&#x9996;&#x500B;&#x6A21;&#x5F0F;&#x8FA8;&#x8A8D;&#x82E5;&#x70BA; 0 &#x6216;&#x8CA0;&#x6578;, &#x56DE;&#x50B3;&#x7A7A; List. &#x540C;&#x6642;&#x6CE8;&#x610F;&#x9019;&#x88E1;&#x7528;&#x4E86;&#x4E00;&#x500B; guard &#x537B;&#x6C92;&#x6709;&#x6307;&#x5B9A; <code>otherwise</code> &#x90E8;&#x5206;, &#x9019;&#x5C31;&#x8868;&#x793A; <code>n</code> &#x82E5;&#x5927;&#x65BC; 0, &#x6703;&#x8F49;&#x5165;&#x4E0B;&#x4E00;&#x6A21;&#x5F0F;. &#x7B2C;&#x4E8C;&#x500B;&#x6A21;&#x5F0F;&#x6307;&#x660E;&#x4E86;&#x82E5;&#x8A66;&#x5716;&#x5F9E;&#x4E00;&#x500B;&#x7A7A; List &#x4E2D;&#x53D6;&#x503C;, &#x5247;&#x56DE;&#x50B3;&#x7A7A; List. &#x7B2C;&#x4E09;&#x500B;&#x6A21;&#x5F0F;&#x5C07; List &#x5206;&#x5272;&#x70BA;&#x982D;&#x90E8;&#x548C;&#x5C3E;&#x90E8;, &#x7136;&#x5F8C;&#x8868;&#x660E;&#x5F9E;&#x4E00;&#x500B; List &#x4E2D;&#x53D6;&#x591A;&#x500B;&#x5143;&#x7D20;&#x7B49;&#x540C;&#x65BC;&#x4EE4; <code>x</code> &#x4F5C;&#x982D;&#x90E8;&#x5F8C;&#x63A5;&#x5F9E;&#x5C3E;&#x90E8;&#x53D6; <code>n-1</code> &#x500B;&#x5143;&#x7D20;&#x6240;&#x5F97;&#x7684; List. &#x5047;&#x5982;&#x6211;&#x5011;&#x8981;&#x5F9E; <code>[4,3,2,1]</code> &#x4E2D;&#x53D6; 3 &#x500B;&#x5143;&#x7D20;, &#x8A66;&#x7740;&#x5F9E;&#x7D19;&#x4E0A;&#x5BEB;&#x51FA;&#x5B83;&#x7684;&#x63A8;&#x5C0E;&#x904E;&#x7A0B;</p>
<p><code>reverse</code> &#x51FD;&#x6578;&#x7C21;&#x55AE;&#x5730;&#x53CD;&#x8F49;&#x4E00;&#x500B; List, &#x52D5;&#x8166;&#x7B4B;&#x60F3;&#x4E00;&#x4E0B;&#x5B83;&#x7684;&#x908A;&#x754C;&#x689D;&#x4EF6;! &#x8A72;&#x600E;&#x6A23;&#x5462;? &#x60F3;&#x60F3;...&#x662F;&#x7A7A; List! &#x7A7A; List &#x7684;&#x53CD;&#x8F49;&#x7D50;&#x679C;&#x9084;&#x662F;&#x5B83;&#x81EA;&#x5DF1;. Okay, &#x63A5;&#x4E0B;&#x4F86;&#x8A72;&#x600E;&#x9EBC;&#x8FA6;? &#x597D;&#x7684;, &#x4F60;&#x731C;&#x7684;&#x51FA;&#x4F86;. &#x82E5;&#x5C07;&#x4E00;&#x500B; List &#x5206;&#x5272;&#x70BA;&#x982D;&#x90E8;&#x8207;&#x5C3E;&#x90E8;, &#x90A3;&#x5B83;&#x53CD;&#x8F49;&#x7684;&#x7D50;&#x679C;&#x5C31;&#x662F;&#x53CD;&#x8F49;&#x5F8C;&#x7684;&#x5C3E;&#x90E8;&#x8207;&#x982D;&#x90E8;&#x76F8;&#x9023;&#x6240;&#x5F97;&#x7684; List.</p>
<pre><code class="lang-haskell"><span class="hljs-title">reverse&apos;</span> :: [a] -&gt; [a]  
<span class="hljs-title">reverse&apos;</span> [] = []  
<span class="hljs-title">reverse&apos;</span> (x:xs) = reverse&apos; xs ++ [x]
</code></pre>
<p>&#x7E7C;&#x7E8C;&#x4E0B;&#x53BB;!</p>
<p>Haskell &#x652F;&#x6301;&#x7121;&#x9650; List&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5011;&#x7684;&#x905E;&#x8FF4;&#x5C31;&#x4E0D;&#x5FC5;&#x6DFB;&#x52A0;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x3002;&#x9019;&#x6A23;&#x4E00;&#x4F86;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C0D;&#x67D0;&#x503C;&#x8A08;&#x7B97;&#x500B;&#x6C92;&#x5B8C;, &#x4E5F;&#x53EF;&#x4EE5;&#x7522;&#x751F;&#x4E00;&#x500B;&#x7121;&#x9650;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#xFF0C;&#x5982;&#x7121;&#x9650; List&#x3002;&#x800C;&#x7121;&#x9650; List &#x7684;&#x597D;&#x8655;&#x5C31;&#x5728;&#x65BC;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x5C07;&#x5B83;&#x65B7;&#x958B;.</p>
<p><code>repeat</code> &#x51FD;&#x6578;&#x53D6;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x4F5C;&#x53C3;&#x6578;, &#x56DE;&#x50B3;&#x4E00;&#x500B;&#x50C5;&#x5305;&#x542B;&#x8A72;&#x5143;&#x7D20;&#x7684;&#x7121;&#x9650; List. &#x5B83;&#x7684;&#x905E;&#x8FF4;&#x5BE6;&#x73FE;&#x7C21;&#x55AE;&#x7684;&#x5F88;, &#x770B;:</p>
<pre><code class="lang-haskell"><span class="hljs-title">repeat&apos;</span> :: a -&gt; [a]  
<span class="hljs-title">repeat&apos;</span> x = x:repeat&apos; x
</code></pre>
<p>&#x547C;&#x53EB; <code>repeat 3</code> &#x6703;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x4EE5; 3 &#x70BA;&#x982D;&#x90E8;&#x4E26;&#x7121;&#x9650;&#x6578;&#x91CF;&#x7684; 3 &#x70BA;&#x5C3E;&#x90E8;&#x7684; List, &#x53EF;&#x4EE5;&#x8AAA; <code>repeat 3</code> &#x904B;&#x884C;&#x8D77;&#x4F86;&#x5C31;&#x662F; <code>3:repeat 3</code> , &#x7136;&#x5F8C; <code>3:3:3:3</code> &#x7B49;&#x7B49;. &#x82E5;&#x57F7;&#x884C; <code>repeat 3</code>, &#x90A3;&#x5B83;&#x7684;&#x904B;&#x7B97;&#x6C38;&#x9060;&#x90FD;&#x4E0D;&#x6703;&#x505C;&#x6B62;&#x3002;&#x800C; <code>take 5 (repeat 3)</code> &#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230; 5 &#x500B; 3, &#x8207; <code>replicate 5 3</code> &#x5DEE;&#x4E0D;&#x591A;.</p>
<p><code>zip</code> &#x53D6;&#x5169;&#x500B; List &#x4F5C;&#x53C3;&#x6578;&#x4E26;&#x5C07;&#x5176;&#x6346;&#x5728;&#x4E00;&#x8D77;&#x3002;<code>zip [1,2,3] [2,3]</code> &#x56DE;&#x50B3; <code>[(1,2),(2,3)]</code>, &#x5B83;&#x6703;&#x628A;&#x8F03;&#x9577;&#x7684; List &#x5F9E;&#x4E2D;&#x9593;&#x65B7;&#x958B;, &#x4EE5;&#x5339;&#x914D;&#x8F03;&#x77ED;&#x7684; List. &#x7528; <code>zip</code> &#x8655;&#x7406;&#x4E00;&#x500B; List &#x8207;&#x7A7A; List &#x53C8;&#x6703;&#x600E;&#x6A23;? &#x55EF;, &#x6703;&#x5F97;&#x4E00;&#x500B;&#x7A7A; List, &#x9019;&#x4FBF;&#x662F;&#x6211;&#x5011;&#x7684;&#x9650;&#x5236;&#x689D;&#x4EF6;, &#x7531;&#x65BC; <code>zip</code> &#x53D6;&#x5169;&#x500B;&#x53C3;&#x6578;, &#x6240;&#x4EE5;&#x8981;&#x6709;&#x5169;&#x500B;&#x908A;&#x7DE3;&#x689D;&#x4EF6;</p>
<pre><code class="lang-haskell"><span class="hljs-title">zip&apos;</span> :: [a] -&gt; [b] -&gt; [(a,b)]  
<span class="hljs-title">zip&apos;</span> _ [] = []  
<span class="hljs-title">zip&apos;</span> [] _ = []  
<span class="hljs-title">zip&apos;</span> (x:xs) (y:ys) = (x,y):zip&apos; xs ys
</code></pre>
<p>&#x524D;&#x5169;&#x500B;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x5169;&#x500B; List &#x4E2D;&#x82E5;&#x5B58;&#x5728;&#x7A7A; List, &#x5247;&#x56DE;&#x50B3;&#x7A7A; List. &#x7B2C;&#x4E09;&#x500B;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x5C07;&#x5169;&#x500B; List &#x6346;&#x7D81;&#x7684;&#x884C;&#x70BA;, &#x5373;&#x5C07;&#x5176;&#x982D;&#x90E8;&#x914D;&#x5C0D;&#x4E26;&#x5F8C;&#x8DDF;&#x6346;&#x7D81;&#x7684;&#x5C3E;&#x90E8;. &#x7528; <code>zip</code> &#x8655;&#x7406; <code>[1,2,3]</code> &#x8207; <code>[&apos;a&apos;,&apos;b&apos;]</code> &#x7684;&#x8A71;, &#x5C31;&#x6703;&#x5728; <code>[3]</code> &#x8207; <code>[]</code> &#x6642;&#x89F8;&#x53CA;&#x908A;&#x754C;&#x689D;&#x4EF6;, &#x5F97;&#x5230; <code>(1,&apos;a&apos;):(2,&apos;b&apos;):[]</code> &#x7684;&#x7D50;&#x679C;,&#x8207; <code>[(1,&apos;a&apos;),(2,&apos;b&apos;)]</code> &#x7B49;&#x50F9;.</p>
<p>&#x518D;&#x5BE6;&#x73FE;&#x4E00;&#x500B;&#x6A19;&#x6E96;&#x5EAB;&#x51FD;&#x6578; -- <code>elem</code>! &#x5B83;&#x53D6;&#x4E00;&#x500B;&#x5143;&#x7D20;&#x8207;&#x4E00;&#x500B; List &#x4F5C;&#x53C3;&#x6578;, &#x4E26;&#x6AA2;&#x6E2C;&#x8A72;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5305;&#x542B;&#x4E8E;&#x6B64; List. &#x800C;&#x908A;&#x7DE3;&#x689D;&#x4EF6;&#x5C31;&#x8207;&#x5927;&#x591A;&#x6578;&#x60C5;&#x6CC1;&#x76F8;&#x540C;, &#x7A7A; List. &#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x7A7A; List &#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x5143;&#x7D20;, &#x4FBF;&#x4E0D;&#x5FC5;&#x518D;&#x505A;&#x4EFB;&#x4F55;&#x5224;&#x65B7;</p>
<pre><code class="lang-haskell"><span class="hljs-title">elem&apos;</span> :: (<span class="hljs-type">Eq</span> a) =&gt; a -&gt; [a] -&gt; <span class="hljs-type">Bool</span>  
<span class="hljs-title">elem&apos;</span> a [] = <span class="hljs-type">False</span>  
<span class="hljs-title">elem&apos;</span> a (x:xs)  
    | a == x    = <span class="hljs-type">True</span>  
    | otherwise = a `elem&apos;` xs
</code></pre>
<p>&#x9019;&#x5F88;&#x7C21;&#x55AE;&#x660E;&#x77AD;&#x3002;&#x82E5;&#x982D;&#x90E8;&#x4E0D;&#x662F;&#x8A72;&#x5143;&#x7D20;, &#x5C31;&#x6AA2;&#x6E2C;&#x5C3E;&#x90E8;, &#x82E5;&#x70BA;&#x7A7A; List &#x5C31;&#x56DE;&#x50B3; <code>False</code>.</p>
<h2 id="&#x5FEB;&#x901F;&#x6392;&#x5E8F;">&quot;&#x5FEB;&#x901F;&quot;&#x6392;&#x5E8F;</h2>
<p><img src="img/quickman.png" alt=""></p>
<p>&#x5047;&#x5B9A;&#x6211;&#x5011;&#x6709;&#x4E00;&#x500B;&#x53EF;&#x6392;&#x5E8F;&#x7684; List, &#x5176;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x578B;&#x5225;&#x70BA; Ord Typeclass &#x7684;&#x6210;&#x54E1;. &#x73FE;&#x5728;&#x6211;&#x5011;&#x8981;&#x7D66;&#x5B83;&#x6392;&#x5E8F;! &#x6709;&#x500B;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x7684;&#x9177;, &#x5C31;&#x662F;&#x5FEB;&#x901F;&#x6392;&#x5E8F; (quick sort), &#x777F;&#x667A;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;. &#x5118;&#x7BA1;&#x5B83;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x8A9E;&#x8A00;&#x4E2D;&#x4E5F;&#x4E0D;&#x904E; 10 &#x884C;, &#x4F46;&#x5728; Haskell &#x4E0B;&#x908A;&#x8981;&#x66F4;&#x77ED;, &#x66F4;&#x6F02;&#x4EAE;, &#x513C;&#x7136;&#x5DF2;&#x7D93;&#x6210;&#x4E86; Haskell &#x7684;&#x62DB;&#x724C;&#x4E86;. &#x55EF;, &#x6211;&#x5011;&#x5728;&#x9019;&#x88E1;&#x4E5F;&#x5BE6;&#x73FE;&#x4E00;&#x4E0B;. &#x6216;&#x8A31;&#x6703;&#x986F;&#x5F97;&#x5F88;&#x4FD7;&#x6C23;, &#x56E0;&#x70BA;&#x6BCF;&#x500B;&#x4EBA;&#x90FD;&#x7528;&#x5B83;&#x4F86;&#x5C55;&#x793A; Haskell &#x7A76;&#x7ADF;&#x6709;&#x591A;&#x512A;&#x96C5;!</p>
<p>&#x5B83;&#x7684;&#x578B;&#x5225;&#x8072;&#x660E;&#x61C9;&#x70BA; <code>quicksort :: (Ord a) =&gt; [a] -&gt; [a]</code>, &#x6C92;&#x5565;&#x5947;&#x602A;&#x7684;. &#x908A;&#x754C;&#x689D;&#x4EF6;&#x5462;? &#x5982;&#x6599;&#xFF0C;&#x7A7A; List&#x3002;&#x6392;&#x904E;&#x5E8F;&#x7684;&#x7A7A; List &#x9084;&#x662F;&#x7A7A; List&#x3002;&#x63A5;&#x4E0B;&#x4F86;&#x4FBF;&#x662F;&#x7B97;&#x6CD5;&#x7684;&#x5B9A;&#x7FA9;&#xFF1A;<em>&#x6392;&#x904E;&#x5E8F;&#x7684; List &#x5C31;&#x662F;&#x4EE4;&#x6240;&#x6709;&#x5C0F;&#x65BC;&#x7B49;&#x65BC;&#x982D;&#x90E8;&#x7684;&#x5143;&#x7D20;&#x5728;&#x5148;(&#x5B83;&#x5011;&#x5DF2;&#x7D93;&#x6392;&#x904E;&#x4E86;&#x5E8F;), &#x5F8C;&#x8DDF;&#x5927;&#x65BC;&#x982D;&#x90E8;&#x7684;&#x5143;&#x7D20;(&#x5B83;&#x5011;&#x540C;&#x6A23;&#x5DF2;&#x7D93;&#x62CD;&#x904E;&#x4E86;&#x5E8F;)</em>&#x3002; &#x6CE8;&#x610F;&#x5B9A;&#x7FA9;&#x4E2D;&#x6709;&#x5169;&#x6B21;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x5F97;&#x905E;&#x8FF4;&#x5169;&#x6B21;&#xFF01;&#x540C;&#x6642;&#x4E5F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7B97;&#x6CD5;&#x5B9A;&#x7FA9;&#x7684;&#x52D5;&#x8A5E;&#x70BA;&quot;&#x662F;&quot;&#x4EC0;&#x9EBC;&#x800C;&#x975E;&quot;&#x505A;&quot;&#x9019;&#x500B;, &quot;&#x505A;&quot;&#x90A3;&#x500B;, &#x518D;&quot;&#x505A;&quot;&#x90A3;&#x500B;...&#x9019;&#x4FBF;&#x662F;&#x51FD;&#x6578;&#x5F0F;&#x7DE8;&#x7A0B;&#x4E4B;&#x7F8E;&#xFF01;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x5F9E; List &#x4E2D;&#x53D6;&#x5F97;&#x6BD4;&#x982D;&#x90E8;&#x5C0F;&#x7684;&#x90A3;&#x4E9B;&#x5143;&#x7D20;&#x5462;&#xFF1F;List Comprehension&#x3002;&#x597D;&#xFF0C;&#x52D5;&#x624B;&#x5BEB;&#x51FA;&#x9019;&#x500B;&#x51FD;&#x6578;&#xFF01;</p>
<pre><code class="lang-haskell"><span class="hljs-title">quicksort</span> :: (<span class="hljs-type">Ord</span> a) =&gt; [a] -&gt; [a]  
<span class="hljs-title">quicksort</span> [] = []  
<span class="hljs-title">quicksort</span> (x:xs) =  
  <span class="hljs-keyword">let</span> smallerSorted = quicksort [a | a &lt;- xs, a &lt;= x] 
      biggerSorted = quicksort [a | a &lt;- xs, a &gt; x]  
  <span class="hljs-keyword">in</span> smallerSorted ++ [x] ++ biggerSorted
</code></pre>
<p>&#x5C0F;&#x5C0F;&#x7684;&#x6E2C;&#x8A66;&#x4E00;&#x4E0B;, &#x770B;&#x770B;&#x7D50;&#x679C;&#x662F;&#x5426;&#x6B63;&#x78BA;~</p>
<pre><code class="lang-haskell"><span class="hljs-title">ghci</span>&gt; quicksort [<span class="hljs-number">10</span>,<span class="hljs-number">2</span>,<span class="hljs-number">5</span>,<span class="hljs-number">3</span>,<span class="hljs-number">1</span>,<span class="hljs-number">6</span>,<span class="hljs-number">7</span>,<span class="hljs-number">4</span>,<span class="hljs-number">2</span>,<span class="hljs-number">3</span>,<span class="hljs-number">4</span>,<span class="hljs-number">8</span>,<span class="hljs-number">9</span>]  
[<span class="hljs-number">1</span>,<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-number">3</span>,<span class="hljs-number">3</span>,<span class="hljs-number">4</span>,<span class="hljs-number">4</span>,<span class="hljs-number">5</span>,<span class="hljs-number">6</span>,<span class="hljs-number">7</span>,<span class="hljs-number">8</span>,<span class="hljs-number">9</span>,<span class="hljs-number">10</span>]  
<span class="hljs-title">ghci</span>&gt; quicksort <span class="hljs-string">&quot;the quick brown fox jumps over the lazy dog&quot;</span>  
<span class="hljs-string">&quot; abcdeeefghhijklmnoooopqrrsttuuvwxyz&quot;</span>
</code></pre>
<p>booyah! &#x5982;&#x6211;&#x6240;&#x8AAA;&#x7684;&#x4E00;&#x6A23;! &#x82E5;&#x7D66; <code>[5,1,9,4,6,7,3]</code> &#x6392;&#x5E8F;&#xFF0C;&#x9019;&#x500B;&#x7B97;&#x6CD5;&#x5C31;&#x6703;&#x53D6;&#x51FA;&#x5B83;&#x7684;&#x982D;&#x90E8;&#xFF0C;&#x5373; 5&#x3002; &#x5C07;&#x5176;&#x7F6E;&#x65BC;&#x5206;&#x5225;&#x6BD4;&#x5B83;&#x5927;&#x548C;&#x6BD4;&#x5B83;&#x5C0F;&#x7684;&#x5169;&#x500B; List &#x4E2D;&#x9593;&#xFF0C;&#x5F97; <code>[1,4,3] ++ [5] ++ [9,6,7]</code>, &#x6211;&#x5011;&#x4FBF;&#x77E5;&#x9053;&#x4E86;&#x7576;&#x6392;&#x5E8F;&#x7D50;&#x675F;&#x4E4B;&#x6642;&#xFF0C;5&#x6703;&#x5728;&#x7B2C;&#x56DB;&#x4F4D;&#xFF0C;&#x56E0;&#x70BA;&#x6709;3&#x500B;&#x6578;&#x6BD4;&#x5B83;&#x5C0F;&#x6BCF;&#xFF0C;&#x4E5F;&#x6709;&#x4E09;&#x500B;&#x6578;&#x6BD4;&#x5B83;&#x5927;&#x3002;&#x597D;&#x7684;&#xFF0C;&#x63A5;&#x7740;&#x6392; <code>[1,4,3]</code> &#x8207; <code>[9,6,7]</code>, &#x7D50;&#x679C;&#x5C31;&#x51FA;&#x4F86;&#x4E86;&#xFF01;&#x5C0D;&#x5B83;&#x5011;&#x7684;&#x6392;&#x5E8F;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x540C;&#x6A23;&#x7684;&#x51FD;&#x6578;&#xFF0C;&#x5C07;&#x5B83;&#x5011;&#x5206;&#x6210;&#x8A31;&#x591A;&#x5C0F;&#x584A;&#xFF0C;&#x6700;&#x7D42;&#x5230;&#x9054;&#x81E8;&#x754C;&#x689D;&#x4EF6;&#xFF0C;&#x5373;&#x7A7A; List &#x7D93;&#x6392;&#x5E8F;&#x4F9D;&#x7136;&#x70BA;&#x7A7A;&#xFF0C;&#x6709;&#x500B;&#x63D2;&#x5716;&#xFF1A;</p>
<p>&#x6A59;&#x8272;&#x7684;&#x90E8;&#x5206;&#x8868;&#x793A;&#x5DF2;&#x5B9A;&#x4F4D;&#x4E26;&#x4E0D;&#x518D;&#x79FB;&#x52D5;&#x7684;&#x5143;&#x7D20;&#x3002;&#x5F9E;&#x5DE6;&#x5230;&#x53F3;&#x770B;&#xFF0C;&#x4FBF;&#x662F;&#x4E00;&#x500B;&#x6392;&#x904E;&#x5E8F;&#x7684; List&#x3002;&#x5728;&#x9019;&#x88E1;&#x6211;&#x5011;&#x5C07;&#x6240;&#x6709;&#x5143;&#x7D20;&#x8207; <code>head</code> &#x4F5C;&#x6BD4;&#x8F03;&#xFF0C;&#x800C;&#x5BE6;&#x969B;&#x4E0A;&#x5C31;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x800C;&#x8A00;&#xFF0C;&#x9078;&#x64C7;&#x4EFB;&#x610F;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x88AB;&#x9078;&#x64C7;&#x7684;&#x5143;&#x7D20;&#x5C31;&#x88AB;&#x7A31;&#x4F5C;&#x9328; &#xFF08;<code>pivot</code>&#xFF09;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x5C0F;&#x65BC;&#x9328;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x5728;&#x6DFA;&#x7DA0;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5927;&#x65BC;&#x9328;&#x90FD;&#x5728;&#x6DF1;&#x7DA0;&#x90E8;&#x5206;&#xFF0C;&#x9019;&#x500B;&#x9EC3;&#x9EC3;&#x7684;&#x5761;&#x5C31;&#x8868;&#x793A;&#x4E86;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x57F7;&#x884C;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p><img src="img/quicksort.png" alt=""></p>
<h2 id="&#x7528;&#x905E;&#x8FF4;&#x4F86;&#x601D;&#x8003;">&#x7528;&#x905E;&#x8FF4;&#x4F86;&#x601D;&#x8003;</h2>
<p>&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x5BEB;&#x4E86;&#x4E0D;&#x5C11;&#x905E;&#x8FF4;&#x4E86;&#xFF0C;&#x4E5F;&#x8A31;&#x4F60;&#x5DF2;&#x7D93;&#x767C;&#x89BA;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x56FA;&#x5B9A;&#x6A21;&#x5F0F;&#xFF1A;&#x5148;&#x5B9A;&#x7FA9;&#x4E00;&#x500B;&#x908A;&#x754C;&#x689D;&#x4EF6;&#xFF0C;&#x518D;&#x5B9A;&#x7FA9;&#x500B;&#x51FD;&#x6578;&#xFF0C;&#x8B93;&#x5B83;&#x5F9E;&#x4E00;&#x5806;&#x5143;&#x7D20;&#x4E2D;&#x53D6;&#x4E00;&#x500B;&#x4E26;&#x505A;&#x9EDE;&#x4E8B;&#x60C5;&#x5F8C;&#xFF0C;&#x628A;&#x9918;&#x4E0B;&#x7684;&#x5143;&#x7D20;&#x91CD;&#x65B0;&#x4EA4;&#x7D66;&#x9019;&#x500B;&#x51FD;&#x6578;&#x3002; &#x9019;&#x4E00;&#x6A21;&#x5F0F;&#x5C0D; List&#x3001;Tree &#x7B49;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x90FD;&#x662F;&#x9069;&#x7528;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>sum</code> &#x51FD;&#x6578;&#x5C31;&#x662F;&#x4E00;&#x500B; List &#x982D;&#x90E8;&#x8207;&#x5176;&#x5C3E;&#x90E8;&#x7684; <code>sum</code> &#x7684;&#x548C;&#x3002;&#x4E00;&#x500B; List &#x7684;&#x7A4D;&#x4FBF;&#x662F;&#x8A72; List &#x7684;&#x982D;&#x8207;&#x5176;&#x5C3E;&#x90E8;&#x7684;&#x7A4D;&#x76F8;&#x4E58;&#x7684;&#x7A4D;&#xFF0C;&#x4E00;&#x500B; List &#x7684;&#x9577;&#x5EA6;&#x5C31;&#x662F; 1 &#x8207;&#x5176;&#x5C3E;&#x90E8;&#x9577;&#x5EA6;&#x7684;&#x548C;. &#x7B49;&#x7B49;</p>
<p><img src="img/brain.png" alt=""></p>
<p>&#x518D;&#x8005;&#x5C31;&#x662F;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x5C31;&#x662F;&#x70BA;&#x907F;&#x514D;&#x7A0B;&#x5E8F;&#x51FA;&#x932F;&#x800C;&#x8A2D;&#x7F6E;&#x7684;&#x4FDD;&#x8B77;&#x63AA;&#x65BD;&#xFF0C;&#x8655;&#x7406; List &#x6642;&#x7684;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x7A7A; List&#xFF0C;&#x800C;&#x8655;&#x7406; Tree &#x6642;&#x7684;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x5C31;&#x662F;&#x6C92;&#x6709;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x7BC0;&#x9EDE;&#x3002;</p>
<p>&#x8655;&#x7406;&#x6578;&#x5B57;&#x6642;&#x4E5F;&#x8207;&#x4E4B;&#x76F8;&#x4F3C;&#x3002;&#x51FD;&#x6578;&#x4E00;&#x822C;&#x90FD;&#x5F97;&#x63A5;&#x53D7;&#x4E00;&#x500B;&#x503C;&#x4E26;&#x4FEE;&#x6539;&#x5B83;&#x3002;&#x65E9;&#x4E9B;&#x6642;&#x5019;&#x6211;&#x5011;&#x7DE8;&#x5BEB;&#x904E;&#x4E00;&#x500B;&#x8A08;&#x7B97; Factorial &#x7684;&#x51FD;&#x6578;&#xFF0C;&#x5B83;&#x4FBF;&#x662F;&#x67D0;&#x6578;&#x8207;&#x5B83;&#x6E1B;&#x4E00;&#x7684; Factorial &#x6578;&#x7684;&#x7A4D;&#x3002;&#x8B93;&#x5B83;&#x4E58;&#x4EE5;&#x96F6;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#xFF0C; Factorial &#x6578;&#x53C8;&#x90FD;&#x662F;&#x975E;&#x8CA0;&#x6578;&#xFF0C;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x4FBF;&#x53EF;&#x4EE5;&#x5B9A;&#x70BA; 1&#xFF0C;&#x5373;&#x4E58;&#x6CD5;&#x7684;&#x55AE;&#x4F4D;&#x5143;&#x3002; &#x56E0;&#x70BA;&#x4EFB;&#x4F55;&#x6578;&#x4E58;&#x4EE5; 1 &#x7684;&#x7D50;&#x679C;&#x9084;&#x662F;&#x9019;&#x500B;&#x6578;&#x3002;&#x800C;&#x5728; <code>sum</code> &#x4E2D;&#xFF0C;&#x52A0;&#x6CD5;&#x7684;&#x55AE;&#x4F4D;&#x5143;&#x5C31;&#x662F; 0&#x3002;&#x5728;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x4E2D;&#xFF0C;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x548C;&#x55AE;&#x4F4D;&#x5143;&#x90FD;&#x662F;&#x7A7A; List&#xFF0C;&#x56E0;&#x70BA;&#x4EFB;&#x4E00; List &#x8207;&#x7A7A; List &#x76F8;&#x52A0;&#x7684;&#x7D50;&#x679C;&#x4F9D;&#x7136;&#x662F;&#x539F; List&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x905E;&#x8FF4;&#x4F86;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x6642;&#x61C9;&#x7576;&#x5148;&#x8003;&#x616E;&#x905E;&#x8FF4;&#x6703;&#x5728;&#x4EC0;&#x9EBC;&#x6A23;&#x7684;&#x689D;&#x4EF6;&#x4E0B;&#x4E0D;&#x53EF;&#x7528;, &#x7136;&#x5F8C;&#x518D;&#x627E;&#x51FA;&#x5B83;&#x7684;&#x908A;&#x754C;&#x689D;&#x4EF6;&#x548C;&#x55AE;&#x4F4D;&#x5143;, &#x8003;&#x616E;&#x53C3;&#x6578;&#x61C9;&#x8A72;&#x5728;&#x4F55;&#x6642;&#x5207;&#x958B;(&#x5982;&#x5C0D; List &#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;), &#x4EE5;&#x53CA;&#x5728;&#x4F55;&#x8655;&#x57F7;&#x884C;&#x905E;&#x8FF4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4-syntax-in-function.html" class="navigation navigation-prev " aria-label="Previous page: Syntax in Function">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="6-high-order-function.html" class="navigation navigation-next " aria-label="Next page: High Order Function">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Recursion","level":"1.6","depth":1,"next":{"title":"High Order Function","level":"1.7","depth":1,"path":"6-high-order-function.md","ref":"6-high-order-function.md","articles":[]},"previous":{"title":"Syntax in Function","level":"1.5","depth":1,"path":"4-syntax-in-function.md","ref":"4-syntax-in-function.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-tw","gitbook":"*"},"file":{"path":"5-recursion.md","mtime":"2020-12-03T17:01:40.728Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-03T17:01:59.781Z"},"basePath":".","book":{"language":"zh-tw"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

